-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/damiancclarke/investigacion/Activa/MMR/Log/naturalExperiment
> s.txt
  log type:  text
 opened on:  14 Sep 2015, 16:17:16

. 
. local opts cells("count mean sd min max")

. local linef lcolor(black) lpattern(dash)

. 
. *****************************************************************************
> ***
. *** (2a) Nigeria Estimates Education
. *****************************************************************************
> ***
. local Ncont i.religion i.ethnicity i.stcode1967 i.yearbirth i.stcode1967*tren
> d

. local Biafra1 yr6769southeast yr6769nonwest_noSE 

. local Biafra2 reg_mexp0 reg_mexp1 reg_mexp2 reg_mexp3 reg_mexp4 mexp0 mexp1 /
> *
> */ mexp2 mexp3 mexp4

. local wt [pw=v005]

. local sampT yr6575==1|yr5661==1

. local sampP yr5055==1|yr5660==1

. 
. local se cluster(yearstate)

. 
. local treat1 yr7075nonwest yr6569nonwest

. local treat2 yr7075capexp53 yr6569capexp53 capexp53

. local treat3 nonwest_main_exposure nonwest_pre_exposure

. local treat4 capexp53_main_exposure capexp53_pre_exposure

. 
. local placebo1 yr5660nonwest

. local placebo2 yr5660capexp53 capexp53

. local placebo3 nonwest_main_exposure_fake

. local placebo4 capexp53_main_exposure_fake

. 
. 
. use "$DAT/Nigeria/educ", clear
(educ data for Nigeria from DHS IR (Bhalotra and Clarke, 2015))

. replace educ=. if educ>25
(32 real changes made, 32 to missing)

. gen yearstate=yearbirth*100*stcode1967
(1423 missing values generated)

. estpost sum educ capexp53 yearbirth if (yr6575==1|yr5661==1)

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd) 
-------------+-------------------------------------------------------
   education |     13221      13221   4.822177   28.60839   5.348681 
    capexp53 |     12748      12748   .8869422   .2954761   .5435771 
   yearbirth |     13235      13235   1968.329   26.20306   5.118892 

             |    e(min)     e(max)     e(sum) 
-------------+---------------------------------
   education |         0         22      63754 
    capexp53 |   .014032   2.195955   11306.74 
   yearbirth |      1956       1975   2.61e+07 

. estout using "$OUT/tables/sumStatsCountry.xls", replace `opts'
(output written to ~/investigacion/Activa/MMR/Results/tables/sumStatsCountry.xl
> s)

. 
. 
. **TREATMENT
. xi: reg educ `treat2' `Ncont' `Biafra1' `wt' if `sampT', robust `se'
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1949-1993(naturally coded; _Iyearbirth_1949 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   1.2961e+10)
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1951 omitted because of collinearity
note: _Iyearbirth_1952 omitted because of collinearity
note: _Iyearbirth_1953 omitted because of collinearity
note: _Iyearbirth_1954 omitted because of collinearity
note: _Iyearbirth_1955 omitted because of collinearity
note: _Iyearbirth_1956 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity

Linear regression                                      Number of obs =   12735
                                                       F( 51,   202) =  326.92
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4246
                                                       Root MSE      =  4.1075

                            (Std. Err. adjusted for 203 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
yr7075cap~53 |   .9825799   .5552441     1.77   0.078    -.1122378    2.077398
yr6569cap~53 |   .6711895   .3822907     1.76   0.081    -.0826028    1.424982
    capexp53 |   .3596235   .5129461     0.70   0.484     -.651792    1.371039
_Ireligion_2 |   3.622382   .2370985    15.28   0.000     3.154876    4.089887
_Ireligion_3 |   3.695199   .1921696    19.23   0.000     3.316283    4.074115
_Ireligion_4 |  -1.188153   .2914769    -4.08   0.000    -1.762881   -.6134259
_Ireligion_5 |   3.475233   .2404322    14.45   0.000     3.001154    3.949312
_Iethnicit~2 |  -2.361169   .3417937    -6.91   0.000     -3.03511   -1.687228
_Iethnicit~3 |  -3.228641   .3839249    -8.41   0.000    -3.985656   -2.471627
_Iethnicit~4 |   1.167624   .3751956     3.11   0.002     .4278219    1.907426
_Iethnicit~5 |  -2.423314   .3661793    -6.62   0.000    -3.145338    -1.70129
_Istcode1~_2 |  -.5017467   1.201412    -0.42   0.677    -2.870664     1.86717
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |   2.840505   1.351435     2.10   0.037     .1757766    5.505233
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |   1.279902   1.028871     1.24   0.215    -.7488023    3.308606
_Istcode19~9 |   3.044673    .840767     3.62   0.000     1.386868    4.702479
_Istcode1~10 |   1.161258   1.410339     0.82   0.411    -1.619617    3.942134
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |   .6678206   1.706029     0.39   0.696    -2.696089    4.031731
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |          0  (omitted)
_Iyearb~1952 |          0  (omitted)
_Iyearb~1953 |          0  (omitted)
_Iyearb~1954 |          0  (omitted)
_Iyearb~1955 |          0  (omitted)
_Iyearb~1956 |          0  (omitted)
_Iyearb~1957 |   .1841211   .5870336     0.31   0.754    -.9733785    1.341621
_Iyearb~1958 |   .1446405   .5406999     0.27   0.789    -.9214994     1.21078
_Iyearb~1959 |   .5681253   .3421495     1.66   0.098    -.1065172    1.242768
_Iyearb~1960 |   .7922289    .355893     2.23   0.027     .0904872    1.493971
_Iyearb~1961 |    .800755   .3718713     2.15   0.032     .0675075    1.534002
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |   .8338012   .2632629     3.17   0.002     .3147054    1.352897
_Iyearb~1966 |   .8079996   .2597657     3.11   0.002     .2957996      1.3202
_Iyearb~1967 |   .6220276   .3169171     1.96   0.051    -.0028623    1.246918
_Iyearb~1968 |  -.1093193   .2238201    -0.49   0.626    -.5506427    .3320041
_Iyearb~1969 |   .4202066   .2237809     1.88   0.062    -.0210394    .8614527
_Iyearb~1970 |   .2961982   .1939693     1.53   0.128    -.0862661    .6786624
_Iyearb~1971 |   .0841807   .1961083     0.43   0.668    -.3025011    .4708626
_Iyearb~1972 |   .0331722   .1607266     0.21   0.837    -.2837449    .3500892
_Iyearb~1973 |  -.4251716   .1448737    -2.93   0.004    -.7108302    -.139513
_Iyearb~1974 |   .4400436   .1909529     2.30   0.022      .063527    .8165601
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |   2.559105   .9636472     2.66   0.009     .6590078    4.459203
_Istcode19~4 |  -.7817017   .9610369    -0.81   0.417    -2.676653    1.113249
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |   2.644716   .8017033     3.30   0.001     1.063935    4.225496
_Istcode19~7 |   1.668969   1.178777     1.42   0.158    -.6553172    3.993256
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |   .6771639   1.207655     0.56   0.576    -1.704062     3.05839
_Istcode1~12 |          0  (omitted)
       trend |   .1288686   .0666503     1.93   0.055     -.002551    .2602881
_IstcXtren_2 |   .1288545   .0524738     2.46   0.015     .0253878    .2323212
_IstcXtren_3 |  -.0314753   .0439224    -0.72   0.474    -.1180805    .0551298
_IstcXtren_4 |   .1694297    .043465     3.90   0.000     .0837264     .255133
_IstcXtren_5 |   .0811944   .0611075     1.33   0.185     -.039296    .2016848
_IstcXtren_6 |   .0256966   .0360901     0.71   0.477    -.0454651    .0968583
_IstcXtren_7 |   .0110005   .0557367     0.20   0.844    -.0988998    .1209009
_IstcXtren_8 |  -.0018488   .0467757    -0.04   0.969    -.0940801    .0903825
_IstcXtren_9 |  -.0929653   .0391335    -2.38   0.018    -.1701277   -.0158028
_IstcXtre~10 |   .1167339   .0642698     1.82   0.071    -.0099919    .2434596
_IstcXtre~11 |   .0526067   .0531906     0.99   0.324    -.0522734    .1574868
_IstcXtre~12 |   .0933851    .076213     1.23   0.222    -.0568899    .2436602
yr6769sout~t |    .441058   .2677346     1.65   0.101     -.086855     .968971
yr6769nonw~E |   .0125281   .2294008     0.05   0.957    -.4397993    .4648555
       _cons |  -1.171009   1.574235    -0.74   0.458    -4.275049    1.933032
------------------------------------------------------------------------------

. outreg2 `treat2' using "$OUT/tables/Nigeria.xls", excel replace
~/investigacion/Activa/MMR/Results/tables/Nigeria.xls
dir : seeout

. xi: reg educ `treat1' `Ncont' `Biafra1' `wt' if `sampT', robust `se'
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1949-1993(naturally coded; _Iyearbirth_1949 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   1.2961e+10)
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1951 omitted because of collinearity
note: _Iyearbirth_1952 omitted because of collinearity
note: _Iyearbirth_1953 omitted because of collinearity
note: _Iyearbirth_1954 omitted because of collinearity
note: _Iyearbirth_1955 omitted because of collinearity
note: _Iyearbirth_1956 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity

Linear regression                                      Number of obs =   12735
                                                       F( 50,   202) =  372.27
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4235
                                                       Root MSE      =  4.1111

                            (Std. Err. adjusted for 203 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
yr7075nonw~t |   2.146502   .7896087     2.72   0.007     .5895694    3.703435
yr6569nonw~t |   1.040462   .4447427     2.34   0.020     .1635286    1.917396
_Ireligion_2 |   3.670595    .237015    15.49   0.000     3.203254    4.137935
_Ireligion_3 |   3.756644    .192974    19.47   0.000     3.376142    4.137146
_Ireligion_4 |  -1.228021   .2988294    -4.11   0.000    -1.817245   -.6387955
_Ireligion_5 |   3.542932   .2435988    14.54   0.000      3.06261    4.023255
_Iethnicit~2 |  -2.375909   .3415096    -6.96   0.000     -3.04929   -1.702528
_Iethnicit~3 |  -3.279202   .3843804    -8.53   0.000    -4.037115    -2.52129
_Iethnicit~4 |   1.185916   .3746347     3.17   0.002     .4472193    1.924612
_Iethnicit~5 |  -2.413723     .36358    -6.64   0.000    -3.130621   -1.696824
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |   1.645898    1.02186     1.61   0.109    -.3689831    3.660779
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |   3.383949   .5948219     5.69   0.000     2.211092    4.556805
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |   .5791442   1.230065     0.47   0.638     -1.84627    3.004558
_Istcode1~12 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |          0  (omitted)
_Iyearb~1952 |          0  (omitted)
_Iyearb~1953 |          0  (omitted)
_Iyearb~1954 |          0  (omitted)
_Iyearb~1955 |          0  (omitted)
_Iyearb~1956 |          0  (omitted)
_Iyearb~1957 |   .2238206   .5617211     0.40   0.691    -.8837684     1.33141
_Iyearb~1958 |   .2147591   .5076913     0.42   0.673    -.7862951    1.215813
_Iyearb~1959 |   .6946868   .3178802     2.19   0.030     .0678979    1.321476
_Iyearb~1960 |   .9591124   .3430093     2.80   0.006     .2827745     1.63545
_Iyearb~1961 |   1.005925   .3587196     2.80   0.006     .2986098     1.71324
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |   .9855392   .2581871     3.82   0.000     .4764516    1.494627
_Iyearb~1966 |   1.005911   .2350036     4.28   0.000     .5425363    1.469286
_Iyearb~1967 |   .5599394   .3305156     1.69   0.092    -.0917637    1.211643
_Iyearb~1968 |  -.1102536   .2201693    -0.50   0.617    -.5443785    .3238713
_Iyearb~1969 |   .4637254   .2268176     2.04   0.042     .0164916    .9109592
_Iyearb~1970 |   .0982947   .2083409     0.47   0.638    -.3125072    .5090966
_Iyearb~1971 |  -.0814934   .2296897    -0.35   0.723    -.5343904    .3714036
_Iyearb~1972 |  -.0880509   .1696782    -0.52   0.604    -.4226185    .2465168
_Iyearb~1973 |  -.5140878   .1488786    -3.45   0.001    -.8076433   -.2205323
_Iyearb~1974 |   .4157355    .208076     2.00   0.047      .005456    .8260149
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Istcode1~_2 |  -.1114376   .6879994    -0.16   0.871    -1.468019    1.245144
_Istcode19~3 |   2.917011   .6415255     4.55   0.000     1.652065    4.181957
_Istcode19~4 |  -.5408513   .7118288    -0.76   0.448    -1.944419    .8627166
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |    2.79639   .7111393     3.93   0.000     1.394182    4.198598
_Istcode19~7 |   2.083391    .819435     2.54   0.012     .4676476    3.699134
_Istcode19~8 |   1.639222   .6243125     2.63   0.009      .408217    2.870228
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |   1.475451   1.143172     1.29   0.198    -.7786295    3.729531
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |  -.4008342    1.02687    -0.39   0.697    -2.425594    1.623926
       trend |   .1114964   .0551627     2.02   0.045     .0027279    .2202649
_IstcXtren_2 |    .049625   .0285212     1.74   0.083    -.0066125    .1058626
_IstcXtren_3 |  -.0874001   .0296437    -2.95   0.004    -.1458509   -.0289493
_IstcXtren_4 |   .1197169   .0322952     3.71   0.000      .056038    .1833958
_IstcXtren_5 |   .1478531   .0672017     2.20   0.029     .0153464    .2803598
_IstcXtren_6 |  -.0043466    .031781    -0.14   0.891    -.0670116    .0583185
_IstcXtren_7 |   -.057256    .040638    -1.41   0.160    -.1373851    .0228731
_IstcXtren_8 |  -.0664446   .0288932    -2.30   0.022    -.1234155   -.0094737
_IstcXtren_9 |  -.1399876   .0282919    -4.95   0.000    -.1957729   -.0842024
_IstcXtre~10 |   .0523438   .0526329     0.99   0.321    -.0514365    .1561241
_IstcXtre~11 |   .0806772   .0545652     1.48   0.141    -.0269133    .1882677
_IstcXtre~12 |   .1278679   .0667717     1.91   0.057    -.0037911    .2595268
yr6769sout~t |   .8164995    .344525     2.37   0.019     .1371729    1.495826
yr6769nonw~E |    .394912   .2999701     1.32   0.189    -.1965624    .9863864
       _cons |   -.478221   .8955224    -0.53   0.594    -2.243992     1.28755
------------------------------------------------------------------------------

. outreg2 `treat1' using "$OUT/tables/Nigeria.xls", excel append
~/investigacion/Activa/MMR/Results/tables/Nigeria.xls
dir : seeout

. xi: reg educ `treat3' `Ncont' `Biafra2' `wt' if `sampT', robust `se'
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1949-1993(naturally coded; _Iyearbirth_1949 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   1.2961e+10)
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1951 omitted because of collinearity
note: _Iyearbirth_1952 omitted because of collinearity
note: _Iyearbirth_1953 omitted because of collinearity
note: _Iyearbirth_1954 omitted because of collinearity
note: _Iyearbirth_1955 omitted because of collinearity
note: _Iyearbirth_1956 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity

Linear regression                                      Number of obs =   12735
                                                       F( 58,   202) =  295.79
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4259
                                                       Root MSE      =  4.1041

                            (Std. Err. adjusted for 203 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
nonwest_m~re |   .0573625   .0544905     1.05   0.294    -.0500806    .1648055
nonwest_pr~e |   .0924523   .0640987     1.44   0.151     -.033936    .2188407
_Ireligion_2 |   3.661592   .2350579    15.58   0.000      3.19811    4.125074
_Ireligion_3 |   3.736365   .1923323    19.43   0.000     3.357129    4.115602
_Ireligion_4 |  -1.236073   .3004472    -4.11   0.000    -1.828488   -.6436576
_Ireligion_5 |   3.545028   .2413431    14.69   0.000     3.069153    4.020902
_Iethnicit~2 |    -2.3466   .3425519    -6.85   0.000    -3.022036   -1.671164
_Iethnicit~3 |  -3.279846   .3854347    -8.51   0.000    -4.039837   -2.519854
_Iethnicit~4 |   1.194184   .3765577     3.17   0.002     .4516964    1.936672
_Iethnicit~5 |  -2.413129   .3645001    -6.62   0.000    -3.131842   -1.694416
_Istcode1~_2 |   4.391218   1.996594     2.20   0.029     .4543792    8.328057
_Istcode19~3 |   2.837684   .6325265     4.49   0.000     1.590482    4.084885
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |   3.147597   .8628101     3.65   0.000     1.446328    4.848867
_Istcode19~6 |   2.808609   .7197682     3.90   0.000     1.389386    4.227831
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |   3.316977   .6117573     5.42   0.000     2.110728    4.523227
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |   1.185508   .8828315     1.34   0.181    -.5552395    2.926255
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |          0  (omitted)
_Iyearb~1952 |          0  (omitted)
_Iyearb~1953 |          0  (omitted)
_Iyearb~1954 |          0  (omitted)
_Iyearb~1955 |          0  (omitted)
_Iyearb~1956 |          0  (omitted)
_Iyearb~1957 |  -.7669465   .7698463    -1.00   0.320    -2.284912     .751019
_Iyearb~1958 |   -1.90635   1.686478    -1.13   0.260    -5.231709    1.419009
_Iyearb~1959 |  -.4687867   1.719384    -0.27   0.785    -3.859028    2.921455
_Iyearb~1960 |   .7839337   1.834436     0.43   0.670    -2.833165    4.401033
_Iyearb~1961 |   1.562752   1.936948     0.81   0.421    -2.256477    5.381982
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |  -5.972014   3.161488    -1.89   0.060    -12.20576    .2617365
_Iyearb~1966 |  -6.250304   2.873169    -2.18   0.031    -11.91555   -.5850534
_Iyearb~1967 |   -6.30343   2.593438    -2.43   0.016    -11.41711   -1.189748
_Iyearb~1968 |  -5.434652   2.319126    -2.34   0.020    -10.00745   -.8618531
_Iyearb~1969 |  -4.934448   1.959764    -2.52   0.013    -8.798668   -1.070229
_Iyearb~1970 |  -5.017792   1.622992    -3.09   0.002    -8.217971   -1.817613
_Iyearb~1971 |  -4.212365   1.312082    -3.21   0.002    -6.799497   -1.625232
_Iyearb~1972 |  -3.198033   .9819321    -3.26   0.001    -5.134184   -1.261881
_Iyearb~1973 |  -2.590612   .6621721    -3.91   0.000    -3.896268   -1.284956
_Iyearb~1974 |  -.6323842   .3882199    -1.63   0.105    -1.397867     .133099
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -.4788965   .6817569    -0.70   0.483    -1.823169    .8653764
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |   2.059237    .792973     2.60   0.010      .495671    3.622803
_Istcode19~8 |   1.569895   .6424003     2.44   0.015     .3032245    2.836565
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |   6.105625   2.163829     2.82   0.005     1.839036    10.37221
_Istcode1~11 |   5.003261   2.066328     2.42   0.016     .9289219      9.0776
_Istcode1~12 |          0  (omitted)
       trend |  -.7997243   .3246817    -2.46   0.015    -1.439924   -.1595243
_IstcXtren_2 |  -.1302331   .0814789    -1.60   0.112    -.2908912    .0304251
_IstcXtren_3 |  -.0849024   .0293561    -2.89   0.004    -.1427862   -.0270187
_IstcXtren_4 |   .1158251    .031357     3.69   0.000     .0539961    .1776541
_IstcXtren_5 |   .0080014   .0403203     0.20   0.843    -.0715014    .0875041
_IstcXtren_6 |  -.0055448   .0326143    -0.17   0.865    -.0698529    .0587634
_IstcXtren_7 |  -.0560895   .0394014    -1.42   0.156    -.1337803    .0216013
_IstcXtren_8 |  -.0641422   .0300176    -2.14   0.034    -.1233302   -.0049541
_IstcXtren_9 |  -.1372134   .0293691    -4.67   0.000    -.1951227   -.0793041
_IstcXtre~10 |  -.1339033   .0918264    -1.46   0.146    -.3149645     .047158
_IstcXtre~11 |  -.0973408   .0850756    -1.14   0.254     -.265091    .0704093
_IstcXtre~12 |  -.0146692    .039005    -0.38   0.707    -.0915783    .0622399
   reg_mexp0 |   .0526284   .0595301     0.88   0.378    -.0647516    .1700084
   reg_mexp1 |  -.0532348   .0179831    -2.96   0.003    -.0886935   -.0177761
   reg_mexp2 |  -.0272173   .0262915    -1.04   0.302    -.0790583    .0246237
   reg_mexp3 |  -.0831572   .0327411    -2.54   0.012    -.1477154   -.0185991
   reg_mexp4 |  -.0290168   .0535255    -0.54   0.588    -.1345572    .0765236
       mexp0 |  -.1503948   .0539618    -2.79   0.006    -.2567953   -.0439942
       mexp1 |  -.0394937   .0239373    -1.65   0.101    -.0866927    .0077052
       mexp2 |  -.1500684   .0442301    -3.39   0.001    -.2372804   -.0628564
       mexp3 |  -.5041727   .1887341    -2.67   0.008    -.8763143   -.1320312
       mexp4 |  -.7312085   .2117643    -3.45   0.001    -1.148761   -.3136564
       _cons |   26.36555    8.71758     3.02   0.003     9.176424    43.55468
------------------------------------------------------------------------------

. outreg2 `treat3' using "$OUT/tables/Nigeria.xls", excel append
~/investigacion/Activa/MMR/Results/tables/Nigeria.xls
dir : seeout

. xi: reg educ `treat4' `Ncont' `Biafra2' `wt' if `sampT', robust `se'
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1949-1993(naturally coded; _Iyearbirth_1949 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   1.2961e+10)
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1951 omitted because of collinearity
note: _Iyearbirth_1952 omitted because of collinearity
note: _Iyearbirth_1953 omitted because of collinearity
note: _Iyearbirth_1954 omitted because of collinearity
note: _Iyearbirth_1955 omitted because of collinearity
note: _Iyearbirth_1956 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity

Linear regression                                      Number of obs =   12735
                                                       F( 58,   202) =  279.24
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4267
                                                       Root MSE      =  4.1013

                            (Std. Err. adjusted for 203 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
capexp53_m.. |   .1748548   .0451362     3.87   0.000     .0858563    .2638533
capexp53_p~e |   .1948867    .054022     3.61   0.000     .0883674    .3014061
_Ireligion_2 |   3.646825   .2354952    15.49   0.000     3.182481    4.111169
_Ireligion_3 |   3.709903   .1900305    19.52   0.000     3.335205    4.084601
_Ireligion_4 |  -1.219232   .2969817    -4.11   0.000    -1.804814   -.6336503
_Ireligion_5 |    3.51602   .2384878    14.74   0.000     3.045775    3.986265
_Iethnicit~2 |  -2.331108   .3429271    -6.80   0.000    -3.007284   -1.654932
_Iethnicit~3 |  -3.248969   .3841776    -8.46   0.000    -4.006482   -2.491457
_Iethnicit~4 |   1.186051   .3759838     3.15   0.002      .444695    1.927408
_Iethnicit~5 |  -2.409583   .3650892    -6.60   0.000    -3.129458   -1.689709
_Istcode1~_2 |   3.777126    1.93098     1.96   0.052    -.0303369     7.58459
_Istcode19~3 |   2.523989   .6523637     3.87   0.000     1.237673    3.810305
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |   2.822146   .8734155     3.23   0.001     1.099965    4.544327
_Istcode19~6 |   2.655991   .7192747     3.69   0.000     1.237741     4.07424
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |   1.239967   .6646107     1.87   0.064    -.0704977    2.550431
_Istcode19~9 |   3.058308   .6197383     4.93   0.000     1.836323    4.280294
_Istcode1~10 |    5.55752   2.099988     2.65   0.009     1.416812    9.698228
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |   .7122278   .9107564     0.78   0.435    -1.083581    2.508037
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |          0  (omitted)
_Iyearb~1952 |          0  (omitted)
_Iyearb~1953 |          0  (omitted)
_Iyearb~1954 |          0  (omitted)
_Iyearb~1955 |          0  (omitted)
_Iyearb~1956 |          0  (omitted)
_Iyearb~1957 |  -.7538592   .7718174    -0.98   0.330    -2.275711    .7679929
_Iyearb~1958 |  -1.887207   1.689999    -1.12   0.265    -5.219508    1.445094
_Iyearb~1959 |  -.4426811   1.722868    -0.26   0.797    -3.839793    2.954431
_Iyearb~1960 |   .8238626   1.837779     0.45   0.654    -2.799829    4.447554
_Iyearb~1961 |   1.611154   1.934542     0.83   0.406    -2.203333     5.42564
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |  -5.946346   3.166997    -1.88   0.062    -12.19096    .2982667
_Iyearb~1966 |  -6.306576   2.877238    -2.19   0.030    -11.97985    -.633303
_Iyearb~1967 |  -6.442682   2.596678    -2.48   0.014    -11.56275   -1.322612
_Iyearb~1968 |  -5.688089   2.327295    -2.44   0.015      -10.277   -1.099182
_Iyearb~1969 |  -5.267739   1.969716    -2.67   0.008    -9.151581   -1.383898
_Iyearb~1970 |  -5.488662   1.626027    -3.38   0.001    -8.694825   -2.282498
_Iyearb~1971 |  -4.663775   1.318266    -3.54   0.001    -7.263102   -2.064449
_Iyearb~1972 |  -3.532687   .9838936    -3.59   0.000    -5.472707   -1.592668
_Iyearb~1973 |  -2.806868   .6668885    -4.21   0.000    -4.121823   -1.491912
_Iyearb~1974 |  -.7351664   .3817505    -1.93   0.056    -1.487893    .0175606
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -.7384826   .6937088    -1.06   0.288    -2.106322    .6293567
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |   1.695631   .8059079     2.10   0.037     .1065605    3.284702
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |   4.811455   1.991069     2.42   0.017     .8855096    8.737401
_Istcode1~12 |          0  (omitted)
       trend |  -.8435597   .3250522    -2.60   0.010     -1.48449   -.2026291
_IstcXtren_2 |  -.0769747   .0791502    -0.97   0.332    -.2330413     .079092
_IstcXtren_3 |  -.0532981   .0306243    -1.74   0.083    -.1136824    .0070863
_IstcXtren_4 |   .1449179   .0320893     4.52   0.000      .081645    .2081909
_IstcXtren_5 |   .0431052   .0410338     1.05   0.295    -.0378042    .1240147
_IstcXtren_6 |   .0118439   .0322214     0.37   0.714    -.0516896    .0753774
_IstcXtren_7 |  -.0180931   .0403951    -0.45   0.655    -.0977433    .0615571
_IstcXtren_8 |  -.0281825   .0315969    -0.89   0.373    -.0904846    .0341197
_IstcXtren_9 |  -.1115912   .0297591    -3.75   0.000    -.1702695   -.0529129
_IstcXtre~10 |  -.0885448   .0892594    -0.99   0.322    -.2645445    .0874549
_IstcXtre~11 |  -.0981163    .081459    -1.20   0.230    -.2587354    .0625027
_IstcXtre~12 |   .0381176   .0420979     0.91   0.366      -.04489    .1211252
   reg_mexp0 |   .0539395   .0557839     0.97   0.335     -.056054     .163933
   reg_mexp1 |  -.0509781   .0172659    -2.95   0.004    -.0850226   -.0169336
   reg_mexp2 |   -.024287   .0264612    -0.92   0.360    -.0764626    .0278886
   reg_mexp3 |  -.0790376   .0309987    -2.55   0.012    -.1401602   -.0179151
   reg_mexp4 |  -.0232769   .0516004    -0.45   0.652    -.1250215    .0784676
       mexp0 |  -.1475589   .0553061    -2.67   0.008    -.2566102   -.0385076
       mexp1 |  -.0404851   .0240821    -1.68   0.094    -.0879695    .0069994
       mexp2 |  -.1509298   .0441086    -3.42   0.001    -.2379022   -.0639575
       mexp3 |  -.5074813   .1889513    -2.69   0.008    -.8800512   -.1349114
       mexp4 |  -.7346604    .212009    -3.47   0.001    -1.152695   -.3166258
       _cons |   26.86815   8.726064     3.08   0.002      9.66229      44.074
------------------------------------------------------------------------------

. outreg2 `treat4' using "$OUT/tables/Nigeria.xls", excel append
~/investigacion/Activa/MMR/Results/tables/Nigeria.xls
dir : seeout

. 
. **PLACEBO
. 
. xi: reg educ `placebo2' `Ncont' `Biafra1' `wt' if `sampP', robust `se'
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1949-1993(naturally coded; _Iyearbirth_1949 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   2.6458e+09)
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1960 omitted because of collinearity
note: _Iyearbirth_1961 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1965 omitted because of collinearity
note: _Iyearbirth_1966 omitted because of collinearity
note: _Iyearbirth_1967 omitted because of collinearity
note: _Iyearbirth_1968 omitted because of collinearity
note: _Iyearbirth_1969 omitted because of collinearity
note: _Iyearbirth_1970 omitted because of collinearity
note: _Iyearbirth_1971 omitted because of collinearity
note: _Iyearbirth_1972 omitted because of collinearity
note: _Iyearbirth_1973 omitted because of collinearity
note: _Iyearbirth_1974 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: yr6769southeast omitted because of collinearity
note: yr6769nonwest_noSE omitted because of collinearity

Linear regression                                      Number of obs =    2617
                                                       F( 42,   127) =  162.89
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2993
                                                       Root MSE      =  3.8989

                            (Std. Err. adjusted for 128 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
yr5660cap~53 |   1.533925   .8180502     1.88   0.063    -.0848491    3.152698
    capexp53 |  -.2423868   .8716702    -0.28   0.781    -1.967265    1.482491
_Ireligion_2 |   2.901442    .342598     8.47   0.000     2.223503    3.579382
_Ireligion_3 |   3.133716   .3271693     9.58   0.000     2.486307    3.781125
_Ireligion_4 |  -.4831332   .3443972    -1.40   0.163    -1.164633    .1983668
_Ireligion_5 |   1.891666   .3668251     5.16   0.000     1.165785    2.617546
_Iethnicit~2 |   .0037136   .7092495     0.01   0.996    -1.399763     1.40719
_Iethnicit~3 |   -1.55626   .6525092    -2.39   0.019    -2.847458   -.2650618
_Iethnicit~4 |   2.390809   .6256862     3.82   0.000     1.152689    3.628929
_Iethnicit~5 |  -.9091982   .5932564    -1.53   0.128    -2.083146    .2647491
_Istcode1~_2 |  -2.214793   1.831923    -1.21   0.229    -5.839839    1.410253
_Istcode19~3 |  -.2935727   1.482247    -0.20   0.843    -3.226672    2.639527
_Istcode19~4 |  -3.117157   1.618249    -1.93   0.056     -6.31938     .085067
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |  -.2823368   1.878176    -0.15   0.881    -3.998909    3.434235
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |   -.659739   1.483068    -0.44   0.657    -3.594463    2.274985
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |   .4278489   2.290585     0.19   0.852    -4.104805    4.960503
_Istcode1~12 |  -5.165776   2.368767    -2.18   0.031    -9.853138   -.4784145
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |  -.8496601   .5556697    -1.53   0.129     -1.94923    .2499099
_Iyearb~1952 |  -.7612108   .6315628    -1.21   0.230     -2.01096    .4885381
_Iyearb~1953 |  -.3431428   .3931521    -0.87   0.384     -1.12112    .4348342
_Iyearb~1954 |  -.4788311   .3786962    -1.26   0.208    -1.228203    .2705404
_Iyearb~1955 |   .3077729   .6083122     0.51   0.614    -.8959672    1.511513
_Iyearb~1956 |  -1.473673   .4702023    -3.13   0.002    -2.404118   -.5432271
_Iyearb~1957 |  -1.082499   .4747383    -2.28   0.024    -2.021921   -.1430778
_Iyearb~1958 |  -1.056417   .4566331    -2.31   0.022    -1.960012   -.1528225
_Iyearb~1959 |   -.515991   .1670052    -3.09   0.002    -.8464641   -.1855179
_Iyearb~1960 |          0  (omitted)
_Iyearb~1961 |          0  (omitted)
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |          0  (omitted)
_Iyearb~1966 |          0  (omitted)
_Iyearb~1967 |          0  (omitted)
_Iyearb~1968 |          0  (omitted)
_Iyearb~1969 |          0  (omitted)
_Iyearb~1970 |          0  (omitted)
_Iyearb~1971 |          0  (omitted)
_Iyearb~1972 |          0  (omitted)
_Iyearb~1973 |          0  (omitted)
_Iyearb~1974 |          0  (omitted)
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |  -2.526575   2.375307    -1.06   0.289    -7.226878    2.173728
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |   .4839974    1.85869     0.26   0.795    -3.194015     4.16201
_Istcode19~8 |  -1.076162   1.465561    -0.73   0.464    -3.976244    1.823919
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |   2.945484   5.012905     0.59   0.558    -6.974149    12.86512
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |          0  (omitted)
       trend |  -.3780909   .2123212    -1.78   0.077    -.7982361    .0420544
_IstcXtren_2 |   .4659439   .1719627     2.71   0.008     .1256607    .8062271
_IstcXtren_3 |   .1791645   .1514994     1.18   0.239    -.1206255    .4789544
_IstcXtren_4 |   .3783585   .1655416     2.29   0.024     .0507816    .7059354
_IstcXtren_5 |   .6280543   .2463337     2.55   0.012     .1406045    1.115504
_IstcXtren_6 |   .2498973   .1803166     1.39   0.168    -.1069167    .6067112
_IstcXtren_7 |   .1337832   .1865851     0.72   0.475     -.235435    .5030014
_IstcXtren_8 |   .2031337   .1551052     1.31   0.193    -.1037914    .5100589
_IstcXtren_9 |   .2280462   .1496898     1.52   0.130    -.0681629    .5242553
_IstcXtre~10 |  -.0471648   .4441171    -0.11   0.916    -.9259925    .8316628
_IstcXtre~11 |  -.0767047    .217817    -0.35   0.725    -.5077251    .3543158
_IstcXtre~12 |   .7160288   .2241874     3.19   0.002     .2724024    1.159655
yr6769sout~t |          0  (omitted)
yr6769nonw~E |          0  (omitted)
       _cons |   3.376632   2.335983     1.45   0.151    -1.245857     7.99912
------------------------------------------------------------------------------

. outreg2 `placebo2' using "$OUT/tables/NigeriaPlacebo.xls", excel replace
~/investigacion/Activa/MMR/Results/tables/NigeriaPlacebo.xls
dir : seeout

. xi: reg educ `placebo1' `Ncont' `Biafra1' `wt' if `sampP', robust `se'
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1949-1993(naturally coded; _Iyearbirth_1949 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   2.6458e+09)
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1960 omitted because of collinearity
note: _Iyearbirth_1961 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1965 omitted because of collinearity
note: _Iyearbirth_1966 omitted because of collinearity
note: _Iyearbirth_1967 omitted because of collinearity
note: _Iyearbirth_1968 omitted because of collinearity
note: _Iyearbirth_1969 omitted because of collinearity
note: _Iyearbirth_1970 omitted because of collinearity
note: _Iyearbirth_1971 omitted because of collinearity
note: _Iyearbirth_1972 omitted because of collinearity
note: _Iyearbirth_1973 omitted because of collinearity
note: _Iyearbirth_1974 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: yr6769southeast omitted because of collinearity
note: yr6769nonwest_noSE omitted because of collinearity

Linear regression                                      Number of obs =    2617
                                                       F( 41,   127) =  154.61
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2975
                                                       Root MSE      =  3.9034

                            (Std. Err. adjusted for 128 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
yr5660nonw~t |   1.448787   1.176595     1.23   0.220    -.8794831    3.777057
_Ireligion_2 |   2.944024   .3350577     8.79   0.000     2.281005    3.607042
_Ireligion_3 |   3.195913   .3210252     9.96   0.000     2.560662    3.831164
_Ireligion_4 |  -.4935874   .3491767    -1.41   0.160    -1.184545    .1973703
_Ireligion_5 |   1.949757   .3579176     5.45   0.000     1.241502    2.658011
_Iethnicit~2 |    .003278   .7147003     0.00   0.996    -1.410985    1.417541
_Iethnicit~3 |  -1.585167   .6503541    -2.44   0.016      -2.8721   -.2982333
_Iethnicit~4 |   2.413733    .631993     3.82   0.000     1.163133    3.664333
_Iethnicit~5 |  -.8723147   .5986797    -1.46   0.148    -2.056994    .3123644
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -2.303116    1.29872    -1.77   0.079    -4.873049    .2668167
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |    .241639   1.745468     0.14   0.890    -3.212328    3.695606
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |   .3543041   2.331395     0.15   0.879    -4.259107    4.967715
_Istcode1~12 |  -4.096918   1.184376    -3.46   0.001    -6.440584   -1.753252
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |  -.8786908   .5557199    -1.58   0.116     -1.97836    .2209785
_Iyearb~1952 |  -.8157443   .6403209    -1.27   0.205    -2.082824    .4513352
_Iyearb~1953 |  -.3597146   .4565858    -0.79   0.432    -1.263215    .5437862
_Iyearb~1954 |  -.5134364   .4414171    -1.16   0.247    -1.386921    .3600484
_Iyearb~1955 |   .2130185   .6766728     0.31   0.753    -1.125995    1.552032
_Iyearb~1956 |  -1.413778   .4713641    -3.00   0.003    -2.346523    -.481034
_Iyearb~1957 |  -1.025266   .4965866    -2.06   0.041    -2.007921   -.0426109
_Iyearb~1958 |  -1.018514   .5184072    -1.96   0.052    -2.044348    .0073206
_Iyearb~1959 |  -.4970751   .1880237    -2.64   0.009      -.86914   -.1250101
_Iyearb~1960 |          0  (omitted)
_Iyearb~1961 |          0  (omitted)
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |          0  (omitted)
_Iyearb~1966 |          0  (omitted)
_Iyearb~1967 |          0  (omitted)
_Iyearb~1968 |          0  (omitted)
_Iyearb~1969 |          0  (omitted)
_Iyearb~1970 |          0  (omitted)
_Iyearb~1971 |          0  (omitted)
_Iyearb~1972 |          0  (omitted)
_Iyearb~1973 |          0  (omitted)
_Iyearb~1974 |          0  (omitted)
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Istcode1~_2 |  -1.008463   1.126147    -0.90   0.372    -3.236904    1.219978
_Istcode19~3 |   .6292375   1.035532     0.61   0.545    -1.419894    2.678369
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |  -1.912727   1.898929    -1.01   0.316    -5.670364     1.84491
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |   1.569554   1.413923     1.11   0.269    -1.228345    4.367453
_Istcode19~8 |  -.1606826   .9785138    -0.16   0.870    -2.096985     1.77562
_Istcode19~9 |    .039534   1.099284     0.04   0.971    -2.135752     2.21482
_Istcode1~10 |    3.84484   4.846752     0.79   0.429    -5.746008    13.43569
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |          0  (omitted)
       trend |  -.2155533   .1598318    -1.35   0.180    -.5318316    .1007249
_IstcXtren_2 |    .233659   .1062296     2.20   0.030     .0234498    .4438681
_IstcXtren_3 |   .0114393    .106166     0.11   0.914    -.1986441    .2215227
_IstcXtren_4 |   .2232749    .133393     1.67   0.097    -.0406857    .4872355
_IstcXtren_5 |   .5620273   .2526401     2.22   0.028     .0620982    1.061956
_IstcXtren_6 |   .1551724   .1644104     0.94   0.347    -.1701663     .480511
_IstcXtren_7 |  -.0684717   .1433299    -0.48   0.634    -.3520956    .2151522
_IstcXtren_8 |    .022357   .1058351     0.21   0.833    -.1870716    .2317855
_IstcXtren_9 |   .0993995    .112615     0.88   0.379    -.1234453    .3222442
_IstcXtre~10 |  -.2333798   .4252075    -0.55   0.584    -1.074789    .6080292
_IstcXtre~11 |  -.0236388   .2194971    -0.11   0.914     -.457984    .4107063
_IstcXtre~12 |    .553002   .1817545     3.04   0.003     .1933425    .9126614
yr6769sout~t |          0  (omitted)
yr6769nonw~E |          0  (omitted)
       _cons |   2.269042   1.159443     1.96   0.053     -.025287     4.56337
------------------------------------------------------------------------------

. outreg2 `placebo1' using "$OUT/tables/NigeriaPlacebo.xls", excel append
~/investigacion/Activa/MMR/Results/tables/NigeriaPlacebo.xls
dir : seeout

. xi: reg educ `placebo3' `Ncont' `Biafra2' `wt' if `sampP', robust `se'
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1949-1993(naturally coded; _Iyearbirth_1949 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   2.6458e+09)
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1960 omitted because of collinearity
note: _Iyearbirth_1961 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1965 omitted because of collinearity
note: _Iyearbirth_1966 omitted because of collinearity
note: _Iyearbirth_1967 omitted because of collinearity
note: _Iyearbirth_1968 omitted because of collinearity
note: _Iyearbirth_1969 omitted because of collinearity
note: _Iyearbirth_1970 omitted because of collinearity
note: _Iyearbirth_1971 omitted because of collinearity
note: _Iyearbirth_1972 omitted because of collinearity
note: _Iyearbirth_1973 omitted because of collinearity
note: _Iyearbirth_1974 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: reg_mexp0 omitted because of collinearity
note: reg_mexp1 omitted because of collinearity
note: reg_mexp2 omitted because of collinearity
note: mexp0 omitted because of collinearity
note: mexp1 omitted because of collinearity
note: mexp2 omitted because of collinearity

Linear regression                                      Number of obs =    2617
                                                       F( 45,   127) =   72.23
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3000
                                                       Root MSE      =  3.8994

                            (Std. Err. adjusted for 128 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
nonwest_m~ke |  -.3479893   .3361738    -1.04   0.303    -1.013217    .3172381
_Ireligion_2 |   2.964476   .3393089     8.74   0.000     2.293045    3.635907
_Ireligion_3 |   3.203474    .321825     9.95   0.000     2.566641    3.840308
_Ireligion_4 |  -.5715019   .3535052    -1.62   0.108    -1.271025    .1280212
_Ireligion_5 |    1.97272   .3560898     5.54   0.000     1.268082    2.677357
_Iethnicit~2 |   .0491267   .7165719     0.07   0.945     -1.36884    1.467093
_Iethnicit~3 |  -1.599417   .6495137    -2.46   0.015    -2.884688    -.314147
_Iethnicit~4 |   2.462025   .6266805     3.93   0.000     1.221937    3.702112
_Iethnicit~5 |  -.8803821   .5959633    -1.48   0.142    -2.059686    .2989218
_Istcode1~_2 |   .6673531   1.600812     0.42   0.677    -2.500365    3.835071
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -2.291908   1.270224    -1.80   0.074    -4.805452    .2216366
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |   1.622531   1.317908     1.23   0.221     -.985371    4.230433
_Istcode19~8 |  -.0315081   1.027946    -0.03   0.976    -2.065628    2.002612
_Istcode19~9 |  -.0030733   1.060215    -0.00   0.998    -2.101047    2.094901
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |  -.3301268   .6559871    -0.50   0.616    -1.628207    .9679533
_Iyearb~1952 |  -.4208906   .9773925    -0.43   0.667    -2.354974    1.513193
_Iyearb~1953 |  -.5118202   1.752273    -0.29   0.771    -3.979252    2.955611
_Iyearb~1954 |  -.5718396   2.056616    -0.28   0.781    -4.641512    3.497833
_Iyearb~1955 |   .5203237    2.19751     0.24   0.813    -3.828151    4.868799
_Iyearb~1956 |  -1.081199   1.438044    -0.75   0.454    -3.926829    1.764432
_Iyearb~1957 |   -1.74388   .9982509    -1.75   0.083    -3.719239    .2314781
_Iyearb~1958 |  -2.673468   .8774328    -3.05   0.003    -4.409749   -.9371865
_Iyearb~1959 |  -1.357605   .4048503    -3.35   0.001     -2.15873   -.5564792
_Iyearb~1960 |          0  (omitted)
_Iyearb~1961 |          0  (omitted)
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |          0  (omitted)
_Iyearb~1966 |          0  (omitted)
_Iyearb~1967 |          0  (omitted)
_Iyearb~1968 |          0  (omitted)
_Iyearb~1969 |          0  (omitted)
_Iyearb~1970 |          0  (omitted)
_Iyearb~1971 |          0  (omitted)
_Iyearb~1972 |          0  (omitted)
_Iyearb~1973 |          0  (omitted)
_Iyearb~1974 |          0  (omitted)
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |   .6677904   1.006464     0.66   0.508    -1.323821    2.659402
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |  -.3382834   1.857312    -0.18   0.856    -4.013569    3.337003
_Istcode19~6 |   .2455152    1.73075     0.14   0.887    -3.179327    3.670358
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |   5.009153   4.841046     1.03   0.303    -4.570403    14.58871
_Istcode1~11 |    1.76184   2.314575     0.76   0.448    -2.818287    6.341966
_Istcode1~12 |  -2.331785   1.362967    -1.71   0.090    -5.028851    .3652804
       trend |  -.5941966   .4524502    -1.31   0.191    -1.489514    .3011207
_IstcXtren_2 |  -.3607458   .4145475    -0.87   0.386     -1.18106    .4595688
_IstcXtren_3 |   .0093128   .1006562     0.09   0.926    -.1898676    .2084933
_IstcXtren_4 |   .2207792   .1271793     1.74   0.085    -.0308857    .4724441
_IstcXtren_5 |   .1621682   .2662703     0.61   0.544    -.3647327    .6890692
_IstcXtren_6 |   .1524797   .1606341     0.95   0.344    -.1653863    .4703456
_IstcXtren_7 |  -.0710099   .1312168    -0.54   0.589    -.3306644    .1886446
_IstcXtren_8 |   .0121304   .1075512     0.11   0.910     -.200694    .2249547
_IstcXtren_9 |   .1043353   .1073064     0.97   0.333    -.1080048    .3166753
_IstcXtre~10 |  -.7838361   .5241714    -1.50   0.137    -1.821077    .2534045
_IstcXtre~11 |  -.5908409   .4394245    -1.34   0.181    -1.460383    .2787009
_IstcXtre~12 |   .1363877   .2271736     0.60   0.549    -.3131479    .5859233
   reg_mexp0 |          0  (omitted)
   reg_mexp1 |          0  (omitted)
   reg_mexp2 |          0  (omitted)
   reg_mexp3 |   .1656412   .1179483     1.40   0.163    -.0677573    .3990397
   reg_mexp4 |   .0531198   .0510804     1.04   0.300    -.0479591    .1541986
       mexp0 |          0  (omitted)
       mexp1 |          0  (omitted)
       mexp2 |          0  (omitted)
       mexp3 |     .23945   .1200763     1.99   0.048     .0018406    .4770594
       mexp4 |   .0704879   .0853861     0.83   0.411    -.0984758    .2394516
       _cons |   2.644293   1.452898     1.82   0.071    -.2307311    5.519316
------------------------------------------------------------------------------

. outreg2 `placebo3' using "$OUT/tables/NigeriaPlacebo.xls", excel append
~/investigacion/Activa/MMR/Results/tables/NigeriaPlacebo.xls
dir : seeout

. xi: reg educ `placebo4' `Ncont' `Biafra2' `wt' if `sampP', robust `se'
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1949-1993(naturally coded; _Iyearbirth_1949 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   2.6458e+09)
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1960 omitted because of collinearity
note: _Iyearbirth_1961 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1965 omitted because of collinearity
note: _Iyearbirth_1966 omitted because of collinearity
note: _Iyearbirth_1967 omitted because of collinearity
note: _Iyearbirth_1968 omitted because of collinearity
note: _Iyearbirth_1969 omitted because of collinearity
note: _Iyearbirth_1970 omitted because of collinearity
note: _Iyearbirth_1971 omitted because of collinearity
note: _Iyearbirth_1972 omitted because of collinearity
note: _Iyearbirth_1973 omitted because of collinearity
note: _Iyearbirth_1974 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: reg_mexp0 omitted because of collinearity
note: reg_mexp1 omitted because of collinearity
note: reg_mexp2 omitted because of collinearity
note: mexp0 omitted because of collinearity
note: mexp1 omitted because of collinearity
note: mexp2 omitted because of collinearity

Linear regression                                      Number of obs =    2617
                                                       F( 45,   127) =   55.48
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3006
                                                       Root MSE      =  3.8976

                            (Std. Err. adjusted for 128 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
capexp53_~ke |   .2127637   .1676885     1.27   0.207    -.1190616    .5445889
_Ireligion_2 |   2.924639   .3451642     8.47   0.000     2.241621    3.607657
_Ireligion_3 |   3.144337   .3295188     9.54   0.000     2.492279    3.796396
_Ireligion_4 |  -.5520975   .3496578    -1.58   0.117    -1.244007    .1398121
_Ireligion_5 |   1.918011    .364839     5.26   0.000      1.19606    2.639961
_Iethnicit~2 |   .0186443   .7122938     0.03   0.979    -1.390857    1.428145
_Iethnicit~3 |  -1.573488   .6487568    -2.43   0.017    -2.857261   -.2897158
_Iethnicit~4 |   2.439087    .620702     3.93   0.000      1.21083    3.667345
_Iethnicit~5 |  -.8981313   .5919993    -1.52   0.132    -2.069591    .2733285
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -2.859082   1.311677    -2.18   0.031    -5.454654   -.2635109
_Istcode19~5 |   -1.97956   1.838265    -1.08   0.284    -5.617155    1.658035
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |  -.6846607   1.105361    -0.62   0.537     -2.87197    1.502648
_Istcode19~9 |  -.3787106   1.139173    -0.33   0.740    -2.632929    1.875508
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |  -.0961863   .6268879    -0.15   0.878    -1.336684    1.144312
_Iyearb~1952 |    .077114   .8890568     0.09   0.931    -1.682169    1.836397
_Iyearb~1953 |   .2682986   1.638439     0.16   0.870    -2.973876    3.510473
_Iyearb~1954 |   .4680677   1.906269     0.25   0.806    -3.304094     4.24023
_Iyearb~1955 |    1.83276   1.905615     0.96   0.338    -1.938108    5.603627
_Iyearb~1956 |  -.1283571   1.290619    -0.10   0.921    -2.682259    2.425545
_Iyearb~1957 |  -1.067368   .9200517    -1.16   0.248    -2.887984    .7532485
_Iyearb~1958 |  -2.284085   .8308226    -2.75   0.007    -3.928133   -.6400367
_Iyearb~1959 |  -1.173785   .3885031    -3.02   0.003    -1.942563   -.4050077
_Iyearb~1960 |          0  (omitted)
_Iyearb~1961 |          0  (omitted)
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |          0  (omitted)
_Iyearb~1966 |          0  (omitted)
_Iyearb~1967 |          0  (omitted)
_Iyearb~1968 |          0  (omitted)
_Iyearb~1969 |          0  (omitted)
_Iyearb~1970 |          0  (omitted)
_Iyearb~1971 |          0  (omitted)
_Iyearb~1972 |          0  (omitted)
_Iyearb~1973 |          0  (omitted)
_Iyearb~1974 |          0  (omitted)
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Istcode1~_2 |  -.0999717   1.748605    -0.06   0.954    -3.560146    3.360203
_Istcode19~3 |   .1181216   1.107226     0.11   0.915    -2.072879    2.309122
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |  -.0591885   1.730852    -0.03   0.973    -3.484233    3.365856
_Istcode19~7 |   .9386637    1.45502     0.65   0.520    -1.940558    3.817886
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |   4.439588   4.864319     0.91   0.363    -5.186021     14.0652
_Istcode1~11 |   1.969502    2.37248     0.83   0.408    -2.725208    6.664213
_Istcode1~12 |  -4.439016    1.29618    -3.42   0.001    -7.003923   -1.874109
       trend |  -1.014572   .4388978    -2.31   0.022    -1.883072   -.1460726
_IstcXtren_2 |  -.2546857   .4681985    -0.54   0.587    -1.181166    .6717946
_IstcXtren_3 |   .1166876    .132377     0.88   0.380    -.1452627    .3786379
_IstcXtren_4 |   .3313068   .1473688     2.25   0.026     .0396905     .622923
_IstcXtren_5 |    .534678   .2285806     2.34   0.021     .0823582    .9869978
_IstcXtren_6 |   .2153477   .1650264     1.30   0.194    -.1112097    .5419051
_IstcXtren_7 |   .0625841   .1681933     0.37   0.710    -.2702401    .3954083
_IstcXtren_8 |   .1391253   .1435173     0.97   0.334    -.1448695    .4231201
_IstcXtren_9 |   .1841103   .1295751     1.42   0.158    -.0722954    .4405159
_IstcXtre~10 |  -.7064108   .5540804    -1.27   0.205    -1.802836    .3900144
_IstcXtre~11 |  -.6969328   .4353354    -1.60   0.112    -1.558383    .1645173
_IstcXtre~12 |   .5902588   .2063263     2.86   0.005     .1819762    .9985413
   reg_mexp0 |          0  (omitted)
   reg_mexp1 |          0  (omitted)
   reg_mexp2 |          0  (omitted)
   reg_mexp3 |   .1838363   .1194958     1.54   0.126    -.0526243    .4202969
   reg_mexp4 |   .0672603    .051862     1.30   0.197    -.0353652    .1698857
       mexp0 |          0  (omitted)
       mexp1 |          0  (omitted)
       mexp2 |          0  (omitted)
       mexp3 |   .2442419   .1190315     2.05   0.042     .0086999    .4797838
       mexp4 |   .0640625   .0846023     0.76   0.450    -.1033502    .2314752
       _cons |   4.093412   1.486286     2.75   0.007     1.152321    7.034503
------------------------------------------------------------------------------

. outreg2 `placebo4' using "$OUT/tables/NigeriaPlacebo.xls", excel append
~/investigacion/Activa/MMR/Results/tables/NigeriaPlacebo.xls
dir : seeout

. 
. **GRAPHICAL
. collapse educ, by(yearbirth)

. egen educ=ma(education)
(2 missing values generated)

. graph twoway line educ yearbir if yearbirth>=1955, scheme(s1color) ///
> ytitle("Years of Education") xline(1965, lcolor(black) lpattern(dot)) ///
> xline(1975, lcolor(black) lpattern(dot)) legend(off) ///
> || lfit educ yearbirth if yearbirth<=1965&yearbirth>=1955, `linef' ///
> || lfit educ yearbirth if yearbirth>=1975, `linef' ///
> || lfit educ yearbirth if yearbirth<=1975&yearbirth>=1965, `linef'

. graph export "$OUT/graphs/Nigeria_educ.eps", as(eps) replace
(file ~/investigacion/Activa/MMR/Results/graphs/Nigeria_educ.eps written in EPS
>  format)

. 
. 
. *****************************************************************************
> ***
. *** (2b) Nigeria Estimates MMR
. *****************************************************************************
> ***
. use "$DAT/Nigeria/mmr", clear
(mmr data for Nigeria from DHS IR (Bhalotra and Clarke, 2015))

. gen yearstate=yearbirth*100*stcode1967
(3169 missing values generated)

. 
. estpost sum mmr mmr_25 yearbirth if (yr6575==1|yr5661==1)

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd) 
-------------+-------------------------------------------------------
         mmr |     29676      29676   .0162421   .0159788   .1264073 
      mmr_25 |     29676      29676     .00556   .0055293   .0743594 
   yearbirth |     29967      29967   1968.472   28.95056   5.380573 

             |    e(min)     e(max)     e(sum) 
-------------+---------------------------------
         mmr |         0          1        482 
      mmr_25 |         0          1        165 
   yearbirth |      1956       1975   5.90e+07 

. estout using "$OUT/tables/sumStatsCountry.xls", append `opts'
(output written to ~/investigacion/Activa/MMR/Results/tables/sumStatsCountry.xl
> s)

. 
. foreach m in mmr mmr_25 {
  2. 
.     ***TREATMENT
.     xi: reg `m' `treat2' `Ncont' `Biafra1' `wt' if `sampT', `se'
  3.     outreg2 `treat2' using "$OUT/tables/Nigeria.xls", excel appen
  4.     xi: reg `m' `treat1' `Ncont' `Biafra1' `wt' if `sampT', `se'
  5.     outreg2 `treat1' using "$OUT/tables/Nigeria.xls", excel append
  6.     xi: reg `m' `treat3' `Ncont' `Biafra2' `wt' if `sampT', `se'
  7.     outreg2 `treat3' using "$OUT/tables/Nigeria.xls", excel append
  8.     xi: reg `m' `treat4' `Ncont' `Biafra2' `wt' if `sampT', `se'
  9.     outreg2 `treat4' using "$OUT/tables/Nigeria.xls", excel append
 10. 
. 
.     **PLACEBO
.     xi: reg `m' `placebo2' `Ncont' `Biafra1' `wt' if `sampP', `se'
 11.     outreg2 `placebo2' using "$OUT/tables/NigeriaPlacebo.xls", excel 
 12.     xi: reg `m' `placebo1' `Ncont' `Biafra1' `wt' if `sampP', `se'
 13.     outreg2 `placebo1' using "$OUT/tables/NigeriaPlacebo.xls", excel 
 14.     xi: reg `m' `placebo3' `Ncont' `Biafra2' `wt' if `sampP', `se'
 15.     outreg2 `placebo3' using "$OUT/tables/NigeriaPlacebo.xls", excel 
 16.     xi: reg `m' `placebo4' `Ncont' `Biafra2' `wt' if `sampP', `se'
 17.     outreg2 `placebo4' using "$OUT/tables/NigeriaPlacebo.xls", excel 
 18. 
.     **NOTE: ALSO HAVE A ROBUSTNESS CHECK FOR NO LAGOS
. }
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   2.9203e+10)
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1951 omitted because of collinearity
note: _Iyearbirth_1952 omitted because of collinearity
note: _Iyearbirth_1953 omitted because of collinearity
note: _Iyearbirth_1954 omitted because of collinearity
note: _Iyearbirth_1955 omitted because of collinearity
note: _Iyearbirth_1956 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity

Linear regression                                      Number of obs =   28694
                                                       F( 51,   203) =    7.48
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0078
                                                       Root MSE      =  .12359

                            (Std. Err. adjusted for 204 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
yr7075cap~53 |  -.0002136   .0086738    -0.02   0.980    -.0173159    .0168886
yr6569cap~53 |  -.0001194   .0063662    -0.02   0.985    -.0126718    .0124329
    capexp53 |   .0001189   .0081213     0.01   0.988    -.0158941    .0161318
_Ireligion_2 |  -.0048683   .0032726    -1.49   0.138    -.0113209    .0015843
_Ireligion_3 |  -.0030778   .0017779    -1.73   0.085    -.0065833    .0004276
_Ireligion_4 |   -.000499   .0055314    -0.09   0.928    -.0114054    .0104074
_Ireligion_5 |  -.0078703   .0025954    -3.03   0.003    -.0129877    -.002753
_Iethnicit~2 |  -.0000694   .0044772    -0.02   0.988    -.0088972    .0087584
_Iethnicit~3 |   .0070429   .0047879     1.47   0.143    -.0023974    .0164833
_Iethnicit~4 |   .0015213   .0042745     0.36   0.722    -.0069067    .0099494
_Iethnicit~5 |   .0033033   .0040352     0.82   0.414    -.0046531    .0112596
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -.0357423   .0495531    -0.72   0.472    -.1334471    .0619626
_Istcode19~5 |  -.0206789   .0618325    -0.33   0.738    -.1425952    .1012375
_Istcode19~6 |   .0182647   .0438628     0.42   0.678    -.0682203    .1047498
_Istcode19~7 |   .0344969   .0636169     0.54   0.588    -.0909377    .1599314
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |  -.0246216   .0647436    -0.38   0.704    -.1522777    .1030345
_Istcode1~12 |   .0149961   .0769723     0.19   0.846    -.1367716    .1667638
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |          0  (omitted)
_Iyearb~1952 |          0  (omitted)
_Iyearb~1953 |          0  (omitted)
_Iyearb~1954 |          0  (omitted)
_Iyearb~1955 |          0  (omitted)
_Iyearb~1956 |          0  (omitted)
_Iyearb~1957 |   .0230833   .0077457     2.98   0.003      .007811    .0383556
_Iyearb~1958 |  -.0024196   .0035389    -0.68   0.495    -.0093974    .0045581
_Iyearb~1959 |   .0114233   .0042225     2.71   0.007     .0030978    .0197488
_Iyearb~1960 |   .0075471   .0047973     1.57   0.117    -.0019119    .0170061
_Iyearb~1961 |   .0031175   .0044572     0.70   0.485    -.0056708    .0119057
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |   .0061188   .0050999     1.20   0.232    -.0039368    .0161743
_Iyearb~1966 |  -.0035229   .0036346    -0.97   0.334    -.0106892    .0036435
_Iyearb~1967 |   .0112326    .005653     1.99   0.048     .0000866    .0223787
_Iyearb~1968 |  -.0063245   .0040522    -1.56   0.120    -.0143142    .0016653
_Iyearb~1969 |    .007127   .0056478     1.26   0.208    -.0040088    .0182629
_Iyearb~1970 |  -.0019719   .0029593    -0.67   0.506    -.0078069     .003863
_Iyearb~1971 |   -.000906   .0022094    -0.41   0.682    -.0052624    .0034504
_Iyearb~1972 |  -.0000683   .0029635    -0.02   0.982    -.0059116    .0057749
_Iyearb~1973 |  -.0054942   .0022475    -2.44   0.015    -.0099257   -.0010628
_Iyearb~1974 |  -.0047789   .0026793    -1.78   0.076    -.0100616    .0005039
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |   .0329424   .0587442     0.56   0.576    -.0828845    .1487694
_Istcode19~3 |  -.0321233   .0521453    -0.62   0.539    -.1349392    .0706925
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |   .0443729   .0550188     0.81   0.421    -.0641086    .1528544
_Istcode19~9 |   .0602718   .0473216     1.27   0.204    -.0330332    .1535767
_Istcode1~10 |   .1134602   .0973658     1.17   0.245    -.0785178    .3054383
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |          0  (omitted)
       trend |   .0006698    .001054     0.64   0.526    -.0014084    .0027481
_IstcXtren_2 |  -.0004988   .0008659    -0.58   0.565    -.0022061    .0012084
_IstcXtren_3 |   .0004353   .0007763     0.56   0.576    -.0010954    .0019659
_IstcXtren_4 |   .0003659   .0007377     0.50   0.620    -.0010886    .0018204
_IstcXtren_5 |   .0002361   .0009134     0.26   0.796    -.0015648    .0020371
_IstcXtren_6 |  -.0003643   .0006631    -0.55   0.583    -.0016718    .0009432
_IstcXtren_7 |  -.0005337   .0009401    -0.57   0.571    -.0023874      .00132
_IstcXtren_8 |  -.0005632   .0008193    -0.69   0.493    -.0021787    .0010523
_IstcXtren_9 |  -.0007775   .0007098    -1.10   0.275    -.0021771    .0006221
_IstcXtre~10 |  -.0015597   .0014167    -1.10   0.272     -.004353    .0012337
_IstcXtre~11 |   .0005404   .0009927     0.54   0.587    -.0014169    .0024978
_IstcXtre~12 |   -.000364   .0011358    -0.32   0.749    -.0026034    .0018755
yr6769sout~t |   .0089934   .0083725     1.07   0.284    -.0075148    .0255015
yr6769nonw~E |   .0067233   .0049387     1.36   0.175    -.0030144     .016461
       _cons |  -.0305445   .0713238    -0.43   0.669     -.171175     .110086
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/Nigeria.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   2.9203e+10)
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1951 omitted because of collinearity
note: _Iyearbirth_1952 omitted because of collinearity
note: _Iyearbirth_1953 omitted because of collinearity
note: _Iyearbirth_1954 omitted because of collinearity
note: _Iyearbirth_1955 omitted because of collinearity
note: _Iyearbirth_1956 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity

Linear regression                                      Number of obs =   28694
                                                       F( 50,   203) =    7.55
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0078
                                                       Root MSE      =  .12358

                            (Std. Err. adjusted for 204 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
yr7075nonw~t |  -.0135378   .0116442    -1.16   0.246     -.036497    .0094213
yr6569nonw~t |  -.0083933   .0075185    -1.12   0.266    -.0232176     .006431
_Ireligion_2 |  -.0048765    .003251    -1.50   0.135    -.0112866    .0015335
_Ireligion_3 |  -.0030805   .0017868    -1.72   0.086    -.0066036    .0004425
_Ireligion_4 |  -.0004963   .0055435    -0.09   0.929    -.0114266     .010434
_Ireligion_5 |   -.007863   .0025873    -3.04   0.003    -.0129644   -.0027616
_Iethnicit~2 |  -.0000614   .0044756    -0.01   0.989    -.0088861    .0087633
_Iethnicit~3 |   .0070758   .0047796     1.48   0.140    -.0023482    .0164998
_Iethnicit~4 |   .0015772   .0042602     0.37   0.712    -.0068227    .0099772
_Iethnicit~5 |   .0033396   .0040351     0.83   0.409    -.0046164    .0112956
_Istcode1~_2 |   .0319389   .0394984     0.81   0.420    -.0459408    .1098186
_Istcode19~3 |   -.033099   .0421269    -0.79   0.433    -.1161614    .0499634
_Istcode19~4 |  -.0366843    .040943    -0.90   0.371    -.1174124    .0440437
_Istcode19~5 |   .0270378   .0616847     0.44   0.662    -.0945871    .1486627
_Istcode19~6 |   .0179334   .0406141     0.44   0.659    -.0621462     .098013
_Istcode19~7 |   .0335626    .051314     0.65   0.514    -.0676141    .1347393
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |    .062506   .0609075     1.03   0.306    -.0575865    .1825986
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |          0  (omitted)
_Iyearb~1952 |          0  (omitted)
_Iyearb~1953 |          0  (omitted)
_Iyearb~1954 |          0  (omitted)
_Iyearb~1955 |          0  (omitted)
_Iyearb~1956 |          0  (omitted)
_Iyearb~1957 |   .0225469   .0077173     2.92   0.004     .0073305    .0377632
_Iyearb~1958 |  -.0035025   .0035641    -0.98   0.327    -.0105298    .0035248
_Iyearb~1959 |   .0097465   .0042461     2.30   0.023     .0013744    .0181186
_Iyearb~1960 |   .0054211   .0044523     1.22   0.225    -.0033575    .0141997
_Iyearb~1961 |   .0003774   .0044867     0.08   0.933    -.0084691    .0092239
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |   .0076347   .0046583     1.64   0.103    -.0015502    .0168197
_Iyearb~1966 |  -.0025364   .0035942    -0.71   0.481    -.0096232    .0045503
_Iyearb~1967 |   .0124342   .0052312     2.38   0.018     .0021198    .0227486
_Iyearb~1968 |  -.0056736   .0039229    -1.45   0.150    -.0134084    .0020612
_Iyearb~1969 |   .0072209   .0054822     1.32   0.189    -.0035884    .0180302
_Iyearb~1970 |   .0007955   .0030355     0.26   0.794    -.0051898    .0067807
_Iyearb~1971 |   .0012729   .0024578     0.52   0.605    -.0035731     .006119
_Iyearb~1972 |   .0015791   .0029208     0.54   0.589    -.0041799    .0073382
_Iyearb~1973 |  -.0043964   .0022916    -1.92   0.056    -.0089148     .000122
_Iyearb~1974 |  -.0042481   .0026895    -1.58   0.116     -.009551    .0010548
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |    .043474   .0461519     0.94   0.347    -.0475245    .1344724
_Istcode19~9 |   .0596191   .0393998     1.51   0.132    -.0180662    .1373044
_Istcode1~10 |   .1126823   .0906076     1.24   0.215    -.0659704     .291335
_Istcode1~11 |  -.0238484   .0617883    -0.39   0.700    -.1456775    .0979806
_Istcode1~12 |          0  (omitted)
       trend |   .0013983   .0009092     1.54   0.126    -.0003943     .003191
_IstcXtren_2 |  -.0004828   .0005917    -0.82   0.416    -.0016496    .0006839
_IstcXtren_3 |   .0004502   .0006319     0.71   0.477    -.0007958    .0016962
_IstcXtren_4 |     .00038   .0006147     0.62   0.537    -.0008321     .001592
_IstcXtren_5 |  -.0006281   .0010216    -0.61   0.539    -.0026425    .0013862
_IstcXtren_6 |  -.0003591   .0006184    -0.58   0.562    -.0015784    .0008602
_IstcXtren_7 |  -.0005192     .00076    -0.68   0.495    -.0020178    .0009794
_IstcXtren_8 |  -.0005496   .0006878    -0.80   0.425    -.0019056    .0008065
_IstcXtren_9 |  -.0007675   .0005931    -1.29   0.197     -.001937     .000402
_IstcXtre~10 |  -.0015472   .0013171    -1.17   0.241    -.0041441    .0010498
_IstcXtre~11 |    .000529   .0009475     0.56   0.577    -.0013393    .0023973
_IstcXtre~12 |  -.0012254   .0010077    -1.22   0.225    -.0032124    .0007616
yr6769sout~t |   .0080229   .0087766     0.91   0.362    -.0092822    .0253279
yr6769nonw~E |   .0057628   .0055157     1.04   0.297    -.0051127    .0166382
       _cons |  -.0699667   .0543852    -1.29   0.200    -.1771991    .0372657
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/Nigeria.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   2.9203e+10)
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1951 omitted because of collinearity
note: _Iyearbirth_1952 omitted because of collinearity
note: _Iyearbirth_1953 omitted because of collinearity
note: _Iyearbirth_1954 omitted because of collinearity
note: _Iyearbirth_1955 omitted because of collinearity
note: _Iyearbirth_1956 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity

Linear regression                                      Number of obs =   28694
                                                       F( 58,   203) =    7.82
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0130
                                                       Root MSE      =  .12328

                            (Std. Err. adjusted for 204 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
nonwest_m~re |  -.0000267   .0008768    -0.03   0.976    -.0017556    .0017022
nonwest_pr~e |   .0025672   .0015301     1.68   0.095    -.0004498    .0055842
_Ireligion_2 |  -.0053975   .0032523    -1.66   0.099      -.01181    .0010151
_Ireligion_3 |  -.0025885   .0018084    -1.43   0.154    -.0061542    .0009773
_Ireligion_4 |   .0004658   .0055476     0.08   0.933    -.0104726    .0114042
_Ireligion_5 |  -.0113093    .002838    -3.99   0.000     -.016905   -.0057136
_Iethnicit~2 |   .0000886   .0044765     0.02   0.984    -.0087377     .008915
_Iethnicit~3 |   .0081015   .0048499     1.67   0.096    -.0014611    .0176641
_Iethnicit~4 |   .0021064   .0042891     0.49   0.624    -.0063505    .0105633
_Iethnicit~5 |   .0042106   .0040934     1.03   0.305    -.0038603    .0122816
_Istcode1~_2 |   .1114722   .1285705     0.87   0.387    -.1420328    .3649772
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |   -.038149   .0415864    -0.92   0.360    -.1201457    .0438476
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |   .0212443   .0414524     0.51   0.609    -.0604882    .1029768
_Istcode19~7 |   .0359352   .0511632     0.70   0.483    -.0649443    .1368147
_Istcode19~8 |   .0458324   .0466966     0.98   0.328    -.0462401    .1379049
_Istcode19~9 |   .0595636   .0395489     1.51   0.134    -.0184158     .137543
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |   .0624107   .1379936     0.45   0.652    -.2096739    .3344954
_Istcode1~12 |   .0196259   .0413063     0.48   0.635    -.0618186    .1010704
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |          0  (omitted)
_Iyearb~1952 |          0  (omitted)
_Iyearb~1953 |          0  (omitted)
_Iyearb~1954 |          0  (omitted)
_Iyearb~1955 |          0  (omitted)
_Iyearb~1956 |          0  (omitted)
_Iyearb~1957 |   .0214689   .0105263     2.04   0.043      .000714    .0422238
_Iyearb~1958 |   .0042692   .0189227     0.23   0.822     -.033041    .0415794
_Iyearb~1959 |    .037529   .0211589     1.77   0.078    -.0041904    .0792484
_Iyearb~1960 |   .0532767   .0241866     2.20   0.029     .0055876    .1009658
_Iyearb~1961 |   .0609915   .0252862     2.41   0.017     .0111342    .1108488
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |  -.0365364   .0474527    -0.77   0.442    -.1300999     .057027
_Iyearb~1966 |  -.0538196   .0434163    -1.24   0.217    -.1394243    .0317851
_Iyearb~1967 |  -.0469345    .040437    -1.16   0.247    -.1266649    .0327958
_Iyearb~1968 |  -.0654096   .0354631    -1.84   0.067    -.1353329    .0045137
_Iyearb~1969 |  -.0825295    .029923    -2.76   0.006    -.1415292   -.0235299
_Iyearb~1970 |  -.1000739   .0246403    -4.06   0.000    -.1486577   -.0514902
_Iyearb~1971 |  -.0799044    .019759    -4.04   0.000    -.1188636   -.0409452
_Iyearb~1972 |  -.0593723   .0150071    -3.96   0.000    -.0889621   -.0297824
_Iyearb~1973 |  -.0450337   .0100822    -4.47   0.000     -.064913   -.0251544
_Iyearb~1974 |  -.0244751   .0055878    -4.38   0.000    -.0354926   -.0134576
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |  -.0310397   .0432115    -0.72   0.473    -.1162407    .0541612
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |  -.0186345   .0431262    -0.43   0.666    -.1036673    .0663983
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |   .2031439   .1450609     1.40   0.163    -.0828753    .4891632
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |          0  (omitted)
       trend |  -.0188091    .004964    -3.79   0.000    -.0285966   -.0090215
_IstcXtren_2 |  -.0015986   .0018114    -0.88   0.379    -.0051702    .0019729
_IstcXtren_3 |   .0004207   .0006478     0.65   0.517    -.0008565    .0016979
_IstcXtren_4 |    .000394   .0006254     0.63   0.529    -.0008391    .0016271
_IstcXtren_5 |   .0002205   .0006507     0.34   0.735    -.0010625    .0015034
_IstcXtren_6 |  -.0004076     .00063    -0.65   0.518    -.0016499    .0008346
_IstcXtren_7 |  -.0005554   .0007586    -0.73   0.465    -.0020512    .0009403
_IstcXtren_8 |  -.0005904   .0006959    -0.85   0.397    -.0019624    .0007817
_IstcXtren_9 |   -.000771   .0005949    -1.30   0.196    -.0019439     .000402
_IstcXtre~10 |  -.0028199   .0020517    -1.37   0.171    -.0068653    .0012255
_IstcXtre~11 |  -.0006807   .0019865    -0.34   0.732    -.0045976    .0032362
_IstcXtre~12 |   -.000418   .0006247    -0.67   0.504    -.0016498    .0008137
   reg_mexp0 |  -.0005131   .0008265    -0.62   0.535    -.0021427    .0011166
   reg_mexp1 |  -.0000864   .0004373    -0.20   0.844    -.0009486    .0007758
   reg_mexp2 |  -.0001268   .0006426    -0.20   0.844    -.0013938    .0011402
   reg_mexp3 |  -.0004674   .0007785    -0.60   0.549    -.0020025    .0010676
   reg_mexp4 |  -.0011893   .0011352    -1.05   0.296    -.0034275     .001049
       mexp0 |  -.0006596   .0012072    -0.55   0.585    -.0030398    .0017207
       mexp1 |  -.0035017   .0007728    -4.53   0.000    -.0050255   -.0019779
       mexp2 |  -.0057368   .0010069    -5.70   0.000    -.0077221   -.0037514
       mexp3 |  -.0109241   .0029508    -3.70   0.000    -.0167423   -.0051058
       mexp4 |  -.0124163   .0031048    -4.00   0.000    -.0185381   -.0062944
       _cons |   1.391218   .3617347     3.85   0.000     .6779785    2.104457
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/Nigeria.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   2.9203e+10)
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1951 omitted because of collinearity
note: _Iyearbirth_1952 omitted because of collinearity
note: _Iyearbirth_1953 omitted because of collinearity
note: _Iyearbirth_1954 omitted because of collinearity
note: _Iyearbirth_1955 omitted because of collinearity
note: _Iyearbirth_1956 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity

Linear regression                                      Number of obs =   28694
                                                       F( 58,   203) =    7.79
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0130
                                                       Root MSE      =  .12328

                            (Std. Err. adjusted for 204 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
capexp53_m.. |   .0000295   .0007529     0.04   0.969     -.001455    .0015141
capexp53_p~e |    .001612   .0012132     1.33   0.185      -.00078     .004004
_Ireligion_2 |  -.0054365   .0032665    -1.66   0.098    -.0118772    .0010042
_Ireligion_3 |  -.0026611   .0018146    -1.47   0.144     -.006239    .0009169
_Ireligion_4 |   .0004956   .0055564     0.09   0.929    -.0104601    .0114513
_Ireligion_5 |  -.0113815   .0028388    -4.01   0.000    -.0169788   -.0057843
_Iethnicit~2 |    .000169    .004479     0.04   0.970    -.0086623    .0090004
_Iethnicit~3 |    .008123   .0048548     1.67   0.096    -.0014494    .0176954
_Iethnicit~4 |   .0020495   .0042972     0.48   0.634    -.0064235    .0105224
_Iethnicit~5 |   .0041954   .0040932     1.02   0.307    -.0038753    .0122662
_Istcode1~_2 |   .1184331   .1229872     0.96   0.337     -.124063    .3609293
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -.0365624   .0433859    -0.84   0.400    -.1221072    .0489824
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |    .022068   .0426562     0.52   0.605    -.0620379     .106174
_Istcode19~7 |   .0375018   .0532132     0.70   0.482    -.0674197    .1424232
_Istcode19~8 |   .0475364   .0486718     0.98   0.330    -.0484307    .1435035
_Istcode19~9 |   .0607533   .0415392     1.46   0.145    -.0211502    .1426569
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |   .0642132   .1318984     0.49   0.627    -.1958534    .3242798
_Istcode1~12 |   .0192285   .0441917     0.44   0.664    -.0679051     .106362
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |          0  (omitted)
_Iyearb~1952 |          0  (omitted)
_Iyearb~1953 |          0  (omitted)
_Iyearb~1954 |          0  (omitted)
_Iyearb~1955 |          0  (omitted)
_Iyearb~1956 |          0  (omitted)
_Iyearb~1957 |    .021622   .0105553     2.05   0.042     .0008099    .0424341
_Iyearb~1958 |   .0044918   .0189282     0.24   0.813    -.0328293    .0418129
_Iyearb~1959 |   .0377734   .0211684     1.78   0.076    -.0039647    .0795115
_Iyearb~1960 |   .0536234   .0241906     2.22   0.028     .0059263    .1013205
_Iyearb~1961 |   .0612991   .0252677     2.43   0.016     .0114783      .11112
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |  -.0363453   .0474949    -0.77   0.445    -.1299918    .0573012
_Iyearb~1966 |  -.0530212   .0435328    -1.22   0.225    -.1388557    .0328133
_Iyearb~1967 |  -.0454771   .0406295    -1.12   0.264    -.1255871    .0346329
_Iyearb~1968 |  -.0632601    .035728    -1.77   0.078    -.1337056    .0071854
_Iyearb~1969 |  -.0800569   .0301685    -2.65   0.009    -.1395407   -.0205731
_Iyearb~1970 |  -.1004057   .0247699    -4.05   0.000     -.149245   -.0515664
_Iyearb~1971 |  -.0802001   .0198144    -4.05   0.000    -.1192684   -.0411317
_Iyearb~1972 |  -.0595864   .0150704    -3.95   0.000     -.089301   -.0298717
_Iyearb~1973 |  -.0451904   .0100851    -4.48   0.000    -.0650754   -.0253055
_Iyearb~1974 |  -.0245448   .0055164    -4.45   0.000    -.0354215   -.0136681
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |  -.0296646   .0454149    -0.65   0.514    -.1192101    .0598809
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |  -.0202202   .0441701    -0.46   0.648    -.1073111    .0668708
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |   .2099934   .1402355     1.50   0.136    -.0665116    .4864985
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |          0  (omitted)
       trend |  -.0188171   .0049717    -3.78   0.000    -.0286198   -.0090143
_IstcXtren_2 |  -.0016842   .0017382    -0.97   0.334    -.0051114     .001743
_IstcXtren_3 |   .0004124   .0006871     0.60   0.549    -.0009425    .0017672
_IstcXtren_4 |   .0003822   .0006584     0.58   0.562     -.000916    .0016805
_IstcXtren_5 |   .0002407   .0006718     0.36   0.720    -.0010839    .0015654
_IstcXtren_6 |  -.0004132   .0006511    -0.63   0.526     -.001697    .0008706
_IstcXtren_7 |  -.0005635   .0007967    -0.71   0.480    -.0021343    .0010073
_IstcXtren_8 |  -.0006018    .000733    -0.82   0.413     -.002047    .0008434
_IstcXtren_9 |  -.0007787   .0006307    -1.23   0.218    -.0020223     .000465
_IstcXtre~10 |   -.002907    .001987    -1.46   0.145    -.0068249    .0010108
_IstcXtre~11 |  -.0007158   .0019039    -0.38   0.707    -.0044697    .0030381
_IstcXtre~12 |  -.0004074   .0006816    -0.60   0.551    -.0017514    .0009365
   reg_mexp0 |  -.0003733   .0007913    -0.47   0.638    -.0019335     .001187
   reg_mexp1 |  -.0000762   .0004183    -0.18   0.856    -.0009009    .0007485
   reg_mexp2 |  -.0001612   .0006073    -0.27   0.791    -.0013586    .0010363
   reg_mexp3 |  -.0005039   .0007389    -0.68   0.496    -.0019608    .0009529
   reg_mexp4 |  -.0012375   .0010862    -1.14   0.256    -.0033791    .0009042
       mexp0 |  -.0007021   .0012113    -0.58   0.563    -.0030905    .0016862
       mexp1 |  -.0035162    .000772    -4.55   0.000    -.0050384    -.001994
       mexp2 |  -.0057428   .0010062    -5.71   0.000    -.0077268   -.0037589
       mexp3 |  -.0109384   .0029538    -3.70   0.000    -.0167626   -.0051143
       mexp4 |  -.0124162   .0031072    -4.00   0.000    -.0185427   -.0062896
       _cons |   1.391313   .3622036     3.84   0.000     .6771491    2.105476
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/Nigeria.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   6.5778e+09)
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1960 omitted because of collinearity
note: _Iyearbirth_1961 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1965 omitted because of collinearity
note: _Iyearbirth_1966 omitted because of collinearity
note: _Iyearbirth_1967 omitted because of collinearity
note: _Iyearbirth_1968 omitted because of collinearity
note: _Iyearbirth_1969 omitted because of collinearity
note: _Iyearbirth_1970 omitted because of collinearity
note: _Iyearbirth_1971 omitted because of collinearity
note: _Iyearbirth_1972 omitted because of collinearity
note: _Iyearbirth_1973 omitted because of collinearity
note: _Iyearbirth_1974 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: yr6769southeast omitted because of collinearity
note: yr6769nonwest_noSE omitted because of collinearity

Linear regression                                      Number of obs =    6508
                                                       F( 42,   131) =    5.39
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0142
                                                       Root MSE      =  .12981

                            (Std. Err. adjusted for 132 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
yr5660cap~53 |  -.0118187   .0107439    -1.10   0.273    -.0330727    .0094354
    capexp53 |   .0013493   .0118845     0.11   0.910    -.0221611    .0248597
_Ireligion_2 |   .0029587   .0077079     0.38   0.702    -.0122894    .0182069
_Ireligion_3 |    .003114   .0040595     0.77   0.444    -.0049167    .0111448
_Ireligion_4 |   .0054188   .0132636     0.41   0.684    -.0208197    .0316573
_Ireligion_5 |  -.0022784   .0056018    -0.41   0.685    -.0133601    .0088033
_Iethnicit~2 |   .0115979   .0137841     0.84   0.402    -.0156703    .0388662
_Iethnicit~3 |    .008028   .0120694     0.67   0.507    -.0158482    .0319042
_Iethnicit~4 |   .0070121   .0101067     0.69   0.489    -.0129814    .0270057
_Iethnicit~5 |   .0071005   .0107183     0.66   0.509    -.0141028    .0283038
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -.0148375   .1348038    -0.11   0.913    -.2815115    .2518365
_Istcode19~5 |   .1099869   .1684729     0.65   0.515    -.2232927    .4432665
_Istcode19~6 |  -.1615347   .1392344    -1.16   0.248    -.4369735     .113904
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |   .1593211   .1873049     0.85   0.397    -.2112126    .5298548
_Istcode1~10 |  -.3912598   .2996205    -1.31   0.194    -.9839806     .201461
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |   .1105088   .1718465     0.64   0.521    -.2294446    .4504622
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |  -.0017809   .0077899    -0.23   0.820    -.0171911    .0136293
_Iyearb~1952 |   .0030951   .0084758     0.37   0.716     -.013672    .0198622
_Iyearb~1953 |   -.003998   .0047952    -0.83   0.406     -.013484     .005488
_Iyearb~1954 |  -.0095658   .0071892    -1.33   0.186    -.0237878    .0046561
_Iyearb~1955 |   .0007921   .0079305     0.10   0.921    -.0148963    .0164804
_Iyearb~1956 |  -.0044204   .0047946    -0.92   0.358    -.0139053    .0050644
_Iyearb~1957 |   .0184332   .0084105     2.19   0.030     .0017951    .0350712
_Iyearb~1958 |  -.0080036   .0041538    -1.93   0.056    -.0162209    .0002137
_Iyearb~1959 |   .0045273   .0044874     1.01   0.315    -.0043499    .0134045
_Iyearb~1960 |          0  (omitted)
_Iyearb~1961 |          0  (omitted)
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |          0  (omitted)
_Iyearb~1966 |          0  (omitted)
_Iyearb~1967 |          0  (omitted)
_Iyearb~1968 |          0  (omitted)
_Iyearb~1969 |          0  (omitted)
_Iyearb~1970 |          0  (omitted)
_Iyearb~1971 |          0  (omitted)
_Iyearb~1972 |          0  (omitted)
_Iyearb~1973 |          0  (omitted)
_Iyearb~1974 |          0  (omitted)
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |  -.0362999    .156307    -0.23   0.817    -.3455125    .2729127
_Istcode19~3 |  -.0444923   .1489212    -0.30   0.766    -.3390939    .2501093
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |  -.2038859   .1442869    -1.41   0.160    -.4893198     .081548
_Istcode19~8 |   .1493932   .1488937     1.00   0.318     -.145154    .4439404
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |   .0326421   .2022617     0.16   0.872    -.3674798    .4327639
_Istcode1~12 |          0  (omitted)
       trend |   .0017108   .0030228     0.57   0.572     -.004269    .0076906
_IstcXtren_2 |   .0003951   .0028578     0.14   0.890    -.0052584    .0060485
_IstcXtren_3 |      .0004   .0027349     0.15   0.884    -.0050102    .0058103
_IstcXtren_4 |  -.0002948   .0024672    -0.12   0.905    -.0051756     .004586
_IstcXtren_5 |  -.0026436   .0030637    -0.86   0.390    -.0087044    .0034171
_IstcXtren_6 |   .0025614   .0025406     1.01   0.315    -.0024645    .0075873
_IstcXtren_7 |   .0034737   .0026496     1.31   0.192    -.0017678    .0087153
_IstcXtren_8 |   -.002693   .0027187    -0.99   0.324    -.0080713    .0026852
_IstcXtren_9 |  -.0028696   .0033502    -0.86   0.393    -.0094972     .003758
_IstcXtre~10 |   .0068217    .005661     1.21   0.230    -.0043771    .0180204
_IstcXtre~11 |  -.0007643   .0036379    -0.21   0.834    -.0079609    .0064322
_IstcXtre~12 |  -.0025831   .0031302    -0.83   0.411    -.0087755    .0036093
yr6769sout~t |          0  (omitted)
yr6769nonw~E |          0  (omitted)
       _cons |  -.0627914   .1661117    -0.38   0.706    -.3913999    .2658172
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/NigeriaPlacebo.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   6.5778e+09)
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1960 omitted because of collinearity
note: _Iyearbirth_1961 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1965 omitted because of collinearity
note: _Iyearbirth_1966 omitted because of collinearity
note: _Iyearbirth_1967 omitted because of collinearity
note: _Iyearbirth_1968 omitted because of collinearity
note: _Iyearbirth_1969 omitted because of collinearity
note: _Iyearbirth_1970 omitted because of collinearity
note: _Iyearbirth_1971 omitted because of collinearity
note: _Iyearbirth_1972 omitted because of collinearity
note: _Iyearbirth_1973 omitted because of collinearity
note: _Iyearbirth_1974 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: yr6769southeast omitted because of collinearity
note: yr6769nonwest_noSE omitted because of collinearity

Linear regression                                      Number of obs =    6508
                                                       F( 41,   131) =    5.48
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0140
                                                       Root MSE      =  .12981

                            (Std. Err. adjusted for 132 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
yr5660nonw~t |  -.0063064   .0117413    -0.54   0.592    -.0295336    .0169207
_Ireligion_2 |   .0025181   .0076886     0.33   0.744    -.0126918     .017728
_Ireligion_3 |   .0026963   .0041087     0.66   0.513    -.0054316    .0108243
_Ireligion_4 |   .0055912   .0132209     0.42   0.673    -.0205628    .0317453
_Ireligion_5 |  -.0027309   .0056054    -0.49   0.627    -.0138197    .0083579
_Iethnicit~2 |   .0115048   .0137912     0.83   0.406    -.0157774     .038787
_Iethnicit~3 |   .0080275   .0120739     0.66   0.507    -.0158576    .0319125
_Iethnicit~4 |    .006768   .0102114     0.66   0.509    -.0134326    .0269687
_Iethnicit~5 |   .0068536   .0108141     0.63   0.527    -.0145392    .0282464
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -.0768342   .1325471    -0.58   0.563    -.3390441    .1853757
_Istcode19~5 |   .0512697   .1735028     0.30   0.768    -.2919602    .3944996
_Istcode19~6 |  -.1967948   .1413551    -1.39   0.166    -.4764289    .0828393
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |   .1043314   .1816522     0.57   0.567    -.2550199    .4636828
_Istcode1~10 |  -.4706899   .2961577    -1.59   0.114    -1.056561    .1151806
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |   .0102717   .1496681     0.07   0.945    -.2858076     .306351
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |  -.0014384   .0078602    -0.18   0.855    -.0169878     .014111
_Iyearb~1952 |   .0039569    .008618     0.46   0.647    -.0130916    .0210054
_Iyearb~1953 |  -.0026754   .0049157    -0.54   0.587    -.0123998     .007049
_Iyearb~1954 |  -.0075698   .0076911    -0.98   0.327    -.0227846    .0076449
_Iyearb~1955 |   .0031514   .0072512     0.43   0.665    -.0111932    .0174961
_Iyearb~1956 |  -.0064953   .0049194    -1.32   0.189     -.016227    .0032364
_Iyearb~1957 |   .0169498   .0077211     2.20   0.030     .0016755     .032224
_Iyearb~1958 |  -.0090261   .0039748    -2.27   0.025    -.0168893    -.001163
_Iyearb~1959 |   .0039307   .0043702     0.90   0.370    -.0047146     .012576
_Iyearb~1960 |          0  (omitted)
_Iyearb~1961 |          0  (omitted)
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |          0  (omitted)
_Iyearb~1966 |          0  (omitted)
_Iyearb~1967 |          0  (omitted)
_Iyearb~1968 |          0  (omitted)
_Iyearb~1969 |          0  (omitted)
_Iyearb~1970 |          0  (omitted)
_Iyearb~1971 |          0  (omitted)
_Iyearb~1972 |          0  (omitted)
_Iyearb~1973 |          0  (omitted)
_Iyearb~1974 |          0  (omitted)
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |    -.13129   .1438338    -0.91   0.363    -.4158276    .1532475
_Istcode19~3 |   -.113421   .1464287    -0.77   0.440    -.4030918    .1762499
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |  -.2878119   .1373447    -2.10   0.038    -.5595125   -.0161113
_Istcode19~8 |   .0750982   .1434943     0.52   0.602    -.2087678    .3589642
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |   .0695536   .1992705     0.35   0.728    -.3246509    .4637581
_Istcode1~12 |          0  (omitted)
       trend |  -.0001158   .0026921    -0.04   0.966    -.0054414    .0052098
_IstcXtren_2 |    .002272   .0025902     0.88   0.382    -.0028519     .007396
_IstcXtren_3 |   .0017546   .0026651     0.66   0.511    -.0035176    .0070268
_IstcXtren_4 |   .0009298    .002397     0.39   0.699     -.003812    .0056716
_IstcXtren_5 |  -.0014957   .0032017    -0.47   0.641    -.0078293    .0048379
_IstcXtren_6 |   .0032601   .0025553     1.28   0.204    -.0017948     .008315
_IstcXtren_7 |   .0051262   .0024933     2.06   0.042     .0001938    .0100586
_IstcXtren_8 |  -.0012261   .0025911    -0.47   0.637    -.0063519    .0038997
_IstcXtren_9 |  -.0017883   .0032474    -0.55   0.583    -.0082124    .0046358
_IstcXtre~10 |   .0083915   .0055848     1.50   0.135    -.0026565    .0194394
_IstcXtre~11 |   -.001498   .0035661    -0.42   0.675    -.0085526    .0055566
_IstcXtre~12 |  -.0006136   .0027687    -0.22   0.825    -.0060907    .0048636
yr6769sout~t |          0  (omitted)
yr6769nonw~E |          0  (omitted)
       _cons |   .0301838   .1459476     0.21   0.836    -.2585353    .3189029
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/NigeriaPlacebo.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   6.5778e+09)
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1960 omitted because of collinearity
note: _Iyearbirth_1961 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1965 omitted because of collinearity
note: _Iyearbirth_1966 omitted because of collinearity
note: _Iyearbirth_1967 omitted because of collinearity
note: _Iyearbirth_1968 omitted because of collinearity
note: _Iyearbirth_1969 omitted because of collinearity
note: _Iyearbirth_1970 omitted because of collinearity
note: _Iyearbirth_1971 omitted because of collinearity
note: _Iyearbirth_1972 omitted because of collinearity
note: _Iyearbirth_1973 omitted because of collinearity
note: _Iyearbirth_1974 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: reg_mexp0 omitted because of collinearity
note: reg_mexp1 omitted because of collinearity
note: reg_mexp2 omitted because of collinearity
note: mexp0 omitted because of collinearity
note: mexp1 omitted because of collinearity
note: mexp2 omitted because of collinearity

Linear regression                                      Number of obs =    6508
                                                       F( 45,   131) =    5.33
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0149
                                                       Root MSE      =  .12979

                            (Std. Err. adjusted for 132 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
nonwest_m~ke |  -.0031452   .0038922    -0.81   0.421    -.0108449    .0045545
_Ireligion_2 |    .001969    .007754     0.25   0.800    -.0133703    .0173084
_Ireligion_3 |   .0024591   .0041553     0.59   0.555     -.005761    .0106792
_Ireligion_4 |   .0045918   .0133787     0.34   0.732    -.0218746    .0310582
_Ireligion_5 |  -.0040467   .0058942    -0.69   0.494    -.0157068    .0076135
_Iethnicit~2 |   .0109051   .0138661     0.79   0.433    -.0165254    .0383356
_Iethnicit~3 |   .0078377   .0120068     0.65   0.515    -.0159146      .03159
_Iethnicit~4 |   .0065412   .0101894     0.64   0.522    -.0136158    .0266983
_Iethnicit~5 |   .0067832   .0107891     0.63   0.531    -.0145601    .0281266
_Istcode1~_2 |  -.5614492    .251394    -2.23   0.027    -1.058766    -.064132
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |   .1072093   .2022438     0.53   0.597    -.2928771    .5072958
_Istcode19~6 |  -.1960061   .1343669    -1.46   0.147    -.4618159    .0698038
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |   .0791483   .1361047     0.58   0.562    -.1900993    .3483958
_Istcode19~9 |   .1081603   .1801657     0.60   0.549    -.2482505    .4645711
_Istcode1~10 |  -.9063133   .4098852    -2.21   0.029    -1.717164   -.0954625
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |   .0599912   .1695066     0.35   0.724    -.2753333    .3953157
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |   .0020428   .0080225     0.25   0.799    -.0138276    .0179133
_Iyearb~1952 |   .0101797   .0106056     0.96   0.339    -.0108007      .03116
_Iyearb~1953 |   .0055083   .0142212     0.39   0.699    -.0226245    .0336412
_Iyearb~1954 |   .0039539   .0184707     0.21   0.831    -.0325856    .0404933
_Iyearb~1955 |   .0159635   .0173915     0.92   0.360    -.0184411    .0503681
_Iyearb~1956 |  -.0045117    .013166    -0.34   0.732    -.0305571    .0215337
_Iyearb~1957 |   .0075578   .0095235     0.79   0.429    -.0112819    .0263975
_Iyearb~1958 |  -.0218699   .0083148    -2.63   0.010    -.0383185   -.0054213
_Iyearb~1959 |  -.0025882   .0055126    -0.47   0.639    -.0134935    .0083171
_Iyearb~1960 |          0  (omitted)
_Iyearb~1961 |          0  (omitted)
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |          0  (omitted)
_Iyearb~1966 |          0  (omitted)
_Iyearb~1967 |          0  (omitted)
_Iyearb~1968 |          0  (omitted)
_Iyearb~1969 |          0  (omitted)
_Iyearb~1970 |          0  (omitted)
_Iyearb~1971 |          0  (omitted)
_Iyearb~1972 |          0  (omitted)
_Iyearb~1973 |          0  (omitted)
_Iyearb~1974 |          0  (omitted)
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |  -.1137296   .1360484    -0.84   0.405    -.3828659    .1554066
_Istcode19~4 |  -.0749454   .1258988    -0.60   0.553    -.3240033    .1741125
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |  -.2843062   .1301058    -2.19   0.031    -.5416864    -.026926
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |  -.3558014    .298098    -1.19   0.235    -.9455104    .2339076
_Istcode1~12 |          0  (omitted)
       trend |  -.0057322   .0047983    -1.19   0.234    -.0152243    .0037599
_IstcXtren_2 |   .0113624   .0050396     2.25   0.026     .0013929    .0213319
_IstcXtren_3 |   .0017467   .0024608     0.71   0.479    -.0031214    .0066147
_IstcXtren_4 |   .0008891   .0022641     0.39   0.695    -.0035898     .005368
_IstcXtren_5 |  -.0025689   .0037743    -0.68   0.497    -.0100354    .0048976
_IstcXtren_6 |   .0032499   .0024173     1.34   0.181    -.0015321    .0080319
_IstcXtren_7 |   .0050523   .0023497     2.15   0.033      .000404    .0097006
_IstcXtren_8 |  -.0013026   .0024437    -0.53   0.595    -.0061368    .0035317
_IstcXtren_9 |  -.0018696   .0032171    -0.58   0.562    -.0082337    .0044945
_IstcXtre~10 |   .0175931   .0080928     2.17   0.032     .0015837    .0336025
_IstcXtre~11 |   .0075158   .0057976     1.30   0.197    -.0039533    .0189848
_IstcXtre~12 |  -.0015701   .0031861    -0.49   0.623     -.007873    .0047328
   reg_mexp0 |          0  (omitted)
   reg_mexp1 |          0  (omitted)
   reg_mexp2 |          0  (omitted)
   reg_mexp3 |  -.0028023   .0013136    -2.13   0.035    -.0054009   -.0002036
   reg_mexp4 |   -.001568    .000712    -2.20   0.029    -.0029766   -.0001595
       mexp0 |          0  (omitted)
       mexp1 |          0  (omitted)
       mexp2 |          0  (omitted)
       mexp3 |   .0021087   .0012097     1.74   0.084    -.0002844    .0045019
       mexp4 |   .0004816   .0006982     0.69   0.492    -.0008997    .0018629
       _cons |   .2978479   .2411905     1.23   0.219    -.1792844    .7749803
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/NigeriaPlacebo.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   6.5778e+09)
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1960 omitted because of collinearity
note: _Iyearbirth_1961 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1965 omitted because of collinearity
note: _Iyearbirth_1966 omitted because of collinearity
note: _Iyearbirth_1967 omitted because of collinearity
note: _Iyearbirth_1968 omitted because of collinearity
note: _Iyearbirth_1969 omitted because of collinearity
note: _Iyearbirth_1970 omitted because of collinearity
note: _Iyearbirth_1971 omitted because of collinearity
note: _Iyearbirth_1972 omitted because of collinearity
note: _Iyearbirth_1973 omitted because of collinearity
note: _Iyearbirth_1974 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: reg_mexp0 omitted because of collinearity
note: reg_mexp1 omitted because of collinearity
note: reg_mexp2 omitted because of collinearity
note: mexp0 omitted because of collinearity
note: mexp1 omitted because of collinearity
note: mexp2 omitted because of collinearity

Linear regression                                      Number of obs =    6508
                                                       F( 45,   131) =    5.37
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0150
                                                       Root MSE      =  .12978

                            (Std. Err. adjusted for 132 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
capexp53_~ke |  -.0025715   .0020351    -1.26   0.209    -.0065975    .0014545
_Ireligion_2 |   .0022537   .0078319     0.29   0.774    -.0132397    .0177471
_Ireligion_3 |   .0027994   .0041554     0.67   0.502     -.005421    .0110198
_Ireligion_4 |   .0044155   .0134197     0.33   0.743    -.0221319    .0309629
_Ireligion_5 |  -.0037617   .0058404    -0.64   0.521    -.0153155     .007792
_Iethnicit~2 |   .0108942   .0138654     0.79   0.433    -.0165348    .0383232
_Iethnicit~3 |    .007721   .0119749     0.64   0.520    -.0159682    .0314102
_Iethnicit~4 |   .0066272   .0101735     0.65   0.516    -.0134983    .0267527
_Iethnicit~5 |   .0068878   .0107729     0.64   0.524    -.0144235    .0281992
_Istcode1~_2 |   -.458173   .2617485    -1.75   0.082     -.975974     .059628
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -.0145672   .1287459    -0.11   0.910    -.2692573     .240123
_Istcode19~5 |   .1088192   .1635189     0.67   0.507    -.2146602    .4322986
_Istcode19~6 |  -.1600159   .1319795    -1.21   0.228    -.4211028     .101071
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |   .1513447   .1419358     1.07   0.288    -.1294383    .4321276
_Istcode19~9 |   .1617026   .1759659     0.92   0.360       -.1864    .5098051
_Istcode1~10 |  -.8167274   .4143779    -1.97   0.051    -1.636466    .0030109
_Istcode1~11 |  -.3788379   .2851083    -1.33   0.186    -.9428501    .1851742
_Istcode1~12 |          0  (omitted)
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |   .0022425   .0079062     0.28   0.777    -.0133979    .0178828
_Iyearb~1952 |    .010472   .0102527     1.02   0.309    -.0098103    .0307542
_Iyearb~1953 |   .0060502   .0138012     0.44   0.662    -.0212519    .0333523
_Iyearb~1954 |   .0045797   .0180961     0.25   0.801    -.0312186    .0403781
_Iyearb~1955 |   .0168128    .017846     0.94   0.348    -.0184908    .0521164
_Iyearb~1956 |  -.0039513   .0123452    -0.32   0.749     -.028373    .0204704
_Iyearb~1957 |   .0079748   .0089441     0.89   0.374    -.0097188    .0256685
_Iyearb~1958 |  -.0216619    .007988    -2.71   0.008    -.0374641   -.0058597
_Iyearb~1959 |   -.002473   .0054447    -0.45   0.650    -.0132438    .0082978
_Iyearb~1960 |          0  (omitted)
_Iyearb~1961 |          0  (omitted)
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |          0  (omitted)
_Iyearb~1966 |          0  (omitted)
_Iyearb~1967 |          0  (omitted)
_Iyearb~1968 |          0  (omitted)
_Iyearb~1969 |          0  (omitted)
_Iyearb~1970 |          0  (omitted)
_Iyearb~1971 |          0  (omitted)
_Iyearb~1972 |          0  (omitted)
_Iyearb~1973 |          0  (omitted)
_Iyearb~1974 |          0  (omitted)
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |  -.0455315   .1401068    -0.32   0.746    -.3226961    .2316332
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |  -.2030591   .1365046    -1.49   0.139    -.4730978    .0669796
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |   .1029073   .1589108     0.65   0.518    -.2114561    .4172708
       trend |  -.0047803   .0048266    -0.99   0.324    -.0143285    .0047678
_IstcXtren_2 |   .0092954   .0052521     1.77   0.079    -.0010944    .0196852
_IstcXtren_3 |   .0004162   .0025649     0.16   0.871    -.0046578    .0054903
_IstcXtren_4 |  -.0002955   .0023426    -0.13   0.900    -.0049296    .0043386
_IstcXtren_5 |  -.0026032   .0029963    -0.87   0.387    -.0085305    .0033241
_IstcXtren_6 |   .0025425   .0023834     1.07   0.288    -.0021725    .0072574
_IstcXtren_7 |   .0034645   .0025118     1.38   0.170    -.0015044    .0084334
_IstcXtren_8 |  -.0027186   .0025862    -1.05   0.295    -.0078347    .0023976
_IstcXtren_9 |  -.0029162   .0031425    -0.93   0.355    -.0091329    .0033005
_IstcXtre~10 |   .0157969   .0081847     1.93   0.056    -.0003943    .0319881
_IstcXtre~11 |   .0079263   .0055583     1.43   0.156    -.0030693    .0189218
_IstcXtre~12 |  -.0024115   .0029797    -0.81   0.420     -.008306     .003483
   reg_mexp0 |          0  (omitted)
   reg_mexp1 |          0  (omitted)
   reg_mexp2 |          0  (omitted)
   reg_mexp3 |  -.0026912   .0012988    -2.07   0.040    -.0052606   -.0001219
   reg_mexp4 |  -.0014654   .0006806    -2.15   0.033    -.0028119   -.0001189
       mexp0 |          0  (omitted)
       mexp1 |          0  (omitted)
       mexp2 |          0  (omitted)
       mexp3 |   .0020871   .0012091     1.73   0.087    -.0003048     .004479
       mexp4 |   .0004568   .0006956     0.66   0.512    -.0009192    .0018329
       _cons |   .2490505   .2419869     1.03   0.305    -.2296572    .7277582
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/NigeriaPlacebo.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   2.9203e+10)
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1951 omitted because of collinearity
note: _Iyearbirth_1952 omitted because of collinearity
note: _Iyearbirth_1953 omitted because of collinearity
note: _Iyearbirth_1954 omitted because of collinearity
note: _Iyearbirth_1955 omitted because of collinearity
note: _Iyearbirth_1956 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity

Linear regression                                      Number of obs =   28694
                                                       F( 51,   203) =    6.28
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0050
                                                       Root MSE      =  .07336

                            (Std. Err. adjusted for 204 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
      mmr_25 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
yr7075cap~53 |  -.0003225   .0054551    -0.06   0.953    -.0110785    .0104334
yr6569cap~53 |  -.0016244   .0035349    -0.46   0.646    -.0085942    .0053455
    capexp53 |  -.0041902     .00513    -0.82   0.415    -.0143051    .0059248
_Ireligion_2 |  -.0016629   .0015366    -1.08   0.280    -.0046925    .0013668
_Ireligion_3 |  -.0021254   .0011655    -1.82   0.070    -.0044234    .0001727
_Ireligion_4 |  -.0039586   .0025213    -1.57   0.118      -.00893    .0010128
_Ireligion_5 |  -.0011305   .0018185    -0.62   0.535     -.004716     .002455
_Iethnicit~2 |   .0023447   .0028644     0.82   0.414     -.003303    .0079925
_Iethnicit~3 |   .0071287   .0028996     2.46   0.015     .0014115    .0128459
_Iethnicit~4 |   .0010493   .0024941     0.42   0.674    -.0038684     .005967
_Iethnicit~5 |   .0046467   .0023915     1.94   0.053    -.0000687    .0093621
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -.0326781   .0266126    -1.23   0.221    -.0851507    .0197945
_Istcode19~5 |  -.0109107    .035814    -0.30   0.761    -.0815258    .0597045
_Istcode19~6 |  -.0298765    .025092    -1.19   0.235    -.0793508    .0195978
_Istcode19~7 |   .0173626   .0447012     0.39   0.698    -.0707757    .1055008
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |  -.0399481   .0268844    -1.49   0.139    -.0929565    .0130603
_Istcode1~12 |  -.0129677    .045065    -0.29   0.774    -.1018233    .0758878
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |          0  (omitted)
_Iyearb~1952 |          0  (omitted)
_Iyearb~1953 |          0  (omitted)
_Iyearb~1954 |          0  (omitted)
_Iyearb~1955 |          0  (omitted)
_Iyearb~1956 |          0  (omitted)
_Iyearb~1957 |     .00974   .0044629     2.18   0.030     .0009405    .0185396
_Iyearb~1958 |  -.0014981   .0025348    -0.59   0.555    -.0064961    .0034998
_Iyearb~1959 |  -.0007629   .0024419    -0.31   0.755    -.0055776    .0040518
_Iyearb~1960 |   .0011711   .0027861     0.42   0.675    -.0043223    .0066645
_Iyearb~1961 |  -.0004544   .0030485    -0.15   0.882    -.0064651    .0055563
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |   .0011731   .0026593     0.44   0.660    -.0040702    .0064164
_Iyearb~1966 |  -.0021382    .001746    -1.22   0.222    -.0055809    .0013045
_Iyearb~1967 |    .004233   .0039181     1.08   0.281    -.0034924    .0119583
_Iyearb~1968 |  -.0021006   .0022028    -0.95   0.341    -.0064439    .0022427
_Iyearb~1969 |   .0012305   .0025023     0.49   0.623    -.0037034    .0061644
_Iyearb~1970 |  -.0027467   .0025348    -1.08   0.280    -.0077447    .0022513
_Iyearb~1971 |  -.0038739   .0015792    -2.45   0.015    -.0069876   -.0007603
_Iyearb~1972 |  -.0000909   .0022077    -0.04   0.967    -.0044439    .0042622
_Iyearb~1973 |  -.0020684   .0014002    -1.48   0.141    -.0048292    .0006924
_Iyearb~1974 |  -.0009452   .0018092    -0.52   0.602    -.0045124    .0026219
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |    .013233   .0376309     0.35   0.725    -.0609647    .0874306
_Istcode19~3 |  -.0459204   .0342724    -1.34   0.182     -.113496    .0216552
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |  -.0311938   .0282845    -1.10   0.271    -.0869628    .0245753
_Istcode19~9 |   .0381958   .0271419     1.41   0.161    -.0153205     .091712
_Istcode1~10 |   .0046403   .0367203     0.13   0.900    -.0677618    .0770423
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |          0  (omitted)
       trend |   .0000887   .0006022     0.15   0.883    -.0010987     .001276
_IstcXtren_2 |  -.0002326   .0005531    -0.42   0.675    -.0013232     .000858
_IstcXtren_3 |   .0006562   .0005183     1.27   0.207    -.0003658    .0016782
_IstcXtren_4 |   .0004476   .0004007     1.12   0.265    -.0003424    .0012376
_IstcXtren_5 |   .0001229   .0005334     0.23   0.818    -.0009287    .0011746
_IstcXtren_6 |   .0004151   .0003878     1.07   0.286    -.0003495    .0011796
_IstcXtren_7 |  -.0002938   .0006584    -0.45   0.656     -.001592    .0010044
_IstcXtren_8 |     .00048   .0004352     1.10   0.271    -.0003781    .0013381
_IstcXtren_9 |  -.0005445   .0004087    -1.33   0.184    -.0013502    .0002613
_IstcXtre~10 |  -.0000674   .0005349    -0.13   0.900     -.001122    .0009873
_IstcXtre~11 |   .0006758   .0004104     1.65   0.101    -.0001334     .001485
_IstcXtre~12 |   .0000685     .00067     0.10   0.919    -.0012525    .0013896
yr6769sout~t |   .0028471   .0037486     0.76   0.448    -.0045441    .0102382
yr6769nonw~E |   .0016135   .0030202     0.53   0.594    -.0043415    .0075685
       _cons |   .0035082   .0406434     0.09   0.931    -.0766292    .0836455
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/Nigeria.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   2.9203e+10)
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1951 omitted because of collinearity
note: _Iyearbirth_1952 omitted because of collinearity
note: _Iyearbirth_1953 omitted because of collinearity
note: _Iyearbirth_1954 omitted because of collinearity
note: _Iyearbirth_1955 omitted because of collinearity
note: _Iyearbirth_1956 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity

Linear regression                                      Number of obs =   28694
                                                       F( 50,   203) =    7.31
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0050
                                                       Root MSE      =  .07336

                            (Std. Err. adjusted for 204 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
      mmr_25 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
yr7075nonw~t |  -.0192375   .0094934    -2.03   0.044    -.0379557   -.0005192
yr6569nonw~t |  -.0117855   .0051715    -2.28   0.024    -.0219823   -.0015887
_Ireligion_2 |  -.0019448   .0015681    -1.24   0.216    -.0050366     .001147
_Ireligion_3 |  -.0024175   .0012296    -1.97   0.051    -.0048419    6.88e-06
_Ireligion_4 |  -.0037974   .0025042    -1.52   0.131     -.008735    .0011403
_Ireligion_5 |  -.0013723   .0018531    -0.74   0.460    -.0050261    .0022816
_Iethnicit~2 |   .0023884   .0028622     0.83   0.405    -.0032552    .0080319
_Iethnicit~3 |   .0072813   .0028849     2.52   0.012     .0015931    .0129694
_Iethnicit~4 |   .0010189   .0024635     0.41   0.680    -.0038384    .0058762
_Iethnicit~5 |   .0046359    .002383     1.95   0.053    -.0000627    .0093344
_Istcode1~_2 |   .0191163   .0222331     0.86   0.391    -.0247211    .0629536
_Istcode19~3 |  -.0419076   .0286484    -1.46   0.145    -.0983942     .014579
_Istcode19~4 |  -.0288511   .0207667    -1.39   0.166    -.0697972    .0120951
_Istcode19~5 |   .0649107   .0416481     1.56   0.121    -.0172077    .1470291
_Istcode19~6 |  -.0269986   .0239424    -1.13   0.261    -.0742062     .020209
_Istcode19~7 |   .0224854   .0382833     0.59   0.558    -.0529986    .0979693
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |    .065459    .039907     1.64   0.102    -.0132265    .1441444
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |          0  (omitted)
_Iyearb~1952 |          0  (omitted)
_Iyearb~1953 |          0  (omitted)
_Iyearb~1954 |          0  (omitted)
_Iyearb~1955 |          0  (omitted)
_Iyearb~1956 |          0  (omitted)
_Iyearb~1957 |   .0089269   .0045127     1.98   0.049     .0000291    .0178248
_Iyearb~1958 |  -.0030537   .0025494    -1.20   0.232    -.0080805    .0019731
_Iyearb~1959 |  -.0031917   .0025341    -1.26   0.209    -.0081881    .0018048
_Iyearb~1960 |  -.0018726   .0026308    -0.71   0.477    -.0070598    .0033146
_Iyearb~1961 |   -.004388   .0035936    -1.22   0.223    -.0114737    .0026976
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |   .0020376   .0021204     0.96   0.338    -.0021432    .0062184
_Iyearb~1966 |  -.0021186   .0019179    -1.10   0.271    -.0059001     .001663
_Iyearb~1967 |   .0054853   .0040378     1.36   0.176     -.002476    .0134467
_Iyearb~1968 |  -.0016357   .0022769    -0.72   0.473    -.0061251    .0028537
_Iyearb~1969 |   .0008991   .0024522     0.37   0.714    -.0039359    .0057341
_Iyearb~1970 |   .0011641   .0027016     0.43   0.667    -.0041627    .0064908
_Iyearb~1971 |  -.0007773    .001815    -0.43   0.669    -.0043561    .0028014
_Iyearb~1972 |   .0022513   .0023236     0.97   0.334    -.0023302    .0068328
_Iyearb~1973 |  -.0005061   .0015154    -0.33   0.739    -.0034942    .0024819
_Iyearb~1974 |  -.0001858   .0017937    -0.10   0.918    -.0037225    .0033509
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |  -.0267581   .0201898    -1.33   0.187    -.0665667    .0130505
_Istcode19~9 |   .0418244   .0232622     1.80   0.074    -.0040422    .0876911
_Istcode1~10 |   .0099702   .0304577     0.33   0.744    -.0500838    .0700242
_Istcode1~11 |  -.0419505   .0244948    -1.71   0.088    -.0902473    .0063463
_Istcode1~12 |          0  (omitted)
       trend |   .0011486   .0006179     1.86   0.065    -.0000698    .0023669
_IstcXtren_2 |  -.0002369   .0003301    -0.72   0.474    -.0008877    .0004138
_IstcXtren_3 |   .0006509   .0004359     1.49   0.137    -.0002086    .0015104
_IstcXtren_4 |    .000443   .0003145     1.41   0.160    -.0001771    .0010631
_IstcXtren_5 |  -.0011388   .0007067    -1.61   0.109    -.0025322    .0002547
_IstcXtren_6 |   .0004039   .0003715     1.09   0.278    -.0003286    .0011363
_IstcXtren_7 |  -.0003021   .0005616    -0.54   0.591    -.0014094    .0008053
_IstcXtren_8 |    .000477   .0003054     1.56   0.120    -.0001251    .0010792
_IstcXtren_9 |  -.0005546   .0003496    -1.59   0.114     -.001244    .0001347
_IstcXtre~10 |  -.0000782    .000437    -0.18   0.858    -.0009399    .0007835
_IstcXtre~11 |   .0006739   .0003752     1.80   0.074    -.0000659    .0014136
_IstcXtre~12 |  -.0011967   .0006837    -1.75   0.082    -.0025448    .0001515
yr6769sout~t |   .0003976   .0042478     0.09   0.926    -.0079779    .0087732
yr6769nonw~E |  -.0009153   .0035666    -0.26   0.798    -.0079476    .0061171
       _cons |  -.0619137   .0352718    -1.76   0.081    -.1314598    .0076324
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/Nigeria.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   2.9203e+10)
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1951 omitted because of collinearity
note: _Iyearbirth_1952 omitted because of collinearity
note: _Iyearbirth_1953 omitted because of collinearity
note: _Iyearbirth_1954 omitted because of collinearity
note: _Iyearbirth_1955 omitted because of collinearity
note: _Iyearbirth_1956 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity

Linear regression                                      Number of obs =   28694
                                                       F( 58,   203) =    7.42
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0071
                                                       Root MSE      =  .07329

                            (Std. Err. adjusted for 204 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
      mmr_25 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
nonwest_m~re |   -.001277   .0006503    -1.96   0.051    -.0025593    5.19e-06
nonwest_pr~e |  -.0007683   .0007124    -1.08   0.282    -.0021729    .0006363
_Ireligion_2 |  -.0020833   .0015563    -1.34   0.182    -.0051518    .0009853
_Ireligion_3 |  -.0022311   .0012444    -1.79   0.074    -.0046848    .0002225
_Ireligion_4 |  -.0033701   .0025124    -1.34   0.181    -.0083239    .0015838
_Ireligion_5 |  -.0023149   .0019632    -1.18   0.240    -.0061858     .001556
_Iethnicit~2 |    .002476   .0028668     0.86   0.389    -.0031765    .0081285
_Iethnicit~3 |   .0075278   .0029202     2.58   0.011       .00177    .0132856
_Iethnicit~4 |   .0011742   .0024586     0.48   0.633    -.0036735    .0060219
_Iethnicit~5 |   .0048459   .0023962     2.02   0.044     .0001212    .0095706
_Istcode1~_2 |   .0263134   .0532591     0.49   0.622    -.0786987    .1313255
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -.0276766   .0203429    -1.36   0.175    -.0677872    .0124339
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |  -.0258334   .0239105    -1.08   0.281    -.0729782    .0213115
_Istcode19~7 |   .0228307    .038142     0.60   0.550    -.0523746    .0980359
_Istcode19~8 |  -.0271494   .0200803    -1.35   0.178    -.0667421    .0124432
_Istcode19~9 |   .0416651   .0229818     1.81   0.071    -.0036487    .0869788
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |  -.0358308     .05661    -0.63   0.527    -.1474498    .0757883
_Istcode1~12 |   .0104624   .0215932     0.48   0.629    -.0321133    .0530382
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |          0  (omitted)
_Iyearb~1952 |          0  (omitted)
_Iyearb~1953 |          0  (omitted)
_Iyearb~1954 |          0  (omitted)
_Iyearb~1955 |          0  (omitted)
_Iyearb~1956 |          0  (omitted)
_Iyearb~1957 |   .0094577   .0083247     1.14   0.257    -.0069563    .0258717
_Iyearb~1958 |  -.0014265   .0103394    -0.14   0.890     -.021813    .0189599
_Iyearb~1959 |   .0002181   .0103558     0.02   0.983    -.0202007    .0206369
_Iyearb~1960 |   .0028029   .0105663     0.27   0.791    -.0180308    .0236366
_Iyearb~1961 |   .0041762   .0099896     0.42   0.676    -.0155204    .0238729
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |   .0458187    .015503     2.96   0.003     .0152511    .0763862
_Iyearb~1966 |   .0385923   .0148622     2.60   0.010     .0092883    .0678963
_Iyearb~1967 |   .0387425   .0148361     2.61   0.010     .0094899     .067995
_Iyearb~1968 |   .0247628   .0122429     2.02   0.044     .0006232    .0489024
_Iyearb~1969 |   .0099734   .0097569     1.02   0.308    -.0092646    .0292113
_Iyearb~1970 |  -.0024558    .008896    -0.28   0.783    -.0199962    .0150846
_Iyearb~1971 |  -.0030942   .0072177    -0.43   0.669    -.0173256    .0111371
_Iyearb~1972 |   .0005145   .0057695     0.09   0.929    -.0108613    .0118903
_Iyearb~1973 |  -.0016762   .0037985    -0.44   0.659    -.0091658    .0058134
_Iyearb~1974 |  -.0007474   .0024977    -0.30   0.765    -.0056723    .0041774
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |  -.0414617   .0283269    -1.46   0.145    -.0973144    .0143909
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |   .0091187   .0216357     0.42   0.674    -.0335408    .0517781
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |   .0159125   .0591305     0.27   0.788    -.1006762    .1325011
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |          0  (omitted)
       trend |  -.0006186   .0017339    -0.36   0.722    -.0040373    .0028002
_IstcXtren_2 |  -.0003411   .0007541    -0.45   0.652     -.001828    .0011458
_IstcXtren_3 |   .0006455   .0004313     1.50   0.136     -.000205     .001496
_IstcXtren_4 |   .0004237   .0003087     1.37   0.171     -.000185    .0010324
_IstcXtren_5 |  -.0001301   .0003263    -0.40   0.690    -.0007736    .0005133
_IstcXtren_6 |   .0003866   .0003709     1.04   0.299    -.0003447    .0011179
_IstcXtren_7 |  -.0003073   .0005594    -0.55   0.583    -.0014103    .0007957
_IstcXtren_8 |   .0004805   .0003038     1.58   0.115    -.0001186    .0010795
_IstcXtren_9 |  -.0005533   .0003454    -1.60   0.111    -.0012344    .0001278
_IstcXtre~10 |  -.0001648   .0008368    -0.20   0.844    -.0018147     .001485
_IstcXtre~11 |   .0005858   .0008122     0.72   0.472    -.0010156    .0021873
_IstcXtre~12 |  -.0001992   .0003252    -0.61   0.541    -.0008404    .0004421
   reg_mexp0 |   .0004714   .0005114     0.92   0.358    -.0005369    .0014798
   reg_mexp1 |   4.14e-06   .0001616     0.03   0.980    -.0003145    .0003227
   reg_mexp2 |   .0000265    .000286     0.09   0.926    -.0005375    .0005904
   reg_mexp3 |  -.0001058    .000319    -0.33   0.741    -.0007347    .0005232
   reg_mexp4 |   .0002411    .000459     0.53   0.600     -.000664    .0011462
       mexp0 |  -.0001919   .0005075    -0.38   0.706    -.0011926    .0008087
       mexp1 |  -.0014613   .0004794    -3.05   0.003    -.0024066    -.000516
       mexp2 |  -.0019253   .0005606    -3.43   0.001    -.0030307   -.0008199
       mexp3 |  -.0004397   .0009712    -0.45   0.651    -.0023547    .0014752
       mexp4 |  -.0005847   .0011507    -0.51   0.612    -.0028535     .001684
       _cons |   .0491265   .1258576     0.39   0.697    -.1990293    .2972823
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/Nigeria.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   2.9203e+10)
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1951 omitted because of collinearity
note: _Iyearbirth_1952 omitted because of collinearity
note: _Iyearbirth_1953 omitted because of collinearity
note: _Iyearbirth_1954 omitted because of collinearity
note: _Iyearbirth_1955 omitted because of collinearity
note: _Iyearbirth_1956 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity

Linear regression                                      Number of obs =   28694
                                                       F( 58,   203) =    7.00
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0073
                                                       Root MSE      =  .07329

                            (Std. Err. adjusted for 204 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
      mmr_25 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
capexp53_m.. |  -.0012024    .000336    -3.58   0.000    -.0018649   -.0005399
capexp53_p~e |  -.0015084   .0004995    -3.02   0.003    -.0024934   -.0005235
_Ireligion_2 |   -.001941    .001556    -1.25   0.214     -.005009     .001127
_Ireligion_3 |  -.0020495   .0012365    -1.66   0.099    -.0044876    .0003886
_Ireligion_4 |  -.0034845   .0025137    -1.39   0.167    -.0084409    .0014719
_Ireligion_5 |  -.0021835   .0019509    -1.12   0.264    -.0060301    .0016631
_Iethnicit~2 |   .0024015   .0028689     0.84   0.404    -.0032552    .0080581
_Iethnicit~3 |   .0074274   .0029254     2.54   0.012     .0016594    .0131954
_Iethnicit~4 |   .0011691   .0024912     0.47   0.639    -.0037428     .006081
_Iethnicit~5 |   .0048261   .0024052     2.01   0.046     .0000836    .0095686
_Istcode1~_2 |   .0262618   .0474899     0.55   0.581    -.0673749    .1198986
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |  -.0188705   .0194165    -0.97   0.332    -.0571543    .0194134
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |  -.0207056   .0229742    -0.90   0.369    -.0660043    .0245931
_Istcode19~7 |   .0347165   .0378743     0.92   0.360     -.039961    .1093939
_Istcode19~8 |  -.0164095   .0197151    -0.83   0.406    -.0552821    .0224631
_Istcode19~9 |   .0493974   .0222244     2.22   0.027      .005577    .0932177
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |  -.0522364   .0518001    -1.01   0.314    -.1543717    .0498989
_Istcode1~12 |   .0173555   .0199058     0.87   0.384    -.0218933    .0566042
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |          0  (omitted)
_Iyearb~1952 |          0  (omitted)
_Iyearb~1953 |          0  (omitted)
_Iyearb~1954 |          0  (omitted)
_Iyearb~1955 |          0  (omitted)
_Iyearb~1956 |          0  (omitted)
_Iyearb~1957 |   .0095154   .0083116     1.14   0.254    -.0068727    .0259035
_Iyearb~1958 |  -.0013801   .0103576    -0.13   0.894    -.0218024    .0190421
_Iyearb~1959 |   .0002603   .0103809     0.03   0.980    -.0202079    .0207284
_Iyearb~1960 |   .0028249   .0105716     0.27   0.790    -.0180193    .0236691
_Iyearb~1961 |   .0042334   .0099856     0.42   0.672    -.0154554    .0239221
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |   .0460034   .0154944     2.97   0.003     .0154529    .0765539
_Iyearb~1966 |   .0394908   .0148214     2.66   0.008     .0102672    .0687144
_Iyearb~1967 |   .0403594   .0147578     2.73   0.007     .0112612    .0694576
_Iyearb~1968 |   .0270867   .0121553     2.23   0.027     .0031199    .0510535
_Iyearb~1969 |   .0129289   .0097348     1.33   0.186    -.0062654    .0321233
_Iyearb~1970 |  -.0022288   .0087524    -0.25   0.799     -.019486    .0150285
_Iyearb~1971 |  -.0029258   .0069536    -0.42   0.674    -.0166364    .0107848
_Iyearb~1972 |   .0006765   .0055214     0.12   0.903    -.0102102    .0115631
_Iyearb~1973 |  -.0015791   .0036111    -0.44   0.662    -.0086992     .005541
_Iyearb~1974 |  -.0007201   .0023941    -0.30   0.764    -.0054406    .0040004
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |  -.0315732   .0277071    -1.14   0.256    -.0862038    .0230574
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |   .0100875   .0204097     0.49   0.622    -.0301548    .0503298
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |   .0132023   .0536513     0.25   0.806    -.0925829    .1189875
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |          0  (omitted)
       trend |   -.000504   .0017213    -0.29   0.770     -.003898      .00289
_IstcXtren_2 |  -.0004062   .0006669    -0.61   0.543    -.0017212    .0009087
_IstcXtren_3 |   .0004624   .0004211     1.10   0.273    -.0003678    .0012926
_IstcXtren_4 |   .0002583   .0002933     0.88   0.379    -.0003199    .0008366
_IstcXtren_5 |  -.0001605   .0003033    -0.53   0.597    -.0007586    .0004376
_IstcXtren_6 |   .0002897   .0003546     0.82   0.415    -.0004094    .0009888
_IstcXtren_7 |  -.0005286   .0005553    -0.95   0.342    -.0016234    .0005663
_IstcXtren_8 |   .0002793   .0003003     0.93   0.353    -.0003128    .0008713
_IstcXtren_9 |  -.0006971    .000332    -2.10   0.037    -.0013517   -.0000424
_IstcXtre~10 |  -.0001807   .0007551    -0.24   0.811    -.0016695    .0013082
_IstcXtre~11 |   .0008391   .0007449     1.13   0.261    -.0006297    .0023078
_IstcXtre~12 |  -.0003411   .0002956    -1.15   0.250    -.0009239    .0002417
   reg_mexp0 |   .0005267   .0005094     1.03   0.302    -.0004776     .001531
   reg_mexp1 |   .0000513   .0001479     0.35   0.729    -.0002403    .0003429
   reg_mexp2 |   .0000913    .000266     0.34   0.732    -.0004332    .0006157
   reg_mexp3 |  -.0000192   .0002887    -0.07   0.947    -.0005885      .00055
   reg_mexp4 |   .0003467   .0004235     0.82   0.414    -.0004884    .0011818
       mexp0 |   -.000213   .0005005    -0.43   0.671    -.0011999    .0007738
       mexp1 |  -.0014772   .0004749    -3.11   0.002    -.0024136   -.0005408
       mexp2 |  -.0019414   .0005571    -3.48   0.001    -.0030398    -.000843
       mexp3 |  -.0004552   .0009693    -0.47   0.639    -.0023663    .0014559
       mexp4 |  -.0006012   .0011497    -0.52   0.602     -.002868    .0016656
       _cons |   .0436643    .125167     0.35   0.728    -.2031299    .2904585
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/Nigeria.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   6.5778e+09)
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1960 omitted because of collinearity
note: _Iyearbirth_1961 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1965 omitted because of collinearity
note: _Iyearbirth_1966 omitted because of collinearity
note: _Iyearbirth_1967 omitted because of collinearity
note: _Iyearbirth_1968 omitted because of collinearity
note: _Iyearbirth_1969 omitted because of collinearity
note: _Iyearbirth_1970 omitted because of collinearity
note: _Iyearbirth_1971 omitted because of collinearity
note: _Iyearbirth_1972 omitted because of collinearity
note: _Iyearbirth_1973 omitted because of collinearity
note: _Iyearbirth_1974 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: yr6769southeast omitted because of collinearity
note: yr6769nonwest_noSE omitted because of collinearity

Linear regression                                      Number of obs =    6508
                                                       F( 42,   131) =    3.16
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0108
                                                       Root MSE      =  .07291

                            (Std. Err. adjusted for 132 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
      mmr_25 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
yr5660cap~53 |   .0035559   .0061622     0.58   0.565    -.0086345    .0157463
    capexp53 |  -.0088589   .0099185    -0.89   0.373    -.0284799    .0107622
_Ireligion_2 |  -.0056356   .0026624    -2.12   0.036    -.0109024   -.0003688
_Ireligion_3 |   -.000701   .0019318    -0.36   0.717    -.0045226    .0031207
_Ireligion_4 |  -.0080974   .0020771    -3.90   0.000    -.0122065   -.0039884
_Ireligion_5 |   -.000407   .0039098    -0.10   0.917    -.0081415    .0073275
_Iethnicit~2 |   .0126495   .0110097     1.15   0.253    -.0091304    .0344293
_Iethnicit~3 |   .0069382   .0072641     0.96   0.341    -.0074319    .0213083
_Iethnicit~4 |   .0061111   .0064842     0.94   0.348    -.0067162    .0189384
_Iethnicit~5 |   .0083085   .0066339     1.25   0.213    -.0048149    .0214318
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |   .0009398   .0560207     0.02   0.987    -.1098825     .111762
_Istcode19~5 |   .0634433   .1009055     0.63   0.531    -.1361718    .2630584
_Istcode19~6 |   .0208063   .0467919     0.44   0.657    -.0717592    .1133717
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |   -.002821    .084292    -0.03   0.973    -.1695706    .1639287
_Istcode1~10 |  -.0070105    .062692    -0.11   0.911    -.1310303    .1170093
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |  -.0364245   .0943199    -0.39   0.700    -.2230118    .1501629
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |  -.0095256    .004028    -2.36   0.020     -.017494   -.0015573
_Iyearb~1952 |   .0007651   .0047944     0.16   0.873    -.0087194    .0102496
_Iyearb~1953 |  -.0037127   .0039333    -0.94   0.347    -.0114937    .0040682
_Iyearb~1954 |  -.0072735   .0037663    -1.93   0.056    -.0147241     .000177
_Iyearb~1955 |  -.0004137   .0040238    -0.10   0.918    -.0083738    .0075464
_Iyearb~1956 |  -.0046793   .0032637    -1.43   0.154    -.0111357    .0017771
_Iyearb~1957 |   .0061488   .0043243     1.42   0.157    -.0024058    .0147034
_Iyearb~1958 |  -.0045213   .0023948    -1.89   0.061    -.0092588    .0002162
_Iyearb~1959 |  -.0030061   .0021466    -1.40   0.164    -.0072526    .0012404
_Iyearb~1960 |          0  (omitted)
_Iyearb~1961 |          0  (omitted)
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |          0  (omitted)
_Iyearb~1966 |          0  (omitted)
_Iyearb~1967 |          0  (omitted)
_Iyearb~1968 |          0  (omitted)
_Iyearb~1969 |          0  (omitted)
_Iyearb~1970 |          0  (omitted)
_Iyearb~1971 |          0  (omitted)
_Iyearb~1972 |          0  (omitted)
_Iyearb~1973 |          0  (omitted)
_Iyearb~1974 |          0  (omitted)
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |   .0106397   .0822974     0.13   0.897    -.1521642    .1734436
_Istcode19~3 |  -.0217765   .0607755    -0.36   0.721     -.142005    .0984519
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |  -.1371579   .0815014    -1.68   0.095    -.2983871    .0240713
_Istcode19~8 |   .0648057   .0679975     0.95   0.342    -.0697095    .1993208
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |   .0509375   .0463929     1.10   0.274    -.0408387    .1427137
_Istcode1~12 |          0  (omitted)
       trend |  -.0005979   .0015282    -0.39   0.696     -.003621    .0024253
_IstcXtren_2 |  -.0001334   .0014919    -0.09   0.929    -.0030847    .0028179
_IstcXtren_3 |   .0002199   .0011131     0.20   0.844    -.0019822    .0024219
_IstcXtren_4 |   -.000207   .0010131    -0.20   0.838    -.0022111    .0017972
_IstcXtren_5 |  -.0013865   .0017939    -0.77   0.441    -.0049353    .0021622
_IstcXtren_6 |  -.0005325    .000867    -0.61   0.540    -.0022476    .0011827
_IstcXtren_7 |   .0024885   .0015259     1.63   0.105    -.0005302    .0055071
_IstcXtren_8 |  -.0012074   .0012117    -1.00   0.321    -.0036044    .0011895
_IstcXtren_9 |   .0001398   .0015213     0.09   0.927    -.0028696    .0031492
_IstcXtre~10 |  -.0001585   .0011219    -0.14   0.888    -.0023778    .0020609
_IstcXtre~11 |  -.0010361    .000892    -1.16   0.248    -.0028007    .0007285
_IstcXtre~12 |   .0003689   .0016583     0.22   0.824    -.0029117    .0036494
yr6769sout~t |          0  (omitted)
yr6769nonw~E |          0  (omitted)
       _cons |   .0450721   .0863775     0.52   0.603    -.1258031    .2159474
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/NigeriaPlacebo.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   6.5778e+09)
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1960 omitted because of collinearity
note: _Iyearbirth_1961 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1965 omitted because of collinearity
note: _Iyearbirth_1966 omitted because of collinearity
note: _Iyearbirth_1967 omitted because of collinearity
note: _Iyearbirth_1968 omitted because of collinearity
note: _Iyearbirth_1969 omitted because of collinearity
note: _Iyearbirth_1970 omitted because of collinearity
note: _Iyearbirth_1971 omitted because of collinearity
note: _Iyearbirth_1972 omitted because of collinearity
note: _Iyearbirth_1973 omitted because of collinearity
note: _Iyearbirth_1974 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: yr6769southeast omitted because of collinearity
note: yr6769nonwest_noSE omitted because of collinearity

Linear regression                                      Number of obs =    6508
                                                       F( 41,   131) =    3.04
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0105
                                                       Root MSE      =  .07291

                            (Std. Err. adjusted for 132 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
      mmr_25 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
yr5660nonw~t |   .0017714   .0058865     0.30   0.764    -.0098734    .0134162
_Ireligion_2 |  -.0059573   .0026795    -2.22   0.028     -.011258   -.0006565
_Ireligion_3 |  -.0011052   .0020224    -0.55   0.586     -.005106    .0028957
_Ireligion_4 |  -.0080213   .0020677    -3.88   0.000    -.0121118   -.0039309
_Ireligion_5 |  -.0007148   .0038923    -0.18   0.855    -.0084148    .0069852
_Iethnicit~2 |   .0125038   .0110323     1.13   0.259    -.0093207    .0343283
_Iethnicit~3 |   .0069862    .007268     0.96   0.338    -.0073916     .021364
_Iethnicit~4 |   .0058316   .0065714     0.89   0.376    -.0071682    .0188315
_Iethnicit~5 |   .0080568   .0067194     1.20   0.233    -.0052358    .0213494
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |   .0261649   .0414882     0.63   0.529    -.0559086    .1082385
_Istcode19~5 |   .0929478   .0975325     0.95   0.342    -.0999948    .2858903
_Istcode19~6 |   .0350305   .0419374     0.84   0.405    -.0479317    .1179927
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |   .0212278   .0760557     0.28   0.781    -.1292285    .1716842
_Istcode1~10 |    .024738    .042527     0.58   0.562    -.0593905    .1088666
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |   .0097385   .0565021     0.17   0.863    -.1020362    .1215132
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |  -.0094439   .0040849    -2.31   0.022    -.0175249   -.0013629
_Iyearb~1952 |   .0006966    .004927     0.14   0.888    -.0090502    .0104435
_Iyearb~1953 |  -.0040726   .0037205    -1.09   0.276    -.0114326    .0032874
_Iyearb~1954 |  -.0077913    .003674    -2.12   0.036    -.0150595   -.0005232
_Iyearb~1955 |  -.0010819   .0039183    -0.28   0.783    -.0088333    .0066694
_Iyearb~1956 |  -.0039095   .0027091    -1.44   0.151    -.0092687    .0014498
_Iyearb~1957 |   .0066712    .004117     1.62   0.108    -.0014733    .0148156
_Iyearb~1958 |  -.0041375   .0023785    -1.74   0.084    -.0088428    .0005679
_Iyearb~1959 |   -.002839   .0021779    -1.30   0.195    -.0071473    .0014693
_Iyearb~1960 |          0  (omitted)
_Iyearb~1961 |          0  (omitted)
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |          0  (omitted)
_Iyearb~1966 |          0  (omitted)
_Iyearb~1967 |          0  (omitted)
_Iyearb~1968 |          0  (omitted)
_Iyearb~1969 |          0  (omitted)
_Iyearb~1970 |          0  (omitted)
_Iyearb~1971 |          0  (omitted)
_Iyearb~1972 |          0  (omitted)
_Iyearb~1973 |          0  (omitted)
_Iyearb~1974 |          0  (omitted)
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |   .0497162   .0556082     0.89   0.373      -.06029    .1597224
_Istcode19~3 |   .0055732   .0453009     0.12   0.902    -.0840427    .0951891
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |  -.1040008   .0658997    -1.58   0.117    -.2343661    .0263646
_Istcode19~8 |   .0929289   .0514441     1.81   0.073    -.0088398    .1946976
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |   .0364591   .0418952     0.87   0.386    -.0464195    .1193377
_Istcode1~12 |          0  (omitted)
       trend |  -.0000183   .0010268    -0.02   0.986    -.0020495    .0020129
_IstcXtren_2 |  -.0007143    .001041    -0.69   0.494    -.0027736    .0013451
_IstcXtren_3 |  -.0001903   .0008692    -0.22   0.827    -.0019099    .0015292
_IstcXtren_4 |  -.0005805   .0007902    -0.73   0.464    -.0021437    .0009828
_IstcXtren_5 |  -.0017564   .0018063    -0.97   0.333    -.0053297    .0018169
_IstcXtren_6 |  -.0007392   .0007991    -0.92   0.357      -.00232    .0008417
_IstcXtren_7 |   .0019939   .0012881     1.55   0.124    -.0005542     .004542
_IstcXtren_8 |   -.001619   .0009537    -1.70   0.092    -.0035057    .0002678
_IstcXtren_9 |  -.0002259   .0014076    -0.16   0.873    -.0030105    .0025587
_IstcXtre~10 |  -.0006255    .000812    -0.77   0.442    -.0022319    .0009808
_IstcXtre~11 |  -.0008188   .0008098    -1.01   0.314    -.0024208    .0007832
_IstcXtre~12 |  -.0002473   .0010937    -0.23   0.821     -.002411    .0019164
yr6769sout~t |          0  (omitted)
yr6769nonw~E |          0  (omitted)
       _cons |   .0011689   .0531087     0.02   0.982    -.1038927    .1062306
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/NigeriaPlacebo.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   6.5778e+09)
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1960 omitted because of collinearity
note: _Iyearbirth_1961 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1965 omitted because of collinearity
note: _Iyearbirth_1966 omitted because of collinearity
note: _Iyearbirth_1967 omitted because of collinearity
note: _Iyearbirth_1968 omitted because of collinearity
note: _Iyearbirth_1969 omitted because of collinearity
note: _Iyearbirth_1970 omitted because of collinearity
note: _Iyearbirth_1971 omitted because of collinearity
note: _Iyearbirth_1972 omitted because of collinearity
note: _Iyearbirth_1973 omitted because of collinearity
note: _Iyearbirth_1974 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: reg_mexp0 omitted because of collinearity
note: reg_mexp1 omitted because of collinearity
note: reg_mexp2 omitted because of collinearity
note: mexp0 omitted because of collinearity
note: mexp1 omitted because of collinearity
note: mexp2 omitted because of collinearity

Linear regression                                      Number of obs =    6508
                                                       F( 45,   131) =    3.56
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0108
                                                       Root MSE      =  .07292

                            (Std. Err. adjusted for 132 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
      mmr_25 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
nonwest_m~ke |  -.0019564   .0022703    -0.86   0.390    -.0064476    .0025348
_Ireligion_2 |  -.0060468   .0026767    -2.26   0.026    -.0113419   -.0007517
_Ireligion_3 |  -.0010813   .0020351    -0.53   0.596    -.0051072    .0029445
_Ireligion_4 |  -.0079336   .0021327    -3.72   0.000    -.0121526   -.0037147
_Ireligion_5 |  -.0007539   .0041344    -0.18   0.856    -.0089327     .007425
_Iethnicit~2 |   .0124978   .0110635     1.13   0.261    -.0093884     .034384
_Iethnicit~3 |   .0071008   .0072766     0.98   0.331     -.007294    .0214956
_Iethnicit~4 |   .0059343   .0065803     0.90   0.369    -.0070832    .0189518
_Iethnicit~5 |   .0081523   .0067279     1.21   0.228     -.005157    .0214617
_Istcode1~_2 |   .1068219   .1079043     0.99   0.324    -.1066384    .3202823
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |   .1679619   .1243721     1.35   0.179    -.0780757    .4139995
_Istcode19~6 |   .0349375   .0419137     0.83   0.406    -.0479777    .1178527
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |   .0929518   .0517885     1.79   0.075    -.0094982    .1954018
_Istcode19~9 |   .0214101   .0760819     0.28   0.779    -.1290981    .1719183
_Istcode1~10 |   .0787264   .0991858     0.79   0.429    -.1174867    .2749395
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |   .0789856    .081579     0.97   0.335    -.0823972    .2403683
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |  -.0092745   .0044629    -2.08   0.040    -.0181031   -.0004459
_Iyearb~1952 |   .0002344   .0059417     0.04   0.969    -.0115196    .0119884
_Iyearb~1953 |  -.0050075   .0093673    -0.53   0.594    -.0235382    .0135233
_Iyearb~1954 |  -.0093916   .0106916    -0.88   0.381    -.0305422    .0117589
_Iyearb~1955 |  -.0032466   .0105149    -0.31   0.758    -.0240476    .0175543
_Iyearb~1956 |  -.0050577   .0075675    -0.67   0.505    -.0200279    .0099126
_Iyearb~1957 |   .0044213   .0061288     0.72   0.472     -.007703    .0165455
_Iyearb~1958 |  -.0064001   .0050431    -1.27   0.207    -.0163764    .0035763
_Iyearb~1959 |  -.0038916   .0030501    -1.28   0.204    -.0099254    .0021422
_Iyearb~1960 |          0  (omitted)
_Iyearb~1961 |          0  (omitted)
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |          0  (omitted)
_Iyearb~1966 |          0  (omitted)
_Iyearb~1967 |          0  (omitted)
_Iyearb~1968 |          0  (omitted)
_Iyearb~1969 |          0  (omitted)
_Iyearb~1970 |          0  (omitted)
_Iyearb~1971 |          0  (omitted)
_Iyearb~1972 |          0  (omitted)
_Iyearb~1973 |          0  (omitted)
_Iyearb~1974 |          0  (omitted)
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |   .0053295   .0455888     0.12   0.907     -.084856     .095515
_Istcode19~4 |   .0264401   .0412485     0.64   0.523    -.0551592    .1080394
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |  -.1041601   .0656959    -1.59   0.115    -.2341222     .025802
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |   .0908921   .0987149     0.92   0.359    -.1043895    .2861738
_Istcode1~12 |          0  (omitted)
       trend |   .0008928   .0026302     0.34   0.735    -.0043104     .006096
_IstcXtren_2 |   -.001972   .0021897    -0.90   0.369    -.0063038    .0023598
_IstcXtren_3 |  -.0001866   .0008751    -0.21   0.832    -.0019177    .0015446
_IstcXtren_4 |  -.0005858   .0007869    -0.74   0.458    -.0021424    .0009708
_IstcXtren_5 |  -.0032297   .0023315    -1.39   0.168    -.0078419    .0013826
_IstcXtren_6 |  -.0007363   .0007993    -0.92   0.359    -.0023175    .0008448
_IstcXtren_7 |   .0019969   .0012842     1.55   0.122    -.0005436    .0045374
_IstcXtren_8 |  -.0016193     .00096    -1.69   0.094    -.0035183    .0002798
_IstcXtren_9 |  -.0002295   .0014084    -0.16   0.871    -.0030157    .0025567
_IstcXtre~10 |  -.0018255   .0020444    -0.89   0.374    -.0058698    .0022188
_IstcXtre~11 |  -.0020245   .0020407    -0.99   0.323    -.0060615    .0020125
_IstcXtre~12 |  -.0016176   .0015821    -1.02   0.308    -.0047475    .0015122
   reg_mexp0 |          0  (omitted)
   reg_mexp1 |          0  (omitted)
   reg_mexp2 |          0  (omitted)
   reg_mexp3 |   .0004491   .0005512     0.81   0.417    -.0006413    .0015394
   reg_mexp4 |     .00036   .0003083     1.17   0.245    -.0002498    .0009698
       mexp0 |          0  (omitted)
       mexp1 |          0  (omitted)
       mexp2 |          0  (omitted)
       mexp3 |   .0000946   .0007067     0.13   0.894    -.0013034    .0014927
       mexp4 |  -.0000615   .0004113    -0.15   0.881    -.0008751    .0007521
       _cons |  -.0430782   .1275127    -0.34   0.736    -.2953286    .2091723
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/NigeriaPlacebo.xls
dir : seeout
i.religion        _Ireligion_1-5      (naturally coded; _Ireligion_1 omitted)
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.stcode1967      _Istcode196_1-12    (naturally coded; _Istcode196_1 omitted)
i.yearbirth       _Iyearbirth_1903-2008(naturally coded; _Iyearbirth_1903 omitt
> ed)
i.stcod~7*trend   _IstcXtren_#        (coded as above)
(sum of wgt is   6.5778e+09)
note: _Istcode196_3 omitted because of collinearity
note: _Istcode196_7 omitted because of collinearity
note: _Istcode196_12 omitted because of collinearity
note: _Iyearbirth_1911 omitted because of collinearity
note: _Iyearbirth_1919 omitted because of collinearity
note: _Iyearbirth_1920 omitted because of collinearity
note: _Iyearbirth_1921 omitted because of collinearity
note: _Iyearbirth_1922 omitted because of collinearity
note: _Iyearbirth_1923 omitted because of collinearity
note: _Iyearbirth_1924 omitted because of collinearity
note: _Iyearbirth_1925 omitted because of collinearity
note: _Iyearbirth_1927 omitted because of collinearity
note: _Iyearbirth_1928 omitted because of collinearity
note: _Iyearbirth_1929 omitted because of collinearity
note: _Iyearbirth_1930 omitted because of collinearity
note: _Iyearbirth_1931 omitted because of collinearity
note: _Iyearbirth_1932 omitted because of collinearity
note: _Iyearbirth_1933 omitted because of collinearity
note: _Iyearbirth_1934 omitted because of collinearity
note: _Iyearbirth_1935 omitted because of collinearity
note: _Iyearbirth_1936 omitted because of collinearity
note: _Iyearbirth_1937 omitted because of collinearity
note: _Iyearbirth_1938 omitted because of collinearity
note: _Iyearbirth_1939 omitted because of collinearity
note: _Iyearbirth_1940 omitted because of collinearity
note: _Iyearbirth_1941 omitted because of collinearity
note: _Iyearbirth_1942 omitted because of collinearity
note: _Iyearbirth_1943 omitted because of collinearity
note: _Iyearbirth_1944 omitted because of collinearity
note: _Iyearbirth_1945 omitted because of collinearity
note: _Iyearbirth_1946 omitted because of collinearity
note: _Iyearbirth_1947 omitted because of collinearity
note: _Iyearbirth_1948 omitted because of collinearity
note: _Iyearbirth_1949 omitted because of collinearity
note: _Iyearbirth_1950 omitted because of collinearity
note: _Iyearbirth_1960 omitted because of collinearity
note: _Iyearbirth_1961 omitted because of collinearity
note: _Iyearbirth_1962 omitted because of collinearity
note: _Iyearbirth_1963 omitted because of collinearity
note: _Iyearbirth_1964 omitted because of collinearity
note: _Iyearbirth_1965 omitted because of collinearity
note: _Iyearbirth_1966 omitted because of collinearity
note: _Iyearbirth_1967 omitted because of collinearity
note: _Iyearbirth_1968 omitted because of collinearity
note: _Iyearbirth_1969 omitted because of collinearity
note: _Iyearbirth_1970 omitted because of collinearity
note: _Iyearbirth_1971 omitted because of collinearity
note: _Iyearbirth_1972 omitted because of collinearity
note: _Iyearbirth_1973 omitted because of collinearity
note: _Iyearbirth_1974 omitted because of collinearity
note: _Iyearbirth_1975 omitted because of collinearity
note: _Iyearbirth_1976 omitted because of collinearity
note: _Iyearbirth_1977 omitted because of collinearity
note: _Iyearbirth_1978 omitted because of collinearity
note: _Iyearbirth_1979 omitted because of collinearity
note: _Iyearbirth_1980 omitted because of collinearity
note: _Iyearbirth_1981 omitted because of collinearity
note: _Iyearbirth_1982 omitted because of collinearity
note: _Iyearbirth_1983 omitted because of collinearity
note: _Iyearbirth_1984 omitted because of collinearity
note: _Iyearbirth_1985 omitted because of collinearity
note: _Iyearbirth_1986 omitted because of collinearity
note: _Iyearbirth_1987 omitted because of collinearity
note: _Iyearbirth_1988 omitted because of collinearity
note: _Iyearbirth_1989 omitted because of collinearity
note: _Iyearbirth_1990 omitted because of collinearity
note: _Iyearbirth_1991 omitted because of collinearity
note: _Iyearbirth_1992 omitted because of collinearity
note: _Iyearbirth_1993 omitted because of collinearity
note: _Iyearbirth_1994 omitted because of collinearity
note: _Iyearbirth_1995 omitted because of collinearity
note: _Iyearbirth_1996 omitted because of collinearity
note: _Iyearbirth_1997 omitted because of collinearity
note: _Iyearbirth_1998 omitted because of collinearity
note: _Iyearbirth_1999 omitted because of collinearity
note: _Iyearbirth_2000 omitted because of collinearity
note: _Iyearbirth_2001 omitted because of collinearity
note: _Iyearbirth_2002 omitted because of collinearity
note: _Iyearbirth_2003 omitted because of collinearity
note: _Iyearbirth_2004 omitted because of collinearity
note: _Iyearbirth_2005 omitted because of collinearity
note: _Iyearbirth_2006 omitted because of collinearity
note: _Iyearbirth_2007 omitted because of collinearity
note: _Iyearbirth_2008 omitted because of collinearity
note: _Istcode196_2 omitted because of collinearity
note: _Istcode196_4 omitted because of collinearity
note: _Istcode196_5 omitted because of collinearity
note: _Istcode196_6 omitted because of collinearity
note: _Istcode196_8 omitted because of collinearity
note: _Istcode196_9 omitted because of collinearity
note: _Istcode196_10 omitted because of collinearity
note: _Istcode196_11 omitted because of collinearity
note: reg_mexp0 omitted because of collinearity
note: reg_mexp1 omitted because of collinearity
note: reg_mexp2 omitted because of collinearity
note: mexp0 omitted because of collinearity
note: mexp1 omitted because of collinearity
note: mexp2 omitted because of collinearity

Linear regression                                      Number of obs =    6508
                                                       F( 45,   131) =    3.57
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0109
                                                       Root MSE      =  .07292

                            (Std. Err. adjusted for 132 clusters in yearstate)
------------------------------------------------------------------------------
             |               Robust
      mmr_25 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
capexp53_~ke |  -.0015608   .0014814    -1.05   0.294    -.0044913    .0013698
_Ireligion_2 |  -.0058746   .0026949    -2.18   0.031    -.0112058   -.0005433
_Ireligion_3 |  -.0008747   .0020466    -0.43   0.670    -.0049233    .0031738
_Ireligion_4 |  -.0080415   .0021259    -3.78   0.000    -.0122471   -.0038359
_Ireligion_5 |  -.0005805   .0041492    -0.14   0.889    -.0087886    .0076276
_Iethnicit~2 |   .0124901   .0110655     1.13   0.261    -.0094001    .0343802
_Iethnicit~3 |   .0070291   .0072502     0.97   0.334    -.0073135    .0213718
_Iethnicit~4 |   .0059852   .0065638     0.91   0.364    -.0069996    .0189699
_Iethnicit~5 |   .0082152   .0067139     1.22   0.223    -.0050665    .0214969
_Istcode1~_2 |   .1696175   .1249735     1.36   0.177    -.0776099    .4168448
_Istcode19~3 |          0  (omitted)
_Istcode19~4 |   .0630592    .050227     1.26   0.212    -.0363017    .1624201
_Istcode19~5 |   .1674425   .0966715     1.73   0.086    -.0237967    .3586818
_Istcode19~6 |    .056792   .0424383     1.34   0.183    -.0271612    .1407451
_Istcode19~7 |          0  (omitted)
_Istcode19~8 |   .1367563   .0612185     2.23   0.027     .0156516     .257861
_Istcode19~9 |   .0538897   .0724245     0.74   0.458    -.0893832    .1971625
_Istcode1~10 |   .1332324   .1101289     1.21   0.229    -.0846289    .3510937
_Istcode1~11 |   .0770321   .1005656     0.77   0.445    -.1219106    .2759747
_Istcode1~12 |          0  (omitted)
_Iyearb~1911 |          0  (omitted)
_Iyearb~1919 |          0  (omitted)
_Iyearb~1920 |          0  (omitted)
_Iyearb~1921 |          0  (omitted)
_Iyearb~1922 |          0  (omitted)
_Iyearb~1923 |          0  (omitted)
_Iyearb~1924 |          0  (omitted)
_Iyearb~1925 |          0  (omitted)
_Iyearb~1927 |          0  (omitted)
_Iyearb~1928 |          0  (omitted)
_Iyearb~1929 |          0  (omitted)
_Iyearb~1930 |          0  (omitted)
_Iyearb~1931 |          0  (omitted)
_Iyearb~1932 |          0  (omitted)
_Iyearb~1933 |          0  (omitted)
_Iyearb~1934 |          0  (omitted)
_Iyearb~1935 |          0  (omitted)
_Iyearb~1936 |          0  (omitted)
_Iyearb~1937 |          0  (omitted)
_Iyearb~1938 |          0  (omitted)
_Iyearb~1939 |          0  (omitted)
_Iyearb~1940 |          0  (omitted)
_Iyearb~1941 |          0  (omitted)
_Iyearb~1942 |          0  (omitted)
_Iyearb~1943 |          0  (omitted)
_Iyearb~1944 |          0  (omitted)
_Iyearb~1945 |          0  (omitted)
_Iyearb~1946 |          0  (omitted)
_Iyearb~1947 |          0  (omitted)
_Iyearb~1948 |          0  (omitted)
_Iyearb~1949 |          0  (omitted)
_Iyearb~1950 |          0  (omitted)
_Iyearb~1951 |  -.0091396   .0043569    -2.10   0.038    -.0177585   -.0005206
_Iyearb~1952 |   .0004449   .0056355     0.08   0.937    -.0107034    .0115932
_Iyearb~1953 |  -.0046262   .0091072    -0.51   0.612    -.0226424    .0133901
_Iyearb~1954 |  -.0089404   .0103778    -0.86   0.391    -.0294701    .0115894
_Iyearb~1955 |  -.0026403   .0104879    -0.25   0.802    -.0233878    .0181072
_Iyearb~1956 |  -.0046461   .0074272    -0.63   0.533    -.0193389    .0100468
_Iyearb~1957 |   .0047265   .0061655     0.77   0.445    -.0074705    .0169234
_Iyearb~1958 |  -.0062395   .0050543    -1.23   0.219    -.0162382    .0037592
_Iyearb~1959 |  -.0038053   .0031801    -1.20   0.234    -.0100964    .0024858
_Iyearb~1960 |          0  (omitted)
_Iyearb~1961 |          0  (omitted)
_Iyearb~1962 |          0  (omitted)
_Iyearb~1963 |          0  (omitted)
_Iyearb~1964 |          0  (omitted)
_Iyearb~1965 |          0  (omitted)
_Iyearb~1966 |          0  (omitted)
_Iyearb~1967 |          0  (omitted)
_Iyearb~1968 |          0  (omitted)
_Iyearb~1969 |          0  (omitted)
_Iyearb~1970 |          0  (omitted)
_Iyearb~1971 |          0  (omitted)
_Iyearb~1972 |          0  (omitted)
_Iyearb~1973 |          0  (omitted)
_Iyearb~1974 |          0  (omitted)
_Iyearb~1975 |          0  (omitted)
_Iyearb~1976 |          0  (omitted)
_Iyearb~1977 |          0  (omitted)
_Iyearb~1978 |          0  (omitted)
_Iyearb~1979 |          0  (omitted)
_Iyearb~1980 |          0  (omitted)
_Iyearb~1981 |          0  (omitted)
_Iyearb~1982 |          0  (omitted)
_Iyearb~1983 |          0  (omitted)
_Iyearb~1984 |          0  (omitted)
_Iyearb~1985 |          0  (omitted)
_Iyearb~1986 |          0  (omitted)
_Iyearb~1987 |          0  (omitted)
_Iyearb~1988 |          0  (omitted)
_Iyearb~1989 |          0  (omitted)
_Iyearb~1990 |          0  (omitted)
_Iyearb~1991 |          0  (omitted)
_Iyearb~1992 |          0  (omitted)
_Iyearb~1993 |          0  (omitted)
_Iyearb~1994 |          0  (omitted)
_Iyearb~1995 |          0  (omitted)
_Iyearb~1996 |          0  (omitted)
_Iyearb~1997 |          0  (omitted)
_Iyearb~1998 |          0  (omitted)
_Iyearb~1999 |          0  (omitted)
_Iyearb~2000 |          0  (omitted)
_Iyearb~2001 |          0  (omitted)
_Iyearb~2002 |          0  (omitted)
_Iyearb~2003 |          0  (omitted)
_Iyearb~2004 |          0  (omitted)
_Iyearb~2005 |          0  (omitted)
_Iyearb~2006 |          0  (omitted)
_Iyearb~2007 |          0  (omitted)
_Iyearb~2008 |          0  (omitted)
_Istcode1~_2 |          0  (omitted)
_Istcode19~3 |   .0467328   .0562423     0.83   0.408    -.0645279    .1579935
_Istcode19~4 |          0  (omitted)
_Istcode19~5 |          0  (omitted)
_Istcode19~6 |          0  (omitted)
_Istcode19~7 |  -.0548468   .0763745    -0.72   0.474    -.2059337    .0962401
_Istcode19~8 |          0  (omitted)
_Istcode19~9 |          0  (omitted)
_Istcode1~10 |          0  (omitted)
_Istcode1~11 |          0  (omitted)
_Istcode1~12 |   .1036255   .0863353     1.20   0.232    -.0671663    .2744172
       trend |   .0014453   .0028134     0.51   0.608    -.0041202    .0070108
_IstcXtren_2 |  -.0032294   .0025324    -1.28   0.204     -.008239    .0017803
_IstcXtren_3 |  -.0009942   .0010826    -0.92   0.360    -.0031359    .0011474
_IstcXtren_4 |  -.0013042   .0009651    -1.35   0.179    -.0032135     .000605
_IstcXtren_5 |  -.0032212   .0017953    -1.79   0.075    -.0067727    .0003303
_IstcXtren_6 |  -.0011659   .0008122    -1.44   0.154    -.0027725    .0004408
_IstcXtren_7 |   .0010332   .0014945     0.69   0.491    -.0019232    .0039897
_IstcXtren_8 |  -.0024784   .0011514    -2.15   0.033    -.0047562   -.0002006
_IstcXtren_9 |  -.0008644   .0013365    -0.65   0.519    -.0035084    .0017796
_IstcXtre~10 |  -.0029189   .0022497    -1.30   0.197    -.0073693    .0015316
_IstcXtre~11 |  -.0017783   .0020767    -0.86   0.393    -.0058865    .0023298
_IstcXtre~12 |  -.0021005   .0016816    -1.25   0.214    -.0054271     .001226
   reg_mexp0 |          0  (omitted)
   reg_mexp1 |          0  (omitted)
   reg_mexp2 |          0  (omitted)
   reg_mexp3 |   .0005179   .0005587     0.93   0.356    -.0005873    .0016231
   reg_mexp4 |   .0004238   .0003097     1.37   0.173    -.0001888    .0010365
       mexp0 |          0  (omitted)
       mexp1 |          0  (omitted)
       mexp2 |          0  (omitted)
       mexp3 |   .0000814   .0007078     0.11   0.909    -.0013189    .0014817
       mexp4 |  -.0000768   .0004115    -0.19   0.852    -.0008909    .0007374
       _cons |  -.0714548      .1364    -0.52   0.601    -.3412865    .1983769
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/NigeriaPlacebo.xls
dir : seeout

. **GRAPHICAL
. collapse mmr [pw=v005], by(yearbirth)

. keep if year>1931
(14 observations deleted)

. egen mmr_ma=ma(mmr)
(2 missing values generated)

. 
. graph twoway line mmr_m yearbirth if yearbir>=1955&yearbir<1990, ///
> scheme(s1color) ytitle("Maternal Mortality") legend(off)         ///
> xline(1965, lcolor(black) lpattern(dot))                         ///
> xline(1975, lcolor(black) lpattern(dot))                         ///
> || lfit mmr_ma yearbirth if yearbir<=1965&yearbir>=1955, `linef' ///
> || lfit mmr_ma yearbirth if yearbir>=1975&yearbir<1990,  `linef' ///
> || lfit mmr_ma yearbirth if yearbir<=1975&yearbir>=1965, `linef'

. graph export "$OUT/graphs/Nigeria_mmr.eps", as(eps) replace        
(file ~/investigacion/Activa/MMR/Results/graphs/Nigeria_mmr.eps written in EPS 
> format)

. 
. *****************************************************************************
> ***
. *** (3a) Zimbabwe Estimates Education
. *****************************************************************************
> ***
. local Zcont   i.v024 age1980 rural i.DHSyear

. local se      cluster(v024)

. 
. local treat   dumage dumageXage1980less14 invdumageXage1980less14

. local tcon2   dumage14sq invdumage14sq

. local tcon3   dumage14sq invdumage14sq dumage14th invdumage14th

. local tsamp   age1980>=6&age1980<=22

. 
. local placebo dumage_alt dumageXage1980less20 invdumageXage1980less20

. local pcon2   dumage20sq invdumage20sq

. local pcon3   dumage20sq invdumage20sq dumage20th invdumage20th

. local psamp   age1980>=12&age1980<=28

. 
. 
. use "$DAT/Zimbabwe/educ", clear
(Education data for Zimbabwe from DHS IR (Bhalotra and Clarke, 2015))

. estpost sum education highschool dumage yearbirth if age1980>=6&age1980<=22

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd) 
-------------+-------------------------------------------------------
   education |     10198      10198   7.049912   16.83079   4.102535 
  highschool |     10201      10201   .4391726   .2463242   .4963106 
      dumage |     10201      10201    .622488   .2350197   .4847883 
   yearbirth |     10201      10201   1966.128   22.90685    4.78611 

             |    e(min)     e(max)     e(sum) 
-------------+---------------------------------
   education |         0         99      71895 
  highschool |         0          1       4480 
      dumage |         0          1       6350 
   yearbirth |      1956       1974   2.01e+07 

. estout using "$OUT/tables/sumStatsCountry.xls", append `opts'
(output written to ~/investigacion/Activa/MMR/Results/tables/sumStatsCountry.xl
> s)

. 
. foreach o in Zimbabwe ZimbabwePlacebo {
  2.     cap rm "$OUT/tables/`o'.xls"
  3.     cap rm "$OUT/tables/`o'.txt"
  4. }

. 
. **TREATMENT
. foreach y of varlist education {
  2.     reg `y' `treat' `Zcont' if `tsamp', `se'
  3.     outreg2 `treat' using "$OUT/tables/Zimbabwe.xls", excel
  4.     reg `y' `treat' `Zcont' `tcon2' if `tsamp', `se'
  5.     outreg2 `treat' using "$OUT/tables/Zimbabwe.xls", excel
  6.     reg `y' `treat' `Zcont' `tcon3' if `tsamp', `se'
  7.     outreg2 `treat' using "$OUT/tables/Zimbabwe.xls", excel
  8. }
note: age1980 omitted because of collinearity

Linear regression                                      Number of obs =   10198
                                                       F(  6,     9) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.2231
                                                       Root MSE      =  3.6189

                                  (Std. Err. adjusted for 10 clusters in v024)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dumage |    1.24406   .1964133     6.33   0.000     .7997426    1.688378
dumageXag~14 |  -.1863435   .0257114    -7.25   0.000    -.2445068   -.1281803
invdumage~14 |  -.1351217   .0313269    -4.31   0.002    -.2059881   -.0642552
             |
        v024 |
          2  |  -.6602522   .0118574   -55.68   0.000    -.6870756   -.6334289
          3  |   .6425472   .0119784    53.64   0.000     .6154501    .6696443
          4  |  -.7583976   .0166351   -45.59   0.000    -.7960289   -.7207663
          5  |  -.6891694    .015053   -45.78   0.000    -.7232216   -.6551172
          6  |   .5269884   .0135599    38.86   0.000     .4963138     .557663
          7  |   .4468899    .017319    25.80   0.000     .4077116    .4860681
          8  |  -.1325941   .0096688   -13.71   0.000    -.1544664   -.1107218
          9  |   .3858148   .1367983     2.82   0.020     .0763555    .6952741
         10  |   .3574919   .1423772     2.51   0.033     .0354124    .6795714
             |
     age1980 |          0  (omitted)
       rural |  -2.362668   .1619469   -14.59   0.000    -2.729017   -1.996318
             |
     DHSyear |
       1999  |   .3279505   .0660259     4.97   0.001     .1785896    .4773114
       2005  |  -.1447138   .1088692    -1.33   0.216    -.3909929    .1015654
       2010  |   .3780401   .1318516     2.87   0.019      .079771    .6763091
             |
       _cons |   7.445384   .2098306    35.48   0.000     6.970714    7.920054
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/Zimbabwe.xls
dir : seeout
note: age1980 omitted because of collinearity

Linear regression                                      Number of obs =   10198
                                                       F(  8,     9) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.2260
                                                       Root MSE      =  3.6124

                                  (Std. Err. adjusted for 10 clusters in v024)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dumage |   .4456997   .1820713     2.45   0.037     .0338257    .8575737
dumageXag~14 |  -.5749592   .0681723    -8.43   0.000    -.7291757   -.4207427
invdumage~14 |  -.3243077   .1132342    -2.86   0.019    -.5804612   -.0681543
             |
        v024 |
          2  |  -.6530369   .0118762   -54.99   0.000    -.6799027   -.6261711
          3  |   .6402041    .011952    53.56   0.000     .6131668    .6672413
          4  |   -.751441   .0171349   -43.85   0.000    -.7902028   -.7126792
          5  |  -.6849491   .0147893   -46.31   0.000    -.7184048   -.6514934
          6  |   .5277283   .0133724    39.46   0.000     .4974779    .5579787
          7  |   .4521534   .0178715    25.30   0.000     .4117254    .4925815
          8  |  -.1305941   .0093874   -13.91   0.000    -.1518299   -.1093583
          9  |   .4002885   .1386624     2.89   0.018     .0866125    .7139646
         10  |   .3747615     .14484     2.59   0.029     .0471107    .7024123
             |
     age1980 |          0  (omitted)
       rural |  -2.349267   .1642727   -14.30   0.000    -2.720878   -1.977656
             |
     DHSyear |
       1999  |   .3315297   .0673374     4.92   0.001     .1792019    .4838575
       2005  |  -.1372176   .1095479    -1.25   0.242    -.3850321     .110597
       2010  |    .383235   .1319404     2.90   0.017     .0847651    .6817048
             |
  dumage14sq |  -.0463656   .0064027    -7.24   0.000    -.0608496   -.0318817
invdumage1~q |   .0219444   .0135837     1.62   0.141    -.0087842     .052673
       _cons |   7.717967   .2400353    32.15   0.000     7.174969    8.260964
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/Zimbabwe.xls
dir : seeout
note: age1980 omitted because of collinearity

Linear regression                                      Number of obs =   10198
                                                       F(  8,     9) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.2266
                                                       Root MSE      =  3.6115

                                  (Std. Err. adjusted for 10 clusters in v024)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dumage |   .5092689   .3267869     1.56   0.154    -.2299745    1.248512
dumageXag~14 |  -.9339437   .1888711    -4.94   0.001      -1.3612   -.5066877
invdumage~14 |  -.0588092   .2989325    -0.20   0.848    -.7350414    .6174231
             |
        v024 |
          2  |  -.6573233   .0123677   -53.15   0.000     -.685301   -.6293456
          3  |   .6369306   .0117073    54.40   0.000     .6104468    .6634144
          4  |  -.7563348   .0178295   -42.42   0.000    -.7966679   -.7160017
          5  |   -.687005   .0160128   -42.90   0.000    -.7232284   -.6507816
          6  |   .5259471   .0150714    34.90   0.000     .4918531    .5600411
          7  |   .4530097   .0180413    25.11   0.000     .4121975    .4938219
          8  |  -.1348864   .0104017   -12.97   0.000    -.1584168    -.111356
          9  |    .402581   .1392474     2.89   0.018     .0875816    .7175804
         10  |   .3743551   .1460817     2.56   0.031     .0438953    .7048149
             |
     age1980 |          0  (omitted)
       rural |  -2.342632   .1666919   -14.05   0.000    -2.719716   -1.965549
             |
     DHSyear |
       1999  |   .3307378   .0693071     4.77   0.001     .1739542    .4875213
       2005  |  -.1345627   .1112368    -1.21   0.257    -.3861979    .1170725
       2010  |   .3819096   .1345753     2.84   0.019     .0774791      .68634
             |
  dumage14sq |  -.1604364   .0520151    -3.08   0.013    -.2781026   -.0427701
invdumage1~q |  -.0504335    .087568    -0.58   0.579    -.2485262    .1476591
  dumage14th |  -.0092505   .0040446    -2.29   0.048    -.0184001    -.000101
invdumage1~h |   .0055219   .0068338     0.81   0.440    -.0099372     .020981
       _cons |   7.469972    .315025    23.71   0.000     6.757336    8.182608
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/Zimbabwe.xls
dir : seeout

. 
. **PLACEBO
. foreach y of varlist education /*highschool*/ {
  2.     reg `y' `placebo' `Zcont' if `psamp', `se'
  3.     outreg2 `placebo' using "$OUT/tables/ZimbabwePlacebo.xls", excel
  4.     reg `y' `placebo' `Zcont' `pcon2' if `psamp', `se'
  5.     outreg2 `placebo' using "$OUT/tables/ZimbabwePlacebo.xls", excel
  6.     reg `y' `placebo' `Zcont' `pcon3' if `psamp', `se'
  7.     outreg2 `placebo' using "$OUT/tables/ZimbabwePlacebo.xls", excel
  8. }
note: age1980 omitted because of collinearity

Linear regression                                      Number of obs =    6773
                                                       F(  6,     9) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1844
                                                       Root MSE      =  3.9238

                                  (Std. Err. adjusted for 10 clusters in v024)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  dumage_alt |  -.6678094   .3444882    -1.94   0.085    -1.447096     .111477
dumageXage~t |  -.3718001   .0344923   -10.78   0.000     -.449827   -.2937732
invdumageX~t |  -.0726907   .0622418    -1.17   0.273    -.2134914    .0681101
             |
        v024 |
          2  |   -.394669   .0152537   -25.87   0.000    -.4291752   -.3601627
          3  |   .7822592   .0154339    50.68   0.000     .7473453     .817173
          4  |  -.7834136   .0251368   -31.17   0.000    -.8402771   -.7265502
          5  |  -.7057911    .015935   -44.29   0.000    -.7418386   -.6697437
          6  |   .6325048   .0146335    43.22   0.000     .5994016     .665608
          7  |   .1125597   .0239239     4.70   0.001       .05844    .1666794
          8  |  -.1871805   .0125042   -14.97   0.000     -.215467    -.158894
          9  |   .4369224    .213987     2.04   0.072    -.0471499    .9209946
         10  |   .3990139   .2257001     1.77   0.111    -.1115551    .9095829
             |
     age1980 |          0  (omitted)
       rural |  -2.840258   .2499249   -11.36   0.000    -3.405627   -2.274889
             |
     DHSyear |
       1999  |   .4298359   .1219788     3.52   0.006     .1539007    .7057712
       2005  |   .0117411    .133885     0.09   0.932    -.2911278      .31461
       2010  |   .2750123   .1982618     1.39   0.199    -.1734871    .7235117
             |
       _cons |   6.938857   .3904348    17.77   0.000     6.055632    7.822081
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/ZimbabwePlacebo.xls
dir : seeout
note: age1980 omitted because of collinearity

Linear regression                                      Number of obs =    6773
                                                       F(  8,     9) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1880
                                                       Root MSE      =  3.9158

                                  (Std. Err. adjusted for 10 clusters in v024)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  dumage_alt |  -.3721949   .3191377    -1.17   0.273    -1.094135    .3497448
dumageXage~t |   .0626659   .1085365     0.58   0.578    -.1828608    .3081926
invdumageX~t |  -.2559245   .1178456    -2.17   0.058    -.5225098    .0106609
             |
        v024 |
          2  |  -.4150765   .0131754   -31.50   0.000    -.4448812   -.3852718
          3  |   .7619192   .0126888    60.05   0.000     .7332152    .7906232
          4  |  -.7829028   .0258941   -30.23   0.000    -.8414792   -.7243263
          5  |  -.7009743   .0165487   -42.36   0.000    -.7384101   -.6635386
          6  |   .6306342   .0145658    43.30   0.000     .5976842    .6635843
          7  |   .1001437   .0262425     3.82   0.004     .0407791    .1595083
          8  |  -.2021083   .0125298   -16.13   0.000    -.2304528   -.1737638
          9  |   .4207508   .2229016     1.89   0.092    -.0834875    .9249892
         10  |   .4079711   .2320794     1.76   0.113    -.1170289    .9329711
             |
     age1980 |          0  (omitted)
       rural |  -2.832588   .2567985   -11.03   0.000    -3.413506   -2.251669
             |
     DHSyear |
       1999  |    .438948   .1196276     3.67   0.005     .1683316    .7095644
       2005  |  -.0059501   .1302006    -0.05   0.965    -.3004844    .2885841
       2010  |   .3621412   .1945101     1.86   0.096    -.0778711    .8021536
             |
  dumage20sq |   .0525152   .0142005     3.70   0.005     .0203914     .084639
invdumage2~q |   .0216347   .0101149     2.14   0.061    -.0012468    .0445162
       _cons |    7.21658     .46169    15.63   0.000     6.172165    8.260995
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/ZimbabwePlacebo.xls
dir : seeout
note: age1980 omitted because of collinearity

Linear regression                                      Number of obs =    6773
                                                       F(  8,     9) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1882
                                                       Root MSE      =  3.9158

                                  (Std. Err. adjusted for 10 clusters in v024)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  dumage_alt |  -.8244443   .8328216    -0.99   0.348    -2.708418    1.059529
dumageXage~t |  -.1711178   .2146795    -0.80   0.446    -.6567565     .314521
invdumageX~t |  -.6238614   .6975382    -0.89   0.394    -2.201802    .9540796
             |
        v024 |
          2  |  -.4188767   .0135252   -30.97   0.000    -.4494727   -.3882806
          3  |   .7647159   .0130808    58.46   0.000     .7351251    .7943066
          4  |  -.7862194   .0281446   -27.94   0.000    -.8498868    -.722552
          5  |  -.7044465   .0165686   -42.52   0.000    -.7419271   -.6669658
          6  |   .6335831   .0173719    36.47   0.000     .5942851    .6728811
          7  |   .1023255   .0264276     3.87   0.004      .042542    .1621089
          8  |   -.203123   .0132768   -15.30   0.000    -.2331572   -.1730887
          9  |   .4210706   .2221642     1.90   0.091    -.0814997     .923641
         10  |   .4122881    .229823     1.79   0.106    -.1076078    .9321839
             |
     age1980 |          0  (omitted)
       rural |   -2.82481    .254326   -11.11   0.000    -3.400135   -2.249484
             |
     DHSyear |
       1999  |   .4354613   .1192497     3.65   0.005     .1656997     .705223
       2005  |  -.0028277    .130755    -0.02   0.983    -.2986161    .2929607
       2010  |   .3560204   .1989164     1.79   0.107    -.0939597    .8060006
             |
  dumage20sq |  -.0224941   .0661973    -0.34   0.742    -.1722428    .1272546
invdumage2~q |   .1232381   .1773815     0.69   0.505    -.2780268    .5245029
  dumage20th |  -.0061484   .0057505    -1.07   0.313    -.0191569    .0068602
invdumage2~h |  -.0078511   .0135025    -0.58   0.575    -.0383959    .0226937
       _cons |   7.544183   .9604588     7.85   0.000     5.371474    9.716892
------------------------------------------------------------------------------
~/investigacion/Activa/MMR/Results/tables/ZimbabwePlacebo.xls
dir : seeout

. 
. **GRAPHICAL
. collapse education, by(yearbirth)

. graph twoway line education yearbirth, scheme(s1color)            ///
> ytitle("Years of Education") xtitle("Respondent's Year of Birth") ///
> xline(1966, lcolor(black) lpattern(dot)) legend(off)              ///
> || lfit educ yearbirth if yearbirth<=1966, `linef'                ///
> || lfit educ yearbirth if yearbirth>=1966, `linef'

. graph export "$OUT/graphs/Zimbabwe_educ.eps", as(eps) replace
(file ~/investigacion/Activa/MMR/Results/graphs/Zimbabwe_educ.eps written in EP
> S format)

. 
. *****************************************************************************
> ***
. *** (3b) Zimbabwe Estimates MMR
. *****************************************************************************
> ***
. use "$DAT/Zimbabwe/mmr", clear
(MMR data for Zimbabwe from DHS IR (Bhalotra and Clarke, 2015))

. replace age=floor(age)
(81243 real changes made)

. 
. estpost sum mmr mmr_25 dumage yearbirth if `tsamp'

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd) 
-------------+-------------------------------------------------------
         mmr |     28631      28631   .0110719   .0109497   .1046409 
      mmr_25 |     28631      28631   .0030037   .0029948   .0547249 
      dumage |     28842      28842   .6118854   .2374899   .4873293 
   yearbirth |     28842      28842   1966.023   22.42567   4.735575 

             |    e(min)     e(max)     e(sum) 
-------------+---------------------------------
         mmr |         0          1        317 
      mmr_25 |         0          1         86 
      dumage |         0          1      17648 
   yearbirth |      1957       1974   5.67e+07 

. estout using "$OUT/tables/sumStatsCountry.xls", append `opts'
(output written to ~/investigacion/Activa/MMR/Results/tables/sumStatsCountry.xl
> s)

. 
. **TREATMENT
. reg mmr `treat' `Zcont' if `tsamp', `se'
note: age1980 omitted because of collinearity

Linear regression                                      Number of obs =   28631
                                                       F(  6,     9) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0021
                                                       Root MSE      =  .10456

                                  (Std. Err. adjusted for 10 clusters in v024)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dumage |  -.0041308   .0014339    -2.88   0.018    -.0073746    -.000887
dumageXag~14 |   .0001553   .0003108     0.50   0.629    -.0005478    .0008583
invdumage~14 |  -.0002492   .0004324    -0.58   0.578    -.0012273    .0007289
             |
        v024 |
          2  |   .0002319   .0002402     0.97   0.360    -.0003115    .0007754
          3  |   -.000566   .0002749    -2.06   0.070    -.0011879    .0000559
          4  |   -.001974   .0003046    -6.48   0.000     -.002663    -.001285
          5  |  -.0043803    .000313   -13.99   0.000    -.0050884   -.0036722
          6  |  -.0002258   .0003673    -0.61   0.554    -.0010567    .0006051
          7  |  -.0018594   .0002903    -6.41   0.000    -.0025161   -.0012027
          8  |  -.0011722   .0002938    -3.99   0.003    -.0018368   -.0005076
          9  |   -.001475    .002731    -0.54   0.602     -.007653     .004703
         10  |  -.0045312   .0025982    -1.74   0.115    -.0104087    .0013463
             |
     age1980 |          0  (omitted)
       rural |   .0020865   .0030651     0.68   0.513    -.0048474    .0090203
             |
     DHSyear |
       1999  |   .0053041   .0015726     3.37   0.008     .0017466    .0088616
       2005  |   .0089773   .0025565     3.51   0.007     .0031942    .0147605
       2010  |   .0104444   .0024206     4.31   0.002     .0049686    .0159203
             |
       _cons |   .0090148    .001928     4.68   0.001     .0046534    .0133762
------------------------------------------------------------------------------

. outreg2 `treat' using "$OUT/tables/Zimbabwe.xls", excel
~/investigacion/Activa/MMR/Results/tables/Zimbabwe.xls
dir : seeout

. reg mmr `treat' `Zcont' `tcon2' if `tsamp', `se'
note: age1980 omitted because of collinearity

Linear regression                                      Number of obs =   28631
                                                       F(  8,     9) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0022
                                                       Root MSE      =  .10456

                                  (Std. Err. adjusted for 10 clusters in v024)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dumage |  -.0002834    .004514    -0.06   0.951    -.0104948     .009928
dumageXag~14 |    .000186   .0010663     0.17   0.865    -.0022261     .002598
invdumage~14 |   .0021875    .002349     0.93   0.376    -.0031264    .0075013
             |
        v024 |
          2  |   .0002297   .0002396     0.96   0.363    -.0003122    .0007717
          3  |  -.0005791   .0002715    -2.13   0.062    -.0011932    .0000351
          4  |  -.0019752   .0003071    -6.43   0.000    -.0026699   -.0012804
          5  |  -.0043927   .0003139   -13.99   0.000    -.0051028   -.0036826
          6  |  -.0002214   .0003707    -0.60   0.565    -.0010599    .0006171
          7  |  -.0018757   .0002936    -6.39   0.000      -.00254   -.0012115
          8  |  -.0011933   .0002953    -4.04   0.003    -.0018613   -.0005252
          9  |  -.0014683   .0027388    -0.54   0.605    -.0076639    .0047273
         10  |  -.0045584   .0026111    -1.75   0.115     -.010465    .0013483
             |
     age1980 |          0  (omitted)
       rural |   .0020862   .0030759     0.68   0.515     -.004872    .0090444
             |
     DHSyear |
       1999  |   .0052866   .0015751     3.36   0.008     .0017235    .0088497
       2005  |   .0089557   .0025609     3.50   0.007     .0031625     .014749
       2010  |   .0104011   .0024066     4.32   0.002      .004957    .0158453
             |
  dumage14sq |   3.80e-06   .0001199     0.03   0.975    -.0002674     .000275
invdumage1~q |   -.000282   .0002659    -1.06   0.316    -.0008835    .0003195
       _cons |   .0052319    .003426     1.53   0.161    -.0025183    .0129821
------------------------------------------------------------------------------

. outreg2 `treat' using "$OUT/tables/Zimbabwe.xls", excel
~/investigacion/Activa/MMR/Results/tables/Zimbabwe.xls
dir : seeout

. reg mmr `treat' `Zcont' `tcon3' if `tsamp', `se'
note: age1980 omitted because of collinearity

Linear regression                                      Number of obs =   28631
                                                       F(  8,     9) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0022
                                                       Root MSE      =  .10456

                                  (Std. Err. adjusted for 10 clusters in v024)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dumage |   .0026549   .0070068     0.38   0.714    -.0131956    .0185053
dumageXag~14 |   .0005818   .0022724     0.26   0.804    -.0045588    .0057224
invdumage~14 |   .0051596   .0067632     0.76   0.465      -.01014    .0204591
             |
        v024 |
          2  |    .000232   .0002396     0.97   0.358    -.0003099     .000774
          3  |  -.0005891   .0002706    -2.18   0.057    -.0012013     .000023
          4  |  -.0019652   .0003063    -6.42   0.000    -.0026579   -.0012724
          5  |  -.0043909   .0003157   -13.91   0.000     -.005105   -.0036768
          6  |  -.0002267   .0003699    -0.61   0.555    -.0010634    .0006099
          7  |  -.0018766   .0002925    -6.42   0.000    -.0025383   -.0012149
          8  |  -.0011996   .0002921    -4.11   0.003    -.0018604   -.0005387
          9  |  -.0014858   .0027403    -0.54   0.601    -.0076849    .0047132
         10  |  -.0045701   .0026094    -1.75   0.114    -.0104731    .0013328
             |
     age1980 |          0  (omitted)
       rural |   .0020769   .0030771     0.67   0.517    -.0048839    .0090377
             |
     DHSyear |
       1999  |   .0052883   .0015724     3.36   0.008     .0017313    .0088453
       2005  |   .0089397   .0025555     3.50   0.007     .0031588    .0147205
       2010  |    .010382    .002407     4.31   0.002      .004937     .015827
             |
  dumage14sq |   .0001326    .000652     0.20   0.843    -.0013423    .0016075
invdumage1~q |  -.0010831   .0016885    -0.64   0.537    -.0049027    .0027365
  dumage14th |   .0000106   .0000511     0.21   0.840    -.0001049    .0001262
invdumage1~h |   .0000606   .0001247     0.49   0.639    -.0002215    .0003427
       _cons |   .0025047   .0063819     0.39   0.704    -.0119322    .0169415
------------------------------------------------------------------------------

. outreg2 `treat' using "$OUT/tables/Zimbabwe.xls", excel
~/investigacion/Activa/MMR/Results/tables/Zimbabwe.xls
dir : seeout

. 
. **PLACEBO
. reg mmr `placebo' `Zcont' if `psamp', `se'
note: age1980 omitted because of collinearity

Linear regression                                      Number of obs =   20836
                                                       F(  6,     9) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0013
                                                       Root MSE      =  .11014

                                  (Std. Err. adjusted for 10 clusters in v024)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  dumage_alt |   .0043888   .0030726     1.43   0.187    -.0025618    .0113394
dumageXage~t |   .0004892   .0002676     1.83   0.101    -.0001162    .0010945
invdumageX~t |    .000598   .0005421     1.10   0.299    -.0006282    .0018243
             |
        v024 |
          2  |   .0025512    .000156    16.35   0.000     .0021983    .0029041
          3  |  -.0002723   .0001886    -1.44   0.183    -.0006991    .0001544
          4  |   .0005064    .000384     1.32   0.220    -.0003622    .0013749
          5  |  -.0040252   .0002507   -16.05   0.000    -.0045924   -.0034579
          6  |   .0004832   .0002079     2.32   0.045     .0000128    .0009535
          7  |   .0001514   .0003683     0.41   0.691    -.0006818    .0009845
          8  |   .0020971   .0002242     9.35   0.000     .0015898    .0026044
          9  |   .0011979   .0026913     0.45   0.667    -.0048902    .0072859
         10  |  -.0011806   .0027831    -0.42   0.681    -.0074765    .0051153
             |
     age1980 |          0  (omitted)
       rural |   .0037605   .0030533     1.23   0.249    -.0031465    .0106675
             |
     DHSyear |
       1999  |   .0034915   .0019834     1.76   0.112    -.0009953    .0079783
       2005  |   .0068907   .0023835     2.89   0.018     .0014989    .0122826
       2010  |    .006623   .0032511     2.04   0.072    -.0007315    .0139776
             |
       _cons |   .0035681   .0051071     0.70   0.502    -.0079851    .0151212
------------------------------------------------------------------------------

. outreg2 `placebo' using "$OUT/tables/ZimbabwePlacebo.xls", excel
~/investigacion/Activa/MMR/Results/tables/ZimbabwePlacebo.xls
dir : seeout

. reg mmr `placebo' `Zcont' `pcon2' if `psamp', `se'
note: age1980 omitted because of collinearity

Linear regression                                      Number of obs =   20836
                                                       F(  8,     9) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0014
                                                       Root MSE      =  .11014

                                  (Std. Err. adjusted for 10 clusters in v024)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  dumage_alt |  -.0014248    .006051    -0.24   0.819    -.0151132    .0122636
dumageXage~t |   -.000297   .0013347    -0.22   0.829    -.0033163    .0027224
invdumageX~t |  -.0025344   .0025323    -1.00   0.343    -.0082629    .0031941
             |
        v024 |
          2  |   .0025456   .0001681    15.14   0.000     .0021653    .0029259
          3  |  -.0002496   .0001824    -1.37   0.204    -.0006623    .0001631
          4  |   .0005468   .0003706     1.48   0.174    -.0002915    .0013852
          5  |  -.0040241   .0002682   -15.00   0.000    -.0046309   -.0034173
          6  |    .000499   .0002284     2.18   0.057    -.0000178    .0010158
          7  |   .0001546   .0003657     0.42   0.682    -.0006727     .000982
          8  |   .0021101   .0002313     9.12   0.000     .0015869    .0026333
          9  |   .0012011   .0026611     0.45   0.662    -.0048188     .007221
         10  |  -.0011854   .0027555    -0.43   0.677    -.0074186    .0050479
             |
     age1980 |          0  (omitted)
       rural |   .0037354   .0030319     1.23   0.249    -.0031233     .010594
             |
     DHSyear |
       1999  |   .0035036   .0019852     1.76   0.111    -.0009873    .0079944
       2005  |   .0069076   .0023793     2.90   0.018     .0015253      .01229
       2010  |   .0066427   .0032445     2.05   0.071    -.0006968    .0139822
             |
  dumage20sq |  -.0000963   .0001584    -0.61   0.558    -.0004546     .000262
invdumage2~q |   .0003679   .0002936     1.25   0.242    -.0002963     .001032
       _cons |   .0083975    .007488     1.12   0.291    -.0085415    .0253364
------------------------------------------------------------------------------

. outreg2 `placebo' using "$OUT/tables/ZimbabwePlacebo.xls", excel
~/investigacion/Activa/MMR/Results/tables/ZimbabwePlacebo.xls
dir : seeout

. reg mmr `placebo' `Zcont' `pcon3' if `psamp', `se'
note: age1980 omitted because of collinearity

Linear regression                                      Number of obs =   20836
                                                       F(  8,     9) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0014
                                                       Root MSE      =  .11014

                                  (Std. Err. adjusted for 10 clusters in v024)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  dumage_alt |   -.000423   .0068441    -0.06   0.952    -.0159054    .0150594
dumageXage~t |  -.0026613   .0033754    -0.79   0.451    -.0102971    .0049744
invdumageX~t |   -.000121    .006782    -0.02   0.986     -.015463    .0152211
             |
        v024 |
          2  |    .002549   .0001681    15.16   0.000     .0021688    .0029293
          3  |   -.000274   .0001915    -1.43   0.186    -.0007072    .0001591
          4  |    .000568   .0003641     1.56   0.153    -.0002557    .0013917
          5  |  -.0040153   .0002747   -14.62   0.000    -.0046368   -.0033938
          6  |   .0005107   .0002342     2.18   0.057    -.0000191    .0010405
          7  |   .0001491   .0003611     0.41   0.689    -.0006678    .0009661
          8  |   .0021067   .0002293     9.19   0.000     .0015879    .0026255
          9  |   .0011801   .0026597     0.44   0.668    -.0048365    .0071967
         10  |  -.0012074   .0027591    -0.44   0.672     -.007449    .0050342
             |
     age1980 |          0  (omitted)
       rural |    .003727   .0030287     1.23   0.250    -.0031245    .0105785
             |
     DHSyear |
       1999  |   .0035193   .0019653     1.79   0.107    -.0009266    .0079651
       2005  |   .0068894   .0023896     2.88   0.018     .0014838     .012295
       2010  |   .0066189   .0032285     2.05   0.071    -.0006844    .0139223
             |
  dumage20sq |  -.0008552   .0009802    -0.87   0.406    -.0030726    .0013622
invdumage2~q |  -.0002914   .0019019    -0.15   0.882    -.0045938     .004011
  dumage20th |  -.0000622   .0000772    -0.81   0.441    -.0002368    .0001124
invdumage2~h |   .0000504   .0001545     0.33   0.752    -.0002992       .0004
       _cons |   .0062072   .0079218     0.78   0.453    -.0117132    .0241277
------------------------------------------------------------------------------

. outreg2 `placebo' using "$OUT/tables/ZimbabwePlacebo.xls", excel
~/investigacion/Activa/MMR/Results/tables/ZimbabwePlacebo.xls
dir : seeout

. 
. **GRAPHS
. collapse mmr [pw=v005], by(yearbirth)

. keep if year>1930
(15 observations deleted)

. egen mmr_ma=ma(mmr)
(2 missing values generated)

. graph twoway line mmr_ma yearbir if yearbirth>1952&yearbirth<1990,  ///
> scheme(s1color) ytitle("Maternal Mortality")                        ///
> xline(1966, lcolor(black) lpattern(dot)) legend(off)                ///
> || lfit mmr_ma yearbirth if yearbirth<=1966&yearbirth>1952, `linef' ///
> || lfit mmr_ma yearbirth if yearbirth>=1966&yearbirth<1990, `linef' 

. graph export "$OUT/graphs/Zimbabwe_mmr.eps", as(eps) replace
(file ~/investigacion/Activa/MMR/Results/graphs/Zimbabwe_mmr.eps written in EPS
>  format)

. 
. 
. *****************************************************************************
> ***
. *** (4a) Kenya Estimates Education
. *****************************************************************************
> ***
. local Kcont age age2 age3 trend trend2 rural i.ethnicity i.birthquarter

. local wt    [pw=v005]

. local se    cluster(quarter)

. 
. 
. use "$DAT/Kenya/educ", clear
(Education data for Kenya from DHS IR (Bhalotra and Clarke, 2015))

. replace education = . if education > 25
(0 real changes made)

. 
. estpost sum educ treat yearbirth

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd) 
-------------+-------------------------------------------------------
   education |     13712      13712   7.168466   17.21529   4.149131 
       treat |     13712      13712   .5752306   .1964262      .4432 
   yearbirth |     13712      13712   1968.389   66.36617   8.146544 

             |    e(min)     e(max)     e(sum) 
-------------+---------------------------------
   education |         0         23      98294 
       treat |         0          1   7887.563 
   yearbirth |      1950       1980   2.70e+07 

. estout using "$OUT/tables/sumStatsCountry.xls", append `opts'
(output written to ~/investigacion/Activa/MMR/Results/tables/sumStatsCountry.xl
> s)

. 
. reg educ treat `Kcont' `wt', `se'
(sum of wgt is   1.3775e+10)

Linear regression                                      Number of obs =   13703
                                                       F( 22,   123) =  140.94
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2034
                                                       Root MSE      =  3.5497

                              (Std. Err. adjusted for 124 clusters in quarter)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .9531027   .2648328     3.60   0.000     .4288825    1.477323
         age |   .8895974   .2388879     3.72   0.000     .4167334    1.362461
        age2 |  -.0267286   .0077529    -3.45   0.001    -.0420749   -.0113823
        age3 |   .0002609   .0000799     3.26   0.001     .0001027    .0004191
       trend |   .0627163   .0076107     8.24   0.000     .0476514    .0777811
      trend2 |  -.0002818   .0000462    -6.09   0.000    -.0003733   -.0001903
       rural |  -2.361575   .0845882   -27.92   0.000    -2.529013   -2.194138
             |
   ethnicity |
          2  |   .1553851   .1504609     1.03   0.304     -.142443    .4532132
          3  |   1.023403   .1265446     8.09   0.000     .7729154     1.27389
          4  |   1.362994    .152208     8.95   0.000     1.061707     1.66428
          5  |   .6320817   .1528655     4.13   0.000     .3294937    .9346696
          6  |  -.0813969    .157848    -0.52   0.607    -.3938473    .2310535
          7  |    -.05561   .2293531    -0.24   0.809    -.5096004    .3983803
          8  |   .0205498   .2001986     0.10   0.918    -.3757309    .4168306
          9  |  -1.487512   .2344034    -6.35   0.000    -1.951499   -1.023525
         10  |  -3.343102    .335709    -9.96   0.000    -4.007617   -2.678587
         11  |  -3.568309    .421523    -8.47   0.000    -4.402688    -2.73393
         12  |   -.127106   1.147623    -0.11   0.912    -2.398756    2.144544
         96  |  -1.121472   .3755563    -2.99   0.003    -1.864863   -.3780814
             |
birthquarter |
          2  |   .3609222   .1296701     2.78   0.006     .1042482    .6175962
          3  |  -.0113601   .1218648    -0.09   0.926    -.2525839    .2298638
          4  |   .2896822   .1213881     2.39   0.019     .0494018    .5299625
             |
       _cons |  -4.324723   2.339939    -1.85   0.067    -8.956489    .3070429
------------------------------------------------------------------------------

. outreg2 treat using "$OUT/tables/Kenya.xls", excel replace
~/investigacion/Activa/MMR/Results/tables/Kenya.xls
dir : seeout

. reg educ treat_false `Kcont' `wt', `se'
(sum of wgt is   1.3775e+10)

Linear regression                                      Number of obs =   13703
                                                       F( 22,   123) =  131.92
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2021
                                                       Root MSE      =  3.5526

                              (Std. Err. adjusted for 124 clusters in quarter)
------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treat_false |  -.0993529   .5313149    -0.19   0.852    -1.151058    .9523523
         age |   1.201835   .2255786     5.33   0.000     .7553157    1.648354
        age2 |  -.0365416   .0072935    -5.01   0.000    -.0509787   -.0221046
        age3 |   .0003581   .0000753     4.76   0.000     .0002091    .0005072
       trend |   .0717384   .0181165     3.96   0.000     .0358778     .107599
      trend2 |  -.0002604   .0000995    -2.62   0.010    -.0004573   -.0000634
       rural |  -2.360341   .0848531   -27.82   0.000    -2.528303   -2.192379
             |
   ethnicity |
          2  |    .158721   .1504262     1.06   0.293    -.1390385    .4564804
          3  |   1.033902   .1258221     8.22   0.000     .7848448    1.282959
          4  |   1.367686   .1525625     8.96   0.000     1.065698    1.669674
          5  |   .6360496   .1523418     4.18   0.000     .3344982    .9376009
          6  |  -.0841032   .1573253    -0.53   0.594     -.395519    .2273126
          7  |  -.0627873   .2276053    -0.28   0.783    -.5133181    .3877435
          8  |   .0305332    .200708     0.15   0.879    -.3667559    .4278224
          9  |  -1.469066   .2338409    -6.28   0.000     -1.93194   -1.006193
         10  |  -3.328761   .3420577    -9.73   0.000    -4.005843   -2.651679
         11  |  -3.565594   .4197802    -8.49   0.000    -4.396524   -2.734665
         12  |  -.0827044   1.133177    -0.07   0.942    -2.325759     2.16035
         96  |  -1.120218   .3776803    -2.97   0.004    -1.867813   -.3726232
             |
birthquarter |
          2  |   .3554094    .139915     2.54   0.012     .0784562    .6323626
          3  |  -.0182927   .1287525    -0.14   0.887    -.2731505    .2365651
          4  |   .2774466   .1301369     2.13   0.035     .0198486    .5350446
             |
       _cons |   -7.62564   2.221134    -3.43   0.001    -12.02224   -3.229041
------------------------------------------------------------------------------

. outreg2 treat_false using "$OUT/tables/KenyaPlacebo.xls", excel replace
~/investigacion/Activa/MMR/Results/tables/KenyaPlacebo.xls
dir : seeout

. 
. collapse educ, by(yearbirth)

. graph twoway line educ yearbir, scheme(s1color) legend(off)       ///
> ytitle("Years of Education") xtitle("Respondent's Year of Birth") ///
> xline(1963, lcolor(black) lpattern(dot))                          ///
> xline(1972, lcolor(black) lpattern(dot))                          ///
> || lfit educ yearbirth if yearbirth<=1963, `linef'                ///
> || lfit educ yearbirth if yearbirth>=1972, `linef'                ///
> || lfit educ yearbirth if yearbirth<=1972&yearbirth>=1963, `linef'

. graph export "$OUT/graphs/Kenya_educ.eps", as(eps) replace  
(file ~/investigacion/Activa/MMR/Results/graphs/Kenya_educ.eps written in EPS f
> ormat)

. 
. 
. *****************************************************************************
> ***
. *** (4b) Kenya Estimates MMR
. *****************************************************************************
> ***
. use "$DAT/Kenya/mmr", clear
(MMR data for Kenya from DHS IR (Bhalotra and Clarke, 2015))

. 
. estpost sum mmr mmr_25 treat yearbirth

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd) 
-------------+-------------------------------------------------------
         mmr |     25616      25616   .0121018   .0119558   .1093427 
      mmr_25 |     25616      25616   .0058167   .0057831   .0760465 
       treat |     25686      25686    .547386   .1921242   .4383197 
   yearbirth |     25686      25686   1967.686   60.36964    7.76979 

             |    e(min)     e(max)     e(sum) 
-------------+---------------------------------
         mmr |         0          1        310 
      mmr_25 |         0          1        149 
       treat |         0          1   14060.16 
   yearbirth |      1950       1980   5.05e+07 

. estout using "$OUT/tables/sumStatsCountry.xls", append `opts'
(output written to ~/investigacion/Activa/MMR/Results/tables/sumStatsCountry.xl
> s)

. 
. reg mmr treat `Kcont' `wt', `se'
(sum of wgt is   2.6364e+10)

Linear regression                                      Number of obs =   25602
                                                       F( 22,   123) =    8.07
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0312
                                                       Root MSE      =  .11012

                              (Std. Err. adjusted for 124 clusters in quarter)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0068883   .0055266     1.25   0.215    -.0040512    .0178278
         age |   .0004228   .0054445     0.08   0.938    -.0103543    .0111999
        age2 |   -.000032   .0001589    -0.20   0.841    -.0003466    .0002825
        age3 |   1.92e-07   1.45e-06     0.13   0.895    -2.68e-06    3.06e-06
       trend |  -.0003655   .0002481    -1.47   0.143    -.0008565    .0001255
      trend2 |  -6.66e-07   1.52e-06    -0.44   0.661    -3.67e-06    2.34e-06
       rural |   .0023507   .0018349     1.28   0.203    -.0012813    .0059828
             |
   ethnicity |
          2  |   .0015735   .0030622     0.51   0.608     -.004488     .007635
          3  |  -.0053724   .0033248    -1.62   0.109    -.0119536    .0012089
          4  |   .0005333   .0034793     0.15   0.878    -.0063536    .0074203
          5  |   .0066479   .0029912     2.22   0.028      .000727    .0125688
          6  |   .0041782   .0030577     1.37   0.174    -.0018743    .0102306
          7  |  -.0048186    .004953    -0.97   0.333    -.0146227    .0049854
          8  |  -.0010993    .003108    -0.35   0.724    -.0072514    .0050529
          9  |   .0181346   .0062967     2.88   0.005     .0056708    .0305984
         10  |   .0014552    .005779     0.25   0.802    -.0099839    .0128943
         11  |   .0017145   .0039194     0.44   0.663    -.0060438    .0094728
         12  |   .0102613   .0100744     1.02   0.310    -.0096803    .0302029
         96  |   .0157984   .0072174     2.19   0.030     .0015119    .0300849
             |
birthquarter |
          2  |   -.049391   .0111944    -4.41   0.000    -.0715497   -.0272323
          3  |  -.0692366   .0104281    -6.64   0.000    -.0898784   -.0485948
          4  |  -.0766301   .0098442    -7.78   0.000     -.096116   -.0571441
             |
       _cons |   .1164211   .0610331     1.91   0.059    -.0043903    .2372324
------------------------------------------------------------------------------

. outreg2 treat using "$OUT/tables/Kenya.xls", excel append
~/investigacion/Activa/MMR/Results/tables/Kenya.xls
dir : seeout

. reg mmr treat_false `Kcont' `wt', `se'
(sum of wgt is   2.6364e+10)

Linear regression                                      Number of obs =   25602
                                                       F( 22,   123) =    7.93
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0312
                                                       Root MSE      =  .11012

                              (Std. Err. adjusted for 124 clusters in quarter)
------------------------------------------------------------------------------
             |               Robust
         mmr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treat_false |  -.0152057   .0097828    -1.55   0.123    -.0345701    .0041587
         age |   .0019057   .0049804     0.38   0.703    -.0079526     .011764
        age2 |   -.000075    .000146    -0.51   0.608     -.000364    .0002139
        age3 |   5.87e-07   1.33e-06     0.44   0.661    -2.05e-06    3.23e-06
       trend |   .0001724   .0003228     0.53   0.594    -.0004665    .0008113
      trend2 |  -2.98e-06   1.94e-06    -1.54   0.127    -6.82e-06    8.55e-07
       rural |   .0023563   .0018327     1.29   0.201    -.0012716    .0059841
             |
   ethnicity |
          2  |   .0015941   .0030609     0.52   0.603    -.0044647    .0076529
          3  |  -.0053889   .0033286    -1.62   0.108    -.0119778    .0011999
          4  |   .0005485   .0034816     0.16   0.875    -.0063431    .0074402
          5  |    .006675   .0029933     2.23   0.028       .00075       .0126
          6  |   .0041548   .0030583     1.36   0.177    -.0018989    .0102085
          7  |  -.0048392   .0049602    -0.98   0.331    -.0146577    .0049793
          8  |   -.001069   .0031064    -0.34   0.731    -.0072179    .0050799
          9  |   .0181508   .0062992     2.88   0.005     .0056818    .0306197
         10  |   .0015015   .0057924     0.26   0.796    -.0099643    .0129672
         11  |   .0017328    .003917     0.44   0.659    -.0060206    .0094862
         12  |   .0103081   .0100809     1.02   0.309    -.0096463    .0302626
         96  |   .0157354   .0072187     2.18   0.031     .0014465    .0300244
             |
birthquarter |
          2  |   -.049404   .0111972    -4.41   0.000    -.0715682   -.0272399
          3  |  -.0692891    .010429    -6.64   0.000    -.0899327   -.0486456
          4  |  -.0767043   .0098561    -7.78   0.000    -.0962139   -.0571948
             |
       _cons |   .0918898   .0558862     1.64   0.103    -.0187334    .2025131
------------------------------------------------------------------------------

. outreg2 treat_false using "$OUT/tables/KenyaPlacebo.xls", excel append
~/investigacion/Activa/MMR/Results/tables/KenyaPlacebo.xls
dir : seeout

. 
. **GRAPHS
. collapse mmr [pw=v005], by(yearbirth)

. egen mmr_ma=ma(mmr)
(2 missing values generated)

. graph twoway line mmr yearbirth, scheme(s1color) legend(off)      ///
> ytitle("Maternal Mortality")                                      ///
> xline(1963, lcolor(black) lpattern(dot))                          ///
> xline(1972, lcolor(black) lpattern(dot))                          ///
> || lfit mmr yearbirth if yearbirth<=1963, `linef'                 ///
> || lfit mmr yearbirth if yearbirth>=1972, `linef'                 ///
> || lfit mmr yearbirth if yearbirth<=1972&yearbirth>=1963, `linef'

. graph export "$OUT/graphs/Kenya_mmr.eps", as(eps) replace
(file ~/investigacion/Activa/MMR/Results/graphs/Kenya_mmr.eps written in EPS fo
> rmat)

. 
. 
. *****************************************************************************
> ***
. *** (5) Clean up
. *****************************************************************************
> ***
. log close
      name:  <unnamed>
       log:  /home/damiancclarke/investigacion/Activa/MMR/Log/naturalExperiment
> s.txt
  log type:  text
 closed on:  14 Sep 2015, 16:18:58
-------------------------------------------------------------------------------
